{
  "surname": "Gaiotti",
  "name": "Marco",
  "unit": "NAV",
  "email": "marco.gaiotti@unige.it",
  "phone": "",
  "page": "https://rubrica.unige.it/personale/UkNGXV5t",
  "website": "",
  "unige_id": "701644",
  "scopus_id": "55200599100",
  "role": "Professore associato",
  "grade": "Prof.Associato Legge 240/10 - t.pieno - classe 3",
  "ssd": "IIND-01/B (Costruzioni e impianti navali)",
  "location": [
    {
      "building": "Villa Cambiaso - padiglioni (ED_161450103)",
      "floor": "1° piano",
      "room": "US_161450103.I.020"
    }
  ],
  "career": [
    {
      "role": "RD",
      "from": "2012-12-31 00:00:00.0000000",
      "to": "2018-12-30 00:00:00.0000000"
    },
    {
      "role": "PA",
      "from": "2018-12-31 00:00:00.0000000",
      "to": "2222-02-02 00:00:00.0000000"
    }
  ],
  "responsibilities": [
    {
      "title": "Coordinatore di Corso di studio",
      "from": "2024-11-01 00:00:00.0000000",
      "to": "2027-10-31 00:00:00.0000000",
      "unit": "40126 - CONSIGLIO DEL CORSO DI STUDIO IN INGEGNERIA NAUTICA E YACHT DESIGN"
    }
  ],
  "teaching": {
    "2025": [
      {
        "course": "COSTRUZIONI NAVALI C (56984)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "YACHT CONSTRUCTION TECHNOLOGIES (66388)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2024": [
      {
        "course": "COSTRUZIONI NAVALI C (56984)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "YACHT CONSTRUCTION TECHNOLOGIES (66388)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2023": [
      {
        "course": "COSTRUZIONI NAVALI C (CDL) (56984)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "YACHT CONSTRUCTION TECHNOLOGIES (66388)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2022": [
      {
        "course": "COSTRUZIONI NAVALI C (CDL) (56984)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "YACHT CONSTRUCTION TECHNOLOGIES (66388)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2021": [
      {
        "course": "COSTRUZIONI NAVALI C (CDL) (56984)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "YACHT CONSTRUCTION TECHNOLOGIES (66388)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2020": [
      {
        "course": "COSTRUZIONI NAVALI C (CDL) (56984)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "YACHT CONSTRUCTION TECHNOLOGIES (66388)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ]
  },
  "scopus_metrics": [
    {
      "period": "absolute",
      "hindex": 12,
      "total_products": 67,
      "journals": 34,
      "conferences": 29,
      "citations": 446,
      "start": 1900,
      "end": 2025
    },
    {
      "period": "15 years (2010-2025)",
      "hindex": 12,
      "total_products": 67,
      "journals": 34,
      "conferences": 29,
      "citations": 446,
      "start": 2010,
      "end": 2025
    },
    {
      "period": "10 years (2015-2025)",
      "hindex": 10,
      "total_products": 56,
      "journals": 30,
      "conferences": 24,
      "citations": 338,
      "start": 2015,
      "end": 2025
    },
    {
      "period": "05 years (2020-2025)",
      "hindex": 8,
      "total_products": 34,
      "journals": 20,
      "conferences": 12,
      "citations": 238,
      "start": 2020,
      "end": 2025
    }
  ],
  "scopus_products": [
    {
      "scopus_id": "2-s2.0-85218884211",
      "title": "Experimental and numerical assessment of ultimate strength of a transversally loaded thin-walled deck structure",
      "doi": "10.1016/j.marstruc.2025.103793",
      "venue": "Marine Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": "103",
      "issue_id": null,
      "pages": null,
      "issn": "09518339",
      "eIssn": null,
      "source_id": "21052",
      "authors": "Barsotti Beatrice; Battini Carlo; Gaiotti Marco; Rizzo Cesare Mario; Vergassola Gianmarco",
      "author_ids": "57219353053;56543518100;55200599100;15072981100;57191615489",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Barsotti B.",
      "keywords": "Buckling | Collapse | Large-scale test | Nonlinear analysis | Stiffened panel | Ultimate strength",
      "abstract": "Many studies have been conducted to determine the ultimate strength of axially loaded ship structures at different levels of complexity, considering grillages, stiffened panels, transverse ring frames as well as complete hull blocks, aimed at assessing progressive collapse analysis of the whole hull girder, both analytically and numerically. However, little research has been conducted on the effects that transversal loads can have on relatively thin shell plating, particularly sensitive to buckling phenomena even for rather low loading thresholds. Moreover, the more and more frequent use of higher and higher strength steels makes ship structures slender and, consequently, likely to be even more sensitive to buckling phenomena. In the framework of a research project funded by Fincantieri R&D Department, a full-scale experimental test is performed on a structure simulating a deck portion characterized by a relatively thin plating, such as to induce an early local elastic buckling with a wide post-buckling range, before the ultimate load is reached. Nonlinear finite element analysis is carried out to design the experiment, considering both the nominal and the actual geometry of the structure as obtained by laser scanning the plating and by 3D reconstruction of the stiffeners. The effect of initial plating imperfection and of welding residual stresses on the numerical models has been considered as well, verifying their impact both, on the load end-shortening curve and on the ultimate strength of the panel.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 94,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 90,
              "rank": 69,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 88,
              "rank": 47,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 82,
              "rank": 80,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105016215567",
      "title": "An Overview of the Shipbuilding Labour Market: The LeaderSHIP EU Project",
      "doi": "10.3233/PMST250079",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": "10",
      "issue_id": null,
      "pages": "655-662",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Pais T.; Vergassola G.; Gaiotti M.; Rizzo C. M.; Valtanen J.; Kivela S.; Lenarduzzi W.; Hauninen M.; Laot A. H.; Gilles P. P.; El Faziki M.; Nechita M.; Popescu G.; Thormodsæter J.; Severeide K.; Mendibil A.; Miguelez F.; Campos J. A.; Sanchez-Beaskoetxea J.; Boullosa-Falces D.; Rossi A.",
      "author_ids": "55611778200;57191615489;55200599100;15072981100;60102554300;60102406600;59368573400;60102785200;60102708800;60102481300;60102481400;57204506264;57220533294;60102481500;60102628000;60102481600;60102863100;60102628100;56488011400;57195382082;60102554400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60098990;60098990;133181381;133181696;133181434;60084005;133181432;60008717;60008717;133181400;133181409;133181602;101929443;60006565;60027856;60027856;133181613",
      "corresponding": "Pais T.",
      "keywords": "Shipbuilding Labour Market | Skills Gap Analysis | Technological Innovation",
      "abstract": "In recent years, the maritime technology and shipbuilding industry, including yachts and pleasure crafts as well as marine structures, have faced significant challenges, such as technological advancements, environmental sustainability, and global competitiveness. This article presents a comprehensive investigation conducted within the European project LeaderSHIP, focusing on the current state of training programs for workers in the sector and specifically identifying emerging and urgent skills necessary for future success. Using a mixed-methods approach, data were collected through surveys distributed to industry professionals, educational institution representatives, and companies. The results highlight a disparity between the skills demanded by employers and those provided by training programs. Notably, the investigation reveals critical gaps in essential areas such as sustainable design, technological innovation, and resource management, underscoring the need for immediate action. The analysis emphasizes the importance of continuous updating and a closer alignment between academia and industry. It suggests that collaboration between educational institutions and businesses could significantly enhance training quality. Implementing practical learning programs and internships, along with creating flexible curricula that can adapt to the sector's dynamic needs, is proposed as a vital strategy to address these gaps. Finally, the article discusses future perspectives for training in maritime technology, stressing the necessity to invest in advanced skills and foster a culture of innovation. This study provides valuable insights for policymakers, educators, and entrepreneurs, highlighting the critical need for an integrated approach to effectively tackle the challenges posed by emerging and urgent skills in the shipbuilding industry.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105015841810",
      "title": "Study of the effects of underwater explosions on the bases of on-board equipment in naval units: Experimental validation of numerical models",
      "doi": null,
      "venue": "Rivista Italiana Della Saldatura",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": null,
      "issue_id": "2",
      "pages": "167-185",
      "issn": "00356794",
      "eIssn": null,
      "source_id": "29510",
      "authors": "Mannacio Francesco; Barbato Alfonso; Di Marzo Fabrizio; Gaiotti Marco; Rizzo Cesare Mario; Venturini Marco",
      "author_ids": "57670726600;13005232300;57671630400;55200599100;15072981100;57671630500",
      "authorAffiliationIds": "60025153;60083109;127259049;60025153;60025153;127259049",
      "corresponding": "Mannacio F.",
      "keywords": "computation | Finite element analysis | mathematical models | underwater environment",
      "abstract": "Underwater explosions can cause severe damage not only to on-board equipment, but also to their foundations, whose structural properties are critical to ensure the efficiency of the entire foundation-equipment system. Generally, it is not always possible to ensure compliance with shock requirements through experimental tests, therefore, national regulations also allow verification through calculation. In particular, a dynamic analysis using finite element software is accepted. However, the regulations do not specify in detail the modeling strategies and procedures for the calculation inputs. This paper outlines some useful guidelines in the design phase for shock verification. The validation of the proposed modeling methodology is obtained by comparing the results of numerical simulations with experimental tests data, specifically designed and realized using the medium-weight impact machine (MIL S 901 D). Once again, the parallel use of numerical and experimental analyses is essential to better understand such complex phenomena.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 2,
              "rank": 721,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 0,
              "rank": 412,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85190502162",
      "title": "A rational approach for the scantling design of GRP pleasure crafts",
      "doi": "10.1016/j.oceaneng.2024.117866",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "304",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Gaiotti M.; Aguiari M.; Vergassola G.; Rizzo C. M.",
      "author_ids": "55200599100;57212109023;57191615489;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "GRP vessels | Scantling design | Weight reduction",
      "abstract": "In various fields of industrial engineering, including naval architecture, structural design is considered one of the most challenging steps by designers as it shall accommodate all other design aspects, likely already defined in earlier steps. Moreover, structures need to comply with specific requirements, i.e. limit states, while also performing in accordance with user's demands in terms of mission profile. In a goal-based design perspective, limit state criteria have to be defined accounting for both, structural robustness, functional and operational demands. Construction feasibility is an issue as well, further constraining the scantling design. Balancing construction needs, ship performances and structural aspects is not always an easy task. The environment in which a ship operates is indeed complex and verification of safety and robustness is usually carried out in accordance with classification societies and other rules, possibly applying direct calculations whenever applicable rules do not provide suitable solutions. At the same time, the asset needs to fulfill various attributes specified by the owner. As a matter of facts, the scantling design is mathematically a multivariate and over-constrained problem whose feasible solutions are in fact rather few. In the case of composite pleasure craft hull structures, while the number of design variables increases, feasibility constraints also largely reduce the design space. To address these challenges, designers may nowadays exploit new procedures able to reduce structural weight, though ensuring that the asset performs safely and adequately meeting client's requirements. To achieve this, designers may combine a more rational design philosophy with currently available numerical problem-solving applications to obtain a rational trade-off among all actually feasible solutions, which are relatively few. Thus, the objective of this study is to present a dependable numerical method for determining the scantling while reducing the weight of hull composite structures of pleasure crafts. This method aims to provide the most suitable, high-performing, and safe layout in the quickest and easiest possible manner. It turns out that counterintuitive, yet feasible and fit-for-purpose, structural lay-outs can be obtained.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 89,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 79,
              "rank": 45,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85194164622",
      "title": "A Design Approach to Assess Effects of Non-Contact Underwater Explosions on Naval Composite Vessels",
      "doi": "10.1007/s11804-024-00421-6",
      "venue": "Journal of Marine Science and Application",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "23",
      "issue_id": "2",
      "pages": "316-326",
      "issn": "16719433",
      "eIssn": "19935048",
      "source_id": "5400152711",
      "authors": "Mannacio F.; Di Marzo F.; Gaiotti M.; Rizzo C. M.; Venturini M.",
      "author_ids": "57670726600;57671630400;55200599100;15072981100;57671630500",
      "authorAffiliationIds": "131297705;131297705;60025153;60025153;131297705",
      "corresponding": "Mannacio F.",
      "keywords": "Composites | Experimental analysis | Fluid-structure interaction | Numerical simulation | Preliminary design | Shock resistance | Underwater explosions | Vulnerability",
      "abstract": "Despite the non-contact underwater explosion phenomena (UNDEX) have been studied for decades and several numerical methods have been proposed in literature, its effects on military structures, especially composite ones, are even nowadays matter of research. In early design phases, it is not always possible to verify the shock resistance of hull structures modelling the whole phenomenon, in which fluid, gas and solid properties must be properly set in a fully coupled fluid-structure interaction (FSI) numerical model. These ones are extremely complex to set, computationally demanding and certainly not suitable for everyday design practice. In this paper, a simplified finite element (FE) model, easy to use in an early design phase, is proposed. Both, the structure and the fluid are simulated. In this approximation, the fluid behaviour is simplified, using special finite elements, available in a commercial software environment. This choice reduces the computational time and numerical efforts avoiding the problem of combining computational fluid dynamics (CFD) and FE domains and equations in a fully coupled fluid-structure interaction model. A typical parallel body block of a minesweeper is modelled, using two-dimensional multi-layered shell elements to properly account for the composite materials behaviour. For the fluid instead, three dimensional volumetric elements, directly coupled to the structural elements, are placed. In addition, the same calculation is performed, modelling separately fluid in the CFD environment and structures in the finite element one. Thus, realizing a fully coupled fluid-structure interaction model. The results obtained by applying both numerical models are compared with the structural response measured on board of a composite ship during a full-scale shock test. The simplified proposed procedure provides results in satisfactory agreement with experiments, allowing the validation of the model. Approximations are discussed and differences with the real phenomenon and fully coupled CFD+FE method are shown, providing a better understanding of the phenomena. Eventually, the modelling strategy has been considered a valuable and cost-effective tool for the concept and preliminary design of composite structures subject to underwater explosions.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 66,
              "rank": 39,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 65,
              "rank": 253,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 61,
              "rank": 44,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 58,
              "rank": 296,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85173522453",
      "title": "Cumulative buckling deformation of stiffened panel under cyclic loading",
      "doi": "10.1177/14750902231198902",
      "venue": "Proceedings of the Institution of Mechanical Engineers Part M Journal of Engineering for the Maritime Environment",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "238",
      "issue_id": "2",
      "pages": "375-384",
      "issn": "14750902",
      "eIssn": "20413084",
      "source_id": "25596",
      "authors": "Barsotti Beatrice; Gaiotti Marco",
      "author_ids": "57219353053;55200599100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Barsotti B.",
      "keywords": "collapse analysis | Cyclic loads | finite element analysis | non-linearity | residual plastic strain | structural response | ultimate load",
      "abstract": "In this study, the cumulative buckling deformation process is evaluated for a stiffened panel subjected to two different uniaxial cyclic loading conditions, namely compressive loading only and alternating tensile-compressive loading. The impact of the cyclic load on the ultimate strength of the panel is then estimated. It should be noted that the occurrence of permanent deformations could be simulated by finite element analysis using a suitable model capable of correctly capturing the deformation components. The results show that the structure accumulates a deformation that appears to grow almost linearly therefore, consequently, it is realistic to expect that if a large number of load cycles of this magnitude are imposed, the accumulated plastic deformation can be quite severe. Furthermore, it is found that these residual deformations, caused by an entity of the cyclic load lower than the design limit, affect the tensile strength of the stiffened panel. Finally, the effects on the numerical evaluation of the ultimate strength of the structure are shown.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 68,
              "rank": 37,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 66,
              "rank": 249,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 72,
              "rank": 32,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 67,
              "rank": 238,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85209919571",
      "title": "ISSC 2025 COMMITTEE III.1 - COMPRESSIVE TEST OF A TRANSVERSELY STIFFENED THIN-PLATED STRUCTURE WITH EXPECTED EARLY NONLINEAR RESPONSE PRIOR TO THE ULTIMATE CAPACITY. PRELIMINARY COMPARISON OF THE NUMERICAL RESULTS",
      "doi": "10.1115/OMAE2024-126382",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": "2",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Gaiotti Marco; Barsotti Beatrice; Brubak Lars; Chen Bai Qiao; Darie Ionel; Georgiadis Dimitris; Ishibashi Kinya; Korgesaar Mihkel; Lv Yining; Nahshon Ken; Paredes Marcelo; Ringsberg Jonas; Schipperen Ingrid; Tatsumi Akira; Vaz Murilo; Wang Yikun; Zamarin Albert; Zhan Zhihu",
      "author_ids": "55200599100;57219353053;18036851400;58042067200;57191851147;57205718643;23027352200;55756277400;59420313200;23470080300;54893597000;6602749403;35085515200;56734289400;7101868532;56163204400;24559729900;57887080600",
      "authorAffiliationIds": "60025153;60025153;60072185;60004956;60072185;60019722;60015231;60068861;101832539;60022562;60020547;60000990;60019984;60024322;60000036;60113549;60029546;127631540",
      "corresponding": "Gaiotti M.",
      "keywords": "buckling | FEA | post-buckling response | post-ultimate response | ultimate strength capacity",
      "abstract": "The maritime industry is increasingly utilizing high-strength steels for lightweight ship design. While enhanced yield strength is advantageous, these steels retain the same Young’s modulus as lower strength steel grades posing challenges in designing slender structures, particularly concerning structural buckling strength. In longitudinal stiffened ship structures, transverse buckling effects, though less significant than longitudinal stresses, can be difficult to predict. Addressing this, the regulatory framework for verifying the buckling of transversely stiffened panels for ships is a topic of substantial international discussion. A research project supported by Fincantieri led the University of Genova to develop a test configuration assessing a slender ship structure’s response to transverse loads. The ISSC 2022-2025 Committee III.1 Ultimate Strength is utilizing this test configuration to conduct a numerical benchmark in three phases, with each phase gradually revealing additional experimental data to the study participants. The benchmark aims to predict the entire end-shortening curve as well as ultimate load to understand load redistribution and quantify energy absorption for dynamic events. This paper presents the preliminary results from Phase 1, focusing on diverse modeling strategies impacting outcomes, including element type, mesh size, and interpretation of initial geometric imperfections among participants in the benchmark study.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85209877783",
      "title": "RESIDUAL PLASTIC STRAIN EFFECTS ON THE ULTIMATE CAPACITY FOR A HSLA STIFFENED PANEL SUBJECTED TO TWO DIFFERENT CYCLIC LOAD CONDITIONS",
      "doi": "10.1115/OMAE2024-126720",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": "2",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Barsotti Beatrice; Gaiotti Marco",
      "author_ids": "57219353053;55200599100",
      "authorAffiliationIds": "130704641;130704641",
      "corresponding": "Barsotti B.",
      "keywords": "buckling | Cyclic load | FEM | hardening law | plastic strain | ultimate capacity",
      "abstract": "This paper delves into how plastic deformations accumulate in structures and their effect on the ultimate load strength. More precisely, the study examines how repeated cyclic loads cause plastic deformations, which could have some effects on the ultimate capacity of the structure, in contrast to a continuously rising load. The study suggests a numerical strategy, by means of finite element analyses, to investigate the structural responses of two different load cycle histories and emphasizes differences that arise due to the choice in the material hardening law (model describing material behaviour) like isotropic, kinematic, or the combined Chaboche model. The researchers focus on a stiffened panel made of high-strength, low-alloy steel subjected to both uniaxial compression and alternating tension-compression cyclic loading. In order to capture the arise of the residual plastic strains, the study employs shell element modelling, while also considering initial imperfections. The paper discusses how residual displacements magnitude change as the number of load cycles increases under different loading conditions and material hardening models. Ultimately, it analyses how these accumulated plastic deformations influence the ultimate strength, with a particular emphasis on whether different plastic strain inputs from the two load configurations lead to varying outcomes.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85174731719",
      "title": "An open benchmark to assess the effects of underwater explosions on steel panels using the volume of fluid approach",
      "doi": "10.1016/j.oceaneng.2023.116093",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2023,
      "volume": "288",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Mannacio F.; Di Marzo F.; Gaiotti M.; Rizzo C. M.; Venturini M.",
      "author_ids": "57670726600;57671630400;55200599100;15072981100;57671630500",
      "authorAffiliationIds": "128084535;128084535;60025153;60025153;128084535",
      "corresponding": "Mannacio F.",
      "keywords": "Benchmark | Experimental analysis | Fluid-structure interaction | Numerical simulation | Shock | Underwater explosions",
      "abstract": "Despite the underwater explosion phenomena (UNDEX) have been studied for decades and several numerical methods have been proposed in literature, the simulation of the whole phenomenon in issue is even nowadays a matter of research. In this paper, a Volume of Fluid (VOF) approach, which allows the simulation of Fluid-Structure Interaction (FSI), including the effects of seawater and vapor of cavitation on structures, is calibrated according to theory and experimental data. As a benchmark, a parallelepiped of fluid is built, verifying the effectiveness of the method with reference to some close-in explosions available in literature. In addition, VOF results are compared with the ones achieved from other researchers using the acoustic approximation. Strengths and limits of VOF coupling method are pointed out. In the end, the modelling strategy proposed and validated can be considered a suitable tool for the design of naval structures subject to underwater explosions.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 14,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 48,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85185845946",
      "title": "Evaluation of residual plastic strain on a stiffened panel subjected to compression and tension-compression cyclic load",
      "doi": "10.1201/9781003399759-44",
      "venue": "Advances in the Analysis and Design of Marine Structures Proceedings of the 9th International Conference on Marine Structures Marstruct 2023",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": "403-409",
      "issn": null,
      "eIssn": null,
      "source_id": "21101202189",
      "authors": "Barsotti B.; Gaiotti M.",
      "author_ids": "57219353053;55200599100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Barsotti B.",
      "keywords": null,
      "abstract": "In this study, the process of accumulation of residual plastic deformation is numerically investigated for a stiffened panel under compression and traction-compression cyclic loading conditions. In particular, the difference between results obtained from the only compression cyclic loading case and the tractioncompression loading is shown, highlighting the influence of the changing in the load sign. This is investigated also taking into account different hardening models of the material, namely isotropic or kinematic. The numerical model describes a stiffened panel including the transversal frames, cyclically subjected to axial loading under different time histories: in particular, the maximum compressive load is applied as a fraction of the ultimate load of the intact structure. Finally, the effect of the accumulated plastic deformations on the ultimate strength of the structure is analyzed, in order to evaluate the influence of the cyclic load history.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85185832744",
      "title": "FEM numerical strategies for the evaluation of the accumulated plastic strain due to a cyclic load condition",
      "doi": "10.1201/9781003399759-45",
      "venue": "Advances in the Analysis and Design of Marine Structures Proceedings of the 9th International Conference on Marine Structures Marstruct 2023",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": "411-417",
      "issn": null,
      "eIssn": null,
      "source_id": "21101202189",
      "authors": "Barsotti B.; Gaiotti M.",
      "author_ids": "57219353053;55200599100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Barsotti B.",
      "keywords": null,
      "abstract": "In this study, the phenomenon of accumulation of residual plastic deformation is numerically evaluated for a stiffened panel subjected to uniaxial cyclic loading. In particular, three strategies are investigated through the use of FEM (Finite Element Method) in the ADINA Software environment. The models presented are characterized by the same geometrical characteristics, but differ in the numerical parameters, i.e. mesh density and element type. Namely, a full shell-element model, a full 3D-solid-element model, and a combine shell-solid elements model are investigated. The output of the analyses carried out on the three models are the assessment of the accumulated plastic strain recorded in the unloaded phase of the cyclic analysis and the effect of these residual plastic deformations on the ultimate strength capacity of the structure. Finally, the results of the three models are compared in order to understand which one could be more suitable and reliable for the evaluation of this phenomena, i.e. the arise of plastic residuals and the reduction of the load bearing capacity of the panel.",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85145590797",
      "title": "Cumulative buckling deformation of stiffened panel under cyclic loading",
      "doi": "10.1201/9781003358961-15",
      "venue": "Sustainable Development and Innovations in Marine Technologies Proceedings of the 19th International Congress of the International Maritime Association of the Mediterranean Imam 2022",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": "109-113",
      "issn": null,
      "eIssn": null,
      "source_id": "21101130449",
      "authors": "Barsotti B.; Gaiotti M.",
      "author_ids": "57219353053;55200599100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Barsotti B.",
      "keywords": null,
      "abstract": "In this study, the cumulative process of buckling deformation is evaluated for a stiffened panel sub jected to uniaxial cyclic loading. The impact of cyclic loading on the ultimate strength of the panel is then estimated. It is noted that the arising of permanent deflection could be simulated by finite element method analysis using a suitable model able to capture the strain components properly. The results show that the structure accumulates a deformation that seems to grow almost linearly hence, as a consequence, is realistic to expect that if a large number of load cycles of such magnitude is imposed, the accumulated plastic strain can be quite severe. In addition, it is revealed that such residual deformations, caused by a cyclic load magnitude lower than the design limit, affects the ultimate strength of the stiffened panel. Finally, effects on the numerical evaluation of the ultimate strength of the structure are shown.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85138021167",
      "title": "Characterization of underwater shock transient effects on naval E-glass biaxial fiberglass laminates: An experimental and numerical method",
      "doi": "10.1016/j.apor.2022.103356",
      "venue": "Applied Ocean Research",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "128",
      "issue_id": null,
      "pages": null,
      "issn": "01411187",
      "eIssn": null,
      "source_id": "26776",
      "authors": "Mannacio F.; Di Marzo F.; Gaiotti M.; Guzzo M.; Rizzo C. M.; Venturini M.",
      "author_ids": "57670726600;57671630400;55200599100;57890839800;15072981100;57671630500",
      "authorAffiliationIds": "128084535-60025153;128084535;60025153;60211436;60025153;128084535",
      "corresponding": "Mannacio F.",
      "keywords": "Composites | Experimental analysis | Fiberglass | Numerical simulation | Shock | Underwater explosions",
      "abstract": "Non-contact underwater explosions (UNDEX) can cause extremely large deformations on naval composite structures related to heavily nonlinear phenomena. For this reason, for military purposes, used materials must have excellent shock resistance properties. Historically, the underwater shock transient effects on fiberglass laminates are predicted using quasi-static approaches. In this paper, the composite materials are characterized by experimental modal analysis as well as by a comprehensive series of shock tests, whose results are compared with numerical models. Namely, the MIL S 901 D Medium Weight Shock Machine (MWSM) was used to perform dedicated shock tests, in which composite specimens are supported on a special constraining structure designed to create large deflections and providing reproducible results. A dynamic implicit finite element model has been set, validated by modal analysis at first, and then applied to simulate the MWSM test behavior and to predict the structural response of different E-Glass polyester resin laminates. In the end, the complete comparison of numerical results and experimental data is reviewed to validate the modeling strategies for shock design of navy ships.",
      "citations": 6,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 15,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 13,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85137095436",
      "title": "Ship weight reduction by parametric design of hull scantling",
      "doi": "10.1016/j.oceaneng.2022.112370",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "263",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Aguiari M.; Gaiotti M.; Rizzo C. M.",
      "author_ids": "57212109023;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Aguiari M.",
      "keywords": "Design process | Parametric design | Rule requirements | Scantling | Ship structures",
      "abstract": "In this paper, a semi-automatic design procedure for concept and preliminary phases of hull structural design is described. It allows investigating the design of ship structures, consisting of a series of stiffened panels surrounded by primary members, assembled to form the hull girder. The optimal configuration of the structural lay-out and the best scantling of each structural component (i.e. platings, ordinary stiffeners and primary elements) is provided, accounting for interactions among all structural components as well as integration of primary, secondary and tertiary responses. The proposed method allows the minimization of the overall weight of hull blocks intended as the sum of stiffened panels’ weight (shell and stiffeners) plus that of the surrounding primary members. A dedicated application in VBA language (Visual Basic for Applications) has been developed in which scantling checks have been implemented by applying a few rules formulations after a comprehensive analysis of involved variables defining the state of the hull structural system. The proposed scantling design approach is very practical, it follows well-known hull structural design principles and it takes advantage of the nowadays widely available computation means to update the traditional sequence of the scantling checks in a more rational way and to select the optimal lay-out scantling solutions among truly feasible ones.",
      "citations": 11,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 16,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85139423839",
      "title": "A Quick and Practical Approach for Concept-design of Submerged Thin-walled Stiffened Cylinders",
      "doi": "10.1007/s11804-022-00280-z",
      "venue": "Journal of Marine Science and Application",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "21",
      "issue_id": "3",
      "pages": "138-154",
      "issn": "16719433",
      "eIssn": "19935048",
      "source_id": "5400152711",
      "authors": "Pais Tatiana; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "55611778200;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Pais T.",
      "keywords": "Buckling | Concept/preliminary design | Hull scantling | Limit state design | Optimization | Submarines | Thin-walled cylinders",
      "abstract": "Goal based and limit state design is nowadays a well-established approach in many engineering fields. Ship construction rules started introducing such concepts since early 2000. However, classification societies’ rules do not provide hints on how to verify limit states and to determine the structural layout of submerged thin-walled stiffened cylinders, whose most prominent examples are submarines. Rather, they generally offer guidance and prescriptive formulations to assess shell plating and stiffening members. Such marine structures are studied, designed and built up to carry payloads below the sea surface. In the concept-design stage, the maximum operating depth is the governing hull scantling parameter. Main dimensions are determined based on the analysis of operational requirements. This study proposes a practical concept-design approach for conceptual submarine design, aimed at obtaining hull structures that maximize the payload capacity in terms of available internal volume by suitably adjusting structural layout and stiffening members’ scantling, duly accounting for robustness and construction constraints as well as practical fabrication issues. The proposed scantling process highlights that there is no need of complex algorithms if sound engineering judgment is applied in setting down rationally the hull scantling problem. A systematic approach based on a computer-coded procedure developed on purpose was effectively implemented and satisfactorily applied in design practice.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 66,
              "rank": 39,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 65,
              "rank": 253,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 53,
              "rank": 47,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 52,
              "rank": 300,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85138178431",
      "title": "Shock Characterization of Fiberglass Composite Laminates: Numerical and Experimental Comparison",
      "doi": "10.3233/PMST220048",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "6",
      "issue_id": null,
      "pages": "408-415",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Mannacio Francesco; Di Marzo Fabrizio; Gaiotti Marco; Guzzo Massimo; Rizzo Cesare Mario; Venturini Marco",
      "author_ids": "57670726600;57671630400;55200599100;57890839800;15072981100;57671630500",
      "authorAffiliationIds": "128084535-60025153;128084535;60025153;60211436;60025153;128084535",
      "corresponding": "Mannacio F.",
      "keywords": "composites | design | experimental | numerical | shock",
      "abstract": "When subjected to a no contact underwater explosions (UNDEX), naval composite structures show highly nonlinear deformations. In this paper, fiberglass composite laminates are characterized dynamically. Experimentally, modal analyses are carried out to determine the modal parameters of the specimens, while dedicated shock tests are performed using the MIL S 901 D Medium Weight Shock Machine to measure their shock deformations. Numerically, finite element model is built up, running both modal and implicit dynamic analyses to predict the structural response of different E-Glass laminates. In the end, results obtained by calculations are compared with experimental data, validating the model.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 9,
              "rank": 91,
              "quartile": "Q4"
            },
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 7,
              "rank": 178,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 4,
              "rank": 600,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85135192777",
      "title": "Evaluation of the Residual Capacity of a Submarine for Different Limit States with Various Initial Imperfection Models",
      "doi": "10.1007/s11804-022-00271-0",
      "venue": "Journal of Marine Science and Application",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "21",
      "issue_id": "2",
      "pages": "59-68",
      "issn": "16719433",
      "eIssn": "19935048",
      "source_id": "5400152711",
      "authors": "Pais Tatiana; Gaiotti Marco; Barsotti Beatrice",
      "author_ids": "55611778200;55200599100;57219353053",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Pais T.",
      "keywords": "Buckling | Imperfection model | Limit state design | Residual capacity | Structural response | Submarine hull | Ultimate strength",
      "abstract": "The current design philosophy for submarine hulls, in the preliminary design stage, generally considers as governing limit states material yielding along with various buckling modes. It is common belief that, beyond the design pressure, material yielding of the shell plating should occur first, eventually followed by local buckling, while global buckling currently retains the highest safety factor. On the other hand, in the aeronautical field, in some cases structural components are designed in such a way that local instability may occur within the design loads, being the phenomena inside the material elastic range and not leading to a significant drop in term of stiffness. This paper is aimed at investigating the structural response beyond a set of selected limit states, using nonlinear FE method adopting different initial imperfection models, to provide the designers with new information useful for calibrating safety factors. It was found that both local and global buckling can be considered as ultimate limit states, with a significant sensitivity towards initial imperfection, while material yielding and tripping buckling of frames show a residual structural capacity. In conclusion, it was found that the occurrence of local buckling leads to similar sudden catastrophic consequences as global buckling, with the ultimate strength capacity highly affected by the initial imperfection shape and amplitude.",
      "citations": 4,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 66,
              "rank": 39,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 65,
              "rank": 253,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 53,
              "rank": 47,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 52,
              "rank": 300,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85129684332",
      "title": "Shock effects of underwater explosion on naval ship foundations: Validation of numerical models by dedicated tests",
      "doi": "10.1016/j.oceaneng.2022.111290",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "253",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Mannacio F.; Barbato A.; Di Marzo F.; Gaiotti M.; Rizzo C. M.; Venturini M.",
      "author_ids": "57670726600;13005232300;57671630400;55200599100;15072981100;57671630500",
      "authorAffiliationIds": "128084535-60025153;60083109;128084535;60025153;60025153;128084535",
      "corresponding": "Mannacio F.",
      "keywords": "Experimental | Foundation | Numerical | Shock | Underwater explosion",
      "abstract": "The underwater shock explosions can cause severe damage not only to the naval ships machinery and equipment, but also to their foundation structures, that are a critical part of the system integration. A few national rules allow shock resistance verification by means of dedicated calculations as it is in general not possible the testing of the complete system machine-foundation. Dynamic structural analysis of foundations by Finite Element Method (FEM) is accepted, but no detailed modelling strategies, procedures and inputs are provided. The aim of this paper is to provide some reliable guidelines of shock foundation design, comparing the results obtained by the numerical simulation with the experimental data collected performing a series of dedicated shock tests carried out according to the MIL S 901 D medium weight shock standard. Eventually, it is shown that experimental and numerical analyses performed in parallel may support each other to provide better understanding of complex phenomena.",
      "citations": 25,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 16,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85216609274",
      "title": "Analysis of the underwater explosion shock effects on a typical naval ship foundation structure: Experimental and numerical investigation",
      "doi": "10.1201/9781003230373-8",
      "venue": "Proceedings in Marine Technology and Ocean Engineering",
      "type": "Book Series",
      "sub_type": "Book Chapter",
      "year": 2022,
      "volume": "7",
      "issue_id": null,
      "pages": "65-73",
      "issn": "2638647X",
      "eIssn": "26386461",
      "source_id": "21101270843",
      "authors": "Mannacio F.; Barbato A.; Rizzo C. M.; Gaiotti M.; Venturini M.",
      "author_ids": "57670726600;13005232300;15072981100;55200599100;57671630500",
      "authorAffiliationIds": "60025153-131297705;60083109;60025153;60025153;131297705",
      "corresponding": "Mannacio F.",
      "keywords": null,
      "abstract": "For naval ships, shock phenomena caused by underwater explosions are demanding limit states not only for machinery and equipment, but also for their foundation structures. Being a crucial part of the system integration, their shock resistance is normally verified by means of dedicated calculations as it is in general not possible the testing of the equipment including relevant structural foundations. Rules allow structural analysis of foundations by finite element method (FEM) dynamic models. However, no detailed modelling strategies, procedures and inputs are provided. The aim of this paper is to study the shock effects on a typical equipment foundation structure, comparing the results obtained by numerical simulation with the data obtained by a series of dedicated shock tests carried out according to the MIL S 901 D medium weight shock standard. Eventually, it is shown that experimental, theoretical and numerical analyses performed in parallel may support each other to provide better understanding of complex phenomena.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 37,
              "rank": 73,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85158885068",
      "title": "ULTIMATE STRENGTH",
      "doi": "10.5957/ISSC-2022-COMMITTEE-III-1",
      "venue": "Proceedings of the 21st International Ship and Offshore Structures Congress Issc 2022",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "1",
      "issue_id": null,
      "pages": "395-500",
      "issn": null,
      "eIssn": null,
      "source_id": "21101150729",
      "authors": "Hess Paul E.; An Chen; Brubak Lars; Chen Xiao; Chiu Jinn Tong; Czujko Jurek; Darie Ionel; Feng Guoqing; Gaiotti Marco; Jang Beom Seon; Kefal Adnan; Makmun Sukron; Ringsberg Jonas; Romanoff Jani; Saad-Eldeen Saad; Schipperen Ingrid; Tabri Kristjan; Wang Yikun; Yanagihara Daisuke",
      "author_ids": "57190439310;58243164500;18036851400;59782611400;58241592000;58242880000;57191851147;55454508100;55200599100;15925365200;56866304900;57781296600;6602749403;12763227900;35085227500;35085515200;24484111400;56163204400;7004720381",
      "authorAffiliationIds": null,
      "corresponding": "Hess P.E.",
      "keywords": "Buckling | collapse | degradation | Fabrication-Induced Initial Imperfections | In-service damage | Load-carrying capacity | Offshore | Ship Structures | Ships | Ultimate limit states | Ultimate strength | Uncertainty",
      "abstract": null,
      "citations": 4,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85140717918",
      "title": "A STRATEGY FOR THE REDUCTION OF STRUCTURAL WEIGHT OF COMPOSITE VESSELS",
      "doi": "10.1115/OMAE2022-80387",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "2",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Gaiotti Marco; Vergassola Gianmarco; Pais Tatiana",
      "author_ids": "55200599100;57191615489;55611778200",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "GRP vessels | structural scantling | weight reduction of ships",
      "abstract": "Hull weight is a main structural concern in pleasure craft design, being in such project the maximum speed one of the most important contractual limits imposed by owner to shipyards. This is particularly true for composite structures, where the structural layouts and the beams' dimensions may vary significantly among very similar projects, resulting in very different structural weights. Moreover, for this type of vessels, the structural weight is a significant percentage of the total displacement, and, consequently, reducing the structural components leads to important total weight reduction. The present work aims to orient the preliminary design stage of composite pleasure yacht structural design towards an optimal configuration of the structural layout in terms of hull weight, within the current framework of rules provided by classification societies.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85109904613",
      "title": "A design approach to reduce hull weight of naval ships",
      "doi": "10.1080/09377255.2021.1947666",
      "venue": "Ship Technology Research",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "69",
      "issue_id": "2",
      "pages": "89-104",
      "issn": "09377255",
      "eIssn": "20567111",
      "source_id": "27317",
      "authors": "Aguiari M.; Gaiotti M.; Rizzo C. M.",
      "author_ids": "57212109023;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Aguiari M.",
      "keywords": "design process | limit state | parametric design | rule requirements | scantling | Ship structures | structural assessment | weight reduction",
      "abstract": "Hull weight is a design parameter affecting the whole performances of a ship, being related to building costs, operational costs, maintenance and durability, and not least to satisfaction of functional requirements. Naval ships are no exception and impact of hull weight is crucial to fulfil mission requirements. In the light of the above, weight reduction is one of the main design drivers and it should be duly accounted for since the concept design phase. In this paper, a design approach intended for pre-contractual design phases is presented. It takes advantage of recent developments and trends of construction rules as well as of nowadays-available computation potential to update and improve the traditional scantling design approach, applied since decades by designers. The complexity and computational burden is kept to a minimum to provide a user-friendly procedure applicable in everyday working practice. Designers’ experience and judgment continue to drive the whole process. A Visual Basic support software has been developed with worksheet interfaces to implement the proposed scantling design procedure. Test cases showed significant weight reductions with respect to as-built ships and to scantling obtained by applying traditional design procedures.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 53,
              "rank": 55,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 66,
              "rank": 34,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85098516150",
      "title": "Robotic inspection of ships: inherent challenges and assessment of their effectiveness",
      "doi": "10.1080/17445302.2020.1866378",
      "venue": "Ships and Offshore Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "17",
      "issue_id": "4",
      "pages": "742-756",
      "issn": "17445302",
      "eIssn": null,
      "source_id": "19700186818",
      "authors": "Poggi Laura; Gaggero Tomaso; Gaiotti Marco; Ravina Enrico; Rizzo Cesare Mario",
      "author_ids": "57215527236;55212255700;55200599100;55621181100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Poggi L.",
      "keywords": "assessment | remote inspections | robotic technologies | Ship maintenance | surveys | testing facility",
      "abstract": "Inspection is a key aspect of any structural maintenance programme, including that of ship and offshore structures with a long-lasting history of service failures. Ship surveys for construction, verification, repair and conversion are intrinsically hazardous that are mainly performed by human surveyors. The ROBINS project (ROBotics technology for INspection of Ships) is an EU Horizon 2020 collaborative project aimed at addressing possible advantages of robotic technologies for ship inspections and facing corresponding challenges. Within the project framework, gaps and drawbacks in the application of robotic technologies were identified, from both technological and regulatory viewpoints. Solutions were suggested and developed through laboratory and field trials. Results indicate that cost-effective robotic assistants can be successfully introduced in the marine structure maintenance routine, if appropriate assessments of technologies and application procedures are carried out in advance according to validation schemes, such as the standard verification process recommended in this paper.",
      "citations": 16,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 71,
              "rank": 33,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 68,
              "rank": 235,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 64,
              "rank": 226,
              "quartile": "Q2"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 63,
              "rank": 37,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85107680091",
      "title": "The ISSC 2022 committee III.1-Ultimate strength benchmark study on the ultimate limit state analysis of a stiffened plate structure subjected to uniaxial compressive loads",
      "doi": "10.1016/j.marstruc.2021.103026",
      "venue": "Marine Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "79",
      "issue_id": null,
      "pages": null,
      "issn": "09518339",
      "eIssn": null,
      "source_id": "21052",
      "authors": "Ringsberg Jonas W.; Darie Ionel; Nahshon Ken; Shilling Gillian; Vaz Murilo Augusto; Benson Simon; Brubak Lars; Feng Guoqing; Fujikubo Masahiko; Gaiotti Marco; Hu Zhiqiang; Jang Beom Seon; Paik Jeom Kee; Slagstad Martin; Tabri Kristjan; Wang Yikun; Wiegard Bjarne; Yanagihara Daisuke",
      "author_ids": "6602749403;57191851147;23470080300;57224465702;7101868532;35084903200;18036851400;55454508100;7003568966;55200599100;56386420300;15925365200;35821146600;57204423662;24484111400;56163204400;57201721214;7004720381",
      "authorAffiliationIds": "60000990;60072185;60022562;60022562;60000036;60006222;60072185;60003353;60024322;60025153;60006222;60120086;60008783-60022148;60013141;60068861;60025225;60010338;60011047",
      "corresponding": "Ringsberg J.W.",
      "keywords": "Benchmark study | Buckling | Experiment | Failure modes | Finite element analysis | Ultimate limit state",
      "abstract": "This paper presents a benchmark study on the ultimate limit state analysis of a stiffened plate structure subjected to uniaxial compressive loads, initiated and coordinated by the ISSC 2022 technical committee III.1-Ultimate Strength. The overall objective of the benchmark is to establish predictions of the buckling collapse and ultimate strength of stiffened plate structures subjected to compressive loads. Participants were asked to perform ultimate strength predictions for a full-scale reference experiment on a stiffened steel plate structure utilizing any combination of class rules, guidelines, numerical approaches and simulation procedures as they saw fit. The benchmark study was carried out blind and divided into three phases. In the first phase, only descriptions of the experimental setup, the geometry of the reference structure, and the nominal material specifications were distributed. In the second phase, the actual properties of the reference structure were included. In the third and final phase, all available information on the reference structure and measured properties were distributed, including the material properties and laser-scanned geometry. This paper presents the results obtained from seventeen submitted FE simulations as well as details on the experiment. It also presents comparisons of the force versus the displacement curve, failure modes and locations for each phase, among others, and a discussion on the participants’ ability to predict the characteristics of the reference experiment with the information that is available for the phase. The outcome of the study is a discussion and recommendations regarding the design of finite element models for the ultimate state analysis of stiffened plate structures, with emphasis on the prediction of the ultimate capacity, force-displacement curve, and failure mode and location related to access to data, uncertainties and modeling of the material properties, geometric imperfections and distortions, and residual stresses.",
      "citations": 43,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 94,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 90,
              "rank": 69,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 88,
              "rank": 47,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 82,
              "rank": 80,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 92,
              "rank": 8,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 85,
              "rank": 86,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 85,
              "rank": 58,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 77,
              "rank": 103,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85128908896",
      "title": "Robotic inspection of ships: inherent challenges and assessment of their effectiveness",
      "doi": null,
      "venue": "Rivista Italiana Della Saldatura",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "73",
      "issue_id": "3",
      "pages": "369-392",
      "issn": "00356794",
      "eIssn": null,
      "source_id": "29510",
      "authors": "Poggi Laura; Gaggero Tomaso; Gaiotti Marco; Ravina Enrico; Rizzo Cesare Mario",
      "author_ids": "57215527236;55212255700;55200599100;55621181100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Poggi L.",
      "keywords": "in service operations | Nondestructive testing | real time operations | shipbuilding | ships | standards",
      "abstract": "In recent years robotics has become an important resource in engineering. Adoption of Robotics and Autonomous Systems (RAS) in activities related to ship inspections has obvious potential advantages, but also arises particular challenges, both from technical and legal viewpoints. The ROBINS project (ROBotics technology for INspection of Ships) is a collaborative project co-funded within the H2020 EU Research and Innovation programme call, aimed at filling the gap between current ship inspections approach and available robotic technology, both from technological and regulatory point of view. Main goal of the present work is to highlight how ship inspections are currently carried out by humans, how they could be improved using RAS, even if not completely autonomous for the time being, at least in selected operational scenarios and how the performances of RAS platforms can be tested to assess their effectiveness in carrying out surveys onboard. In such a framework, a testing facility aimed at assessing RAS' capabilities as well as providing suitable environment for their development has been built and it is still under development along with dedicated testing protocols, able to assess the equivalence between human and RAS inspection of ship and marine structures. The features of a testing facility where RAS can be tested and the testing protocols are presented, showing how technological and regulatory gaps are filled.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 2,
              "rank": 721,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 0,
              "rank": 412,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 0,
              "rank": 597,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 0,
              "rank": 384,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85185318302",
      "title": "Structural surface assessment of ship structures intended for robotic inspection applications",
      "doi": "10.1201/9781003230373-64",
      "venue": "Proceedings in Marine Technology and Ocean Engineering",
      "type": "Book Series",
      "sub_type": "Book Chapter",
      "year": 2021,
      "volume": "2021",
      "issue_id": null,
      "pages": "563-572",
      "issn": "2638647X",
      "eIssn": "26386461",
      "source_id": "21101270843",
      "authors": "Shah F. M.; Gaggero T.; Gaiotti M.; Ivaldi L.; Rizzo C. M.",
      "author_ids": "57202602309;55212255700;55200599100;57863161300;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Shah F.M.",
      "keywords": null,
      "abstract": "Merchant vessels experience regular structural assessments. Traditionally, surveys are performed physically by surveyors being expansive and time-consuming. Imagery based, cracks recognition is a topic obtaining considerable interest in commercial and scientific sectors. By using computer vision algorithms, authors propose a new approach to expedite crack detection, visualize the cracks efficiently in ship structures and then measure their length. The process includes two parts: at first, crack images are captured manually by using low-cost handheld cameras. Afterward, image is imported into software and processed. To make analysis easier, image is compressed and converted into grayscale. Image contrast is then stretched to enhance the contrast between background and crack. After obtaining latent crack identification features, images are elaborated by pre-processing, feature extraction, image segmentation, thus estimating the region of interest and determining whether the image includes a crack or not. Based on experiments and comparing results to traditional naked-eyes approaches, the algorithm is found efficient in crack detection, hence reducing cost and making crack identification system more portable, accurate and integrated.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 37,
              "rank": 73,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85099578385",
      "title": "Condition assessment of ship structure using robot assisted 3D-reconstruction",
      "doi": "10.1080/09377255.2021.1872219",
      "venue": "Ship Technology Research",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "68",
      "issue_id": "3",
      "pages": "129-146",
      "issn": "09377255",
      "eIssn": "20567111",
      "source_id": "27317",
      "authors": "Shah Faisal Mehmood; Gaggero Tomaso; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "57202602309;55212255700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Shah F.M.",
      "keywords": "3D-reconstruction | ship inspection applications | structural condition assessment | structure from motion",
      "abstract": "Ships condition is assessed regularly to maintain safety. Traditionally, structural integrity assessment is performed by surveyors, requiring complex and time-consuming operations to accessany ship space. Imagery based, three-dimensional (3D) reconstruction of structures is a new area obtaining considerable interest. It can provide low-cost, less disruptive and safer inspection approach. In this study, alternative technologies to generate 3D models, based on photos, are explored. The aim is to highlight how human made ship survey can be improved using robotics technology. A procedure for 3D reconstruction combining photogrammetry/videogrammetry and computer vision techniques is developed, providing an alternative to ease vessel inspections. Moreover, effect of pre-processing image datasets, aimed at improving the performance of 3D reconstruction, is investigated. An efficient image pre-processing pipeline based on computer vision algorithms for colour enhancement, shadow removal and image blurriness is presented. This study can help in effective and reliable decision-making process, due to its user-friendliness and cost effectiveness, mainly for cargo holds requiring frequent assessment because of cargo operations induced damages.",
      "citations": 10,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 53,
              "rank": 55,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 62,
              "rank": 37,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85092354518",
      "title": "Recent Industrial Developments of Marine Composites Limit States and Design Approaches on Strength",
      "doi": "10.1007/s11804-020-00171-1",
      "venue": "Journal of Marine Science and Application",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "19",
      "issue_id": "4",
      "pages": "553-566",
      "issn": "16719433",
      "eIssn": "19935048",
      "source_id": "5400152711",
      "authors": "Barsotti Beatrice; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "57219353053;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Barsotti B.",
      "keywords": "FEM | Limit state design | Marine composites | Material characterization | Navy ships | Pleasure crafts | Ultimate strength | Yachts",
      "abstract": "To further exploit the potential of marine composites applications in building ship hulls, offshore structures, and marine equipment and components, design approaches should be improved, facing the challenge of a more comprehensive and explicit assessment of appropriately defined limit states. The structure ultimate/limit conditions shall be verified in principle within the whole structural domain and throughout the ship service life. What above calls for extended and reliable materials characterization on the one hand and for accurate and wide-ranging procedures in structural analyses. This paper presents an overview of recent industrial developments of marine composites limit states assessments and design approaches, as available in open literature, focusing on pleasure crafts and yachts as well as navy ships and thus showing a starting point to fill the gap in this respect. After a general introduction about composites characterization techniques, current design practice and rule requirements are briefly summarized. Both inter-ply and intra-ply failure modes and corresponding limit states are then presented along with recently proposed assessment approaches. Three-dimensional aspects in failure modes and manufacturing methods have been identified as the main factors influencing marine composite robustness. Literature review highlighted also fire resistance and hybrid joining techniques as significant issues in the use of marine composites.",
      "citations": 34,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 66,
              "rank": 39,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 65,
              "rank": 253,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 54,
              "rank": 44,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 45,
              "rank": 325,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85093359103",
      "title": "Assessment of ship robotic inspections",
      "doi": "10.1109/ETFA46521.2020.9211949",
      "venue": "IEEE International Conference on Emerging Technologies and Factory Automation ETFA",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "2020-September",
      "issue_id": null,
      "pages": "1495-1502",
      "issn": "19460740",
      "eIssn": "19460759",
      "source_id": "21100275520",
      "authors": "Poggi Laura; Rizzo Cesare Mario; Gaggero Tomaso; Gaiotti Marco; Ravina Enrico",
      "author_ids": "57215527236;15072981100;55212255700;55200599100;55621181100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Poggi L.",
      "keywords": "assessment | inspection | robotic technologies | ship | testing facility",
      "abstract": "Ship surveys are hazardous and expensive tasks as long as they are carried out by human surveyors to a large extent. The adoption of robotic means can enhance safety by replacing some human operations, filling the gap between the current approach and available robotic technologies, even from a regulatory point of view.The ROBINS project (ROBotics technology for INspection of Ships) is a collaborative project co-funded within the H2020 EU Research and Innovation programme call, aimed at addressing the possible advantages of using robotics technology for inspection of ships, facing the corresponding challenges. In such a framework, a Testing Facility (TF) is built up and protocols are developed to test and assess robotic capabilities in carrying out inspections at least at the same quality level of humans' ones.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Industrial and Manufacturing Engineering",
              "percentile": 51,
              "rank": 197,
              "quartile": "Q2"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 48,
              "rank": 510,
              "quartile": "Q3"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 47,
              "rank": 199,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 42,
              "rank": 566,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85074454172",
      "title": "Uncertainties estimates of hull girder still water loads of bulk and dry cargo ships through Monte Carlo simulations",
      "doi": "10.1016/j.marstruc.2019.102688",
      "venue": "Marine Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "70",
      "issue_id": null,
      "pages": null,
      "issn": "09518339",
      "eIssn": null,
      "source_id": "21052",
      "authors": "Gaggero Tomaso; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "55212255700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Gaggero T.",
      "keywords": "Hull girder strength | Loading conditions | Monte Carlo simulations | Still water loads | Uncertainties",
      "abstract": "This paper deals with the estimate of uncertainties affecting still water hull girder loads of bulk and dry cargo ships. In strength assessment of ships, two main categories of acting loads are considered: still water loads and wave induced ones. While the latter are generally defined bearing in mind their stochastic nature, this is not the case for still water loads, which are basically deterministically considered. The underlying assumption is that there is an overall control of the operational profile during the service of a ship. However, this is not the case in actual fact, especially for general dry cargo ships and bulk carriers, since the loading/unloading process cannot be fully controlled by the crew, often resulting into loading conditions rather different from those planned by the designer. Based on an earlier work, where loading conditions of the above-mentioned ship types were statistically analyzed, in the present paper Monte Carlo simulations are used to estimate the uncertainties affecting the hull girder still water loads of ships in service, showing that their allowable values can be exceeded due to inaccuracies in ship and cargo management.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 94,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 90,
              "rank": 69,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 88,
              "rank": 47,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 82,
              "rank": 80,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 93,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 85,
              "rank": 86,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 84,
              "rank": 60,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 79,
              "rank": 96,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85078107396",
      "title": "A numerical sensitivity analysis on the cohesive parameters of a carbon-steel single lap joint",
      "doi": "10.1016/j.oceaneng.2019.04.091",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "198",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Gaiotti Marco; Zamarin Albert; Josefson B. Lennart; Matulja Tin",
      "author_ids": "55200599100;24559729900;7003464720;35113762100",
      "authorAffiliationIds": "60025153;60271622;60000990;60271622",
      "corresponding": "Gaiotti M.",
      "keywords": "ADINA | Cohesive model | De-bonding | LS-DYNA | Non-linear FEA | Single lap joint",
      "abstract": "One of the key issues concerning the use of composite materials in the construction of steel ships, or vice versa, the use of steel in the construction of composite ships, is related to the ways of joining composite parts to the adjacent steel structure. Carbon-steel joints are of increasing interest for the maritime industry, but knowledge is scarce. Applications of adhesive joints as an alternative method to welding or riveting has numerous advantages. Still, gathering more information about the behaviour of such joints through numerical sensitivity analysis and simulation are necessary to speed up applications on ships and marine structures. The present investigation aims at assessing the sensitivity of the parameters that define the traction separation law on the numerical simulation of the de-bonding of a steel to composite single lap joint, following a previous experimental campaign. The test is intended to induce a mode II separation, although the slight bending moment caused by the misalignment of the two ends leads to mixed mode effects, as well. Two finite element software were compared, ADINA and LS-DYNA. The influence of peak traction, penalty stiffness and energy release rate were investigated, along with the effect of a mixed mode opening behaviour.",
      "citations": 15,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 91,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 80,
              "rank": 29,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85137766723",
      "title": "Committee V.3: Materials and Fabrication Technology",
      "doi": "10.3233/PMST200012",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "4",
      "issue_id": null,
      "pages": "199-214",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Josefson Lennart; Van Duin Stephen; De Carvalho Pinheiro Bianca; Yang Nana; Yu Luo; Zamarin Albert; Remes Heikki; Roland Frank; Gaiotti Marco; Osawa Naoki; Horn Agnes Marie; Kim Myung Hyun; Mishra Brajendra",
      "author_ids": "7003464720;35321662700;57559042300;35085624500;57887078400;24559729900;16403170800;7003459462;55200599100;55906611200;9244865900;57217062440;55433568000",
      "authorAffiliationIds": null,
      "corresponding": "Josefson L.",
      "keywords": null,
      "abstract": "The committee shall give an overview about new developments in the field of ship and offshore materials and fabrication techniques with a focus on trends which are highly relevant for practical applications in the industry in the recent and coming years. Particular emphasis shall be given to the impact of welding and corrosion protection techniques for structural performance, and on the development of lighter structures.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85095915080",
      "title": "Recent developments in remote inspections of ship structures",
      "doi": "10.1016/j.ijnaoe.2020.09.001",
      "venue": "International Journal of Naval Architecture and Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "12",
      "issue_id": null,
      "pages": "881-891",
      "issn": "20926782",
      "eIssn": "20926790",
      "source_id": "21100197706",
      "authors": "Poggi Laura; Gaggero Tomaso; Gaiotti Marco; Ravina Enrico; Rizzo Cesare Mario",
      "author_ids": "57215527236;55212255700;55200599100;55621181100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Poggi L.",
      "keywords": "Robotics and autonomous systems | Ship surveys | Test protocols | Testing facility",
      "abstract": "In recent years robotics has become an important resource in engineering. Adoption of Robotics and Autonomous Systems (RAS) in activities related to ship inspections has obvious potential advantages, but also arises particular challenges, both from technical and legal viewpoints. The ROBINS project (ROBotics technology for INspection of Ships) is a collaborative project co-funded within the H2020 EU Research and Innovation programme call, aimed at filling the gap between current ship inspections approach and available robotic technology, both from technological and regulatory point of view. Main goal of the present work is to highlight how ship inspections are currently carried out by humans, how they could be improved using RAS, even if not completely autonomous for the time being, at least in selected operational scenarios and how the performances of RAS platforms can be tested to assess their effectiveness in carrying out surveys onboard. In such a framework, a testing facility aimed at assessing RAS’ capabilities as well as providing suitable environment for their development has been built and it is still under development along with dedicated testing protocols, able to assess the equivalence between human and RAS inspection of ship and marine structures. The features of a testing facility where RAS can be tested and the testing protocols are presented, showing how technological and regulatory gaps are filled.",
      "citations": 28,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 19,
              "quartile": "Q1"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 79,
              "rank": 80,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 85,
              "rank": 14,
              "quartile": "Q1"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 71,
              "rank": 74,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85081061921",
      "title": "Robotic inspection of ship structures: How to fill the gap between available technologies and current survey practices?",
      "doi": null,
      "venue": "2019 Imeko Tc19 International Workshop on Metrology for the Sea Learning to Measure Sea Health Parameters Metrosea 2019",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": null,
      "issue_id": null,
      "pages": "227-232",
      "issn": null,
      "eIssn": null,
      "source_id": "21100987472",
      "authors": "Poggi Laura; Gaggero Tomaso; Gaiotti Marco; Ravina Enrico; Rizzo Cesare Mario",
      "author_ids": "57215527236;55212255700;55200599100;55621181100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Poggi L.",
      "keywords": null,
      "abstract": "Adoption of Robotics and Autonomous Systems (RAS) in activities related to ship inspections has obvious potential advantages, but also shows some problems, ranging from ship-RAS interface to regulatory and legal viewpoints. The ROBINS project (ROBotics technology for INspection of Ships) is a collaborative project co-funded within the H2020 EU Research and Innovation programme call, aimed at filling the gap between current ship inspection requirements and available robotic technology. The present work aims at highlighting how human-made ship inspections can be improved using RAS, with equivalent results of the current practice, which indeed is rather satisfactory. In such a framework, a Testing Facility (TF) has been built up and it is still under development. Hence, the features of the TF where RAS will be tested and the testing protocols during trials are presented, showing how technological and regulatory gaps can be filled. Basically, RAS target will be to carry out inspections at the same quality level of humans' ones.",
      "citations": 3,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85072723036",
      "title": "Scantling assessment of large yacht rigs using carbon-fiber and aluminum masts",
      "doi": "10.1016/j.oceaneng.2019.106480",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "190",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Ghelardi Stefano; Conti Claudia; Gaiotti Marco; Rizzo Cesare Mario; Paci Matteo",
      "author_ids": "56030081700;57211124822;55200599100;15072981100;35085260400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;107898285",
      "corresponding": "Ghelardi S.",
      "keywords": "Aluminium alloy | Composites | Mast | Rigging | Sail system | Structural lightning",
      "abstract": "Weight saving is crucial in naval architecture to reduce costs and improve performances. In sailing ships design, rig's scantling is important also for ship stability, as rig's weight generates heeling actions on the vessel, due to heeled navigation. Therefore, rig's weight saving remarkably reduces ship's heeling, allowing to increase the wind exposed area, consequently improving the sailing performances. However, because of the complexity of the structure and uncertainties in loading conditions, the structural scantling of a rig implies the adoption of high safety factors. Furthermore, the increasing trend to use composite materials represents an additional source of complexity due to their anisotropic non-homogeneous nature and uncertainties on material properties, and generally implies even larger safety factors, besides implying high construction costs. The present work shows a comparison between an existing 76 m carbon mast and an aluminium alloy one. Suitable FEM models of both rigs were built up and used to assess the structural system strength according to applicable class rules. The cross-section stiffness of the aluminium mast was optimized in order to make masts’ performances comparable. The optimized aluminium mast, of comparable weight of the carbon one, results to be more cost-effective for such range of sailing vessels.",
      "citations": 4,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 76,
              "rank": 32,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85068510400",
      "title": "Dynamic buckling of composite mast panels of sail ships",
      "doi": "10.1201/9780429298875-46",
      "venue": "Trends in the Analysis and Design of Marine Structures Proceedings of the 7th International Conference on Marine Structures Marstruct 2019",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2019,
      "volume": null,
      "issue_id": null,
      "pages": "391-399",
      "issn": null,
      "eIssn": null,
      "source_id": "21100915388",
      "authors": "Gaiotti M.; Ghelardi S.; Rizzo C. M.",
      "author_ids": "55200599100;56030081700;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "Composite materials are becoming more and more popular, even for large ship and offshore structures. In case of slender structures, where buckling is the governing limit state, such features are valuable and allow designing high performance assemblies like racing crafts as well as very large sail ships. The case of composite masts of sail ships is rather interesting, being a relatively large, stiff but light structure whose reliability is crucial for ship safety. Indeed, such case is also the paradigm of the dynamic buckling behaviour of slender columns structures, pointing out differences between the widely used quasi-static design approach and the more realistic time domain simulations. An earlier work studied the dynamic buckling behaviour of a metallic mast. Now, the study has been extended to the much more complex case of composite masts, showing some variations due to anisotropic material properties and specific weight values different by an order of magnitude.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85048422857",
      "title": "Testing and simulation of a bolted and bonded joint between steel deck and composite side shell plating of a naval vessel",
      "doi": "10.1016/j.engstruct.2018.06.008",
      "venue": "Engineering Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2018,
      "volume": "172",
      "issue_id": null,
      "pages": "228-238",
      "issn": "01410296",
      "eIssn": "18737323",
      "source_id": "15652",
      "authors": "Gaiotti Marco; Ravina Enrico; Rizzo Cesare M.; Ungaro Andrea",
      "author_ids": "55200599100;55621181100;15072981100;6602358649",
      "authorAffiliationIds": "60025153;60025153;60025153;60122238",
      "corresponding": "Gaiotti M.",
      "keywords": "Bolted joint | Bonded joint | Finite element analysis | Large scale testing | Scantling design | Ship structure",
      "abstract": "This paper describes the large-scale testing and the finite element simulations of the collapse of a steel-composite joint, both bolted and bonded. The joined structures are typical ones of shipbuilding and namely of naval ships. Composite superstructures, beside a valuable weight reduction, may improve the signature features of the ship by embedding installed electronic devices into a composite mast. In the frame of a broader research project, including the electromagnetic characterization of the composite structures, also the structural design and its optimization were exploited, embracing, among other issues, the joining solutions between the steel deck structures to the composite ones of the superstructure side shell. A large-scale specimen of the joint was conceived and collapse tested while, in parallel, design simulations were carried out at different levels of detail. Eventually, a complete description of the collapse of the joint, including the nonlinear simulation by finite element analysis of the progressive failure of the composite laminates of the side shell was obtained and test results were used to validate the numerical models. Depending on the design stage, various scantling procedures, from a very simplified one to a rather complex and time-consuming numerical analysis, can now be applied to verify the structural behavior of these steel to composite joints as well as to select the most cost-effective solution among several options.",
      "citations": 18,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 94,
              "rank": 25,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 88,
              "rank": 36,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85037327316",
      "title": "Development and validation of a numerical model for the simulation of high-velocity impacts on advanced composite armor systems",
      "doi": "10.1007/s11071-017-3981-4",
      "venue": "Nonlinear Dynamics",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2018,
      "volume": "91",
      "issue_id": "3",
      "pages": "1791-1816",
      "issn": "0924090X",
      "eIssn": "1573269X",
      "source_id": "21576",
      "authors": "Sabadin Giovanni; Gaiotti Marco; Rizzo Cesare M.; Bassano Alessio",
      "author_ids": "57190866719;55200599100;15072981100;26021711300",
      "authorAffiliationIds": "60025153;60025153;60025153;60024961",
      "corresponding": "Sabadin G.",
      "keywords": "Armor system | Ballistic tests | Composite | High-velocity impact | Multilayer | Numerical simulation",
      "abstract": "The anti-ballistic properties of a new advanced composite armor system have been investigated with the aim to minimize the armor system total weight per unit area. The innovative protection, made of a silicon carbide ceramic outer layer and an inner composite back-packing layer formed by ultra-high molecular weight polyethylene (UHMWPE) fibers, namely Dyneema <sup>®</sup> Hard Ballistic 26, was realized and then tested performing dedicated ballistic impact tests. In order to investigate its permanent deformation, ceramic cracking, dimension of the rupture, and extension of the impact damage, nondestructive and destructive tests were conducted on the tested panels. The experimental results were used to develop and validate a transient nonlinear dynamic simulation model of the high-velocity impact of a 7.62 AP bullet on the tested armor system. After an accurate setting of the parameters involved in the description of the material constitutive models and of the involved physical phenomena, a complex numerical model was developed in the ANSYS-Autodyn <sup>®</sup> environment using both mesh and meshless approaches at the same time. The comparison reveals a good agreement between experimental and computational results in terms of ballistic properties, deformations, fragmentation, and fracture of the ballistic armor system. Hence, a new numerical model for the design and the optimization of the ballistic efficiency of composite armor systems was developed and can be now used in current practice.",
      "citations": 18,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Applied Mathematics",
              "percentile": 96,
              "rank": 22,
              "quartile": "Q1"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 93,
              "rank": 8,
              "quartile": "Q1"
            },
            {
              "subject": "Aerospace Engineering",
              "percentile": 91,
              "rank": 14,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 90,
              "rank": 74,
              "quartile": "Q1"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 88,
              "rank": 43,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 88,
              "rank": 113,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 99,
              "rank": 1,
              "quartile": "Q1"
            },
            {
              "subject": "Applied Mathematics",
              "percentile": 97,
              "rank": 13,
              "quartile": "Q1"
            },
            {
              "subject": "Aerospace Engineering",
              "percentile": 97,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 95,
              "rank": 28,
              "quartile": "Q1"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 91,
              "rank": 21,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 91,
              "rank": 60,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85134054938",
      "title": "BUCKLING OF STIFFENED PANELS: AN IMPROVED LINEARIZED APPROACH COMPARED TO NONLINEAR COLLAPSE ANALYSIS",
      "doi": "10.1115/OMAE2018-78399",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "3",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Gaiotti Marco; Rizzo Cesare Mario; Ferrari Nicole; Montella Adriano",
      "author_ids": "55200599100;15072981100;57798389400;57798618300",
      "authorAffiliationIds": "60025153;60025153;60083109;60083109",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "This paper deals with the buckling assessment of stiffened panels, typical of ship and offshore structures. In particular, rather slender structures, involving very thin plates and stiffeners with limited cross section, are considered. In order to limit the computational burden of a fully nonlinear progressive collapse analysis but, at the same time, to retain some benefits of a numerical finite element model assessment, an improved linearized buckling procedure is proposed in this work. The idea is to linearize the computation in a suitable point based on the design load of the structure, so that the results of a linearized buckling analysis are more informative in practice. Results are assessed with nonlinear collapse analyses, comprehensively considering various loading cases. Eventually, a hands-on buckling assessment procedure is suggested, which can be implemented in rules and design process if adequately validated by a suitable number of test cases and, possibly, experimental data.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85067256444",
      "title": "COMMITTEE V.3 Materials and fabrication technology",
      "doi": "10.3233/978-1-61499-864-8-143",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "2",
      "issue_id": null,
      "pages": "143-191",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Josefson Lennart; van Duin Stephen; de Carvalho Pinheiro Bianca; Yang Nana; Yu Luo; Zamarin Albert; Remes Heikki; Roland Frank; Gaiotti Marco; Osawa Naoki; Horn Agnes Marie; Kim Myung Hyun; Mishra Brajendra",
      "author_ids": "7003464720;35321662700;57559042300;35085624500;57887078400;24559729900;16403170800;7003459462;55200599100;55906611200;9244865900;57217062440;55433568000",
      "authorAffiliationIds": null,
      "corresponding": "Josefson L.",
      "keywords": "Adhesive | Approval | Arctic | Composites | Distortions | Fatigue | High frequency mechanical impact (HFMI) | Lightweight | Qualification | Residual stress | Steels | Welding",
      "abstract": null,
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85053478087",
      "title": "Sensitivity analysis of impact loads by CFD solvers for structural FEM computation on ship structures",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "2018-June",
      "issue_id": null,
      "pages": "521-526",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Gaggero Stefano; Gaggero Tomaso; Gaiotti Marco; Ghelardi Stefano; Vernengo Giuliano; Villa Diego",
      "author_ids": "6503976905;55212255700;55200599100;56030081700;37662376400;56250522200",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Gaggero S.",
      "keywords": "Finite Element Method (FEM) | Slamming | Smoothed Particle Hydrodynamics (SPH) | Unsteady Reynolds Averaged Navier Stokes Equations (URANSE)",
      "abstract": "A numerical study is proposed to highlight the sensitivity of the structural response with respect to the fluid pressures derived by a fluid dynamics analysis. The fluid characteristics are computed by using two Computational Fluid Dynamics (CFD) methods, namely a Unsteady Reynolds Averaged Navier Stokes (URANSE) method and a Smoothed Particle Hydrodynamics (SPH) solver. Based on the CFD results, the structure response is calculated by means of a Finite Element Method (FEM). Different level of accuracy are explored in the CFD computations, i.e. varying the mesh and particle resolutions for the URANSE and the SPH, respectively. The study is performed on a selected test case, namely a reinforced wedge-like section falling into the water. Results are discussed in the light both of the comparison between the two CFD methods and in terms of global and local structural properties.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 31,
              "rank": 64,
              "quartile": "Q3"
            },
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 28,
              "rank": 146,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 24,
              "rank": 442,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85030458085",
      "title": "Effects of uncertainties in loading conditions of bulk carriers on hull girder still water loads",
      "doi": "10.1016/j.marstruc.2017.06.001",
      "venue": "Marine Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2017,
      "volume": "55",
      "issue_id": null,
      "pages": "214-242",
      "issn": "09518339",
      "eIssn": null,
      "source_id": "21052",
      "authors": "Gaggero Tomaso; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "55212255700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Gaggero T.",
      "keywords": "Bulk carrier | Hull girder | Loading conditions | Still water loads | Uncertainties",
      "abstract": "This paper reports a study on the uncertainties in assessing loading conditions of handy size bulk carriers. Loading conditions and the corresponding hull girder still-water loads are important for the safety of bulk carriers. Unfortunately, statistical studies on this topic remain very few, partly because of the difficulty in fully understanding the impact of loading/unloading operation process and partly because of intrinsic uncertainties in measuring cargo loading conditions data. Three handy-size bulk carriers were investigated and their actual loading conditions, spanning several voyages in 22 months, were collected. Statistical analyses of the collected data resulted in an estimate of the uncertainties in the loading/unloading process. Based on these analyses, probability distribution models for weights in cargo holds, water ballast tanks, fuel tanks as well as consumable tanks are proposed best fitting the collected data; hull girder still water loads statistical distributions are also obtained. It is expected that these analytical models can be used in structural reliability analyses that require the definition of uncertainties of loading conditions and of resulting still water loads.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 94,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 90,
              "rank": 69,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 88,
              "rank": 47,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 82,
              "rank": 80,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 93,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 85,
              "rank": 86,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 82,
              "rank": 61,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 78,
              "rank": 98,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85051401374",
      "title": "Large-scale testing and structural verification of an adhesive bonded and bolted hull superstructure joint",
      "doi": null,
      "venue": "Rivista Italiana Della Saldatura",
      "type": "Journal",
      "sub_type": "Review",
      "year": 2017,
      "volume": "69",
      "issue_id": "3",
      "pages": "359-369",
      "issn": "00356794",
      "eIssn": null,
      "source_id": "29510",
      "authors": "Gaiotti Marco; Ravina Enrico; Rizzo Cesare M.; Ungaro Andrea",
      "author_ids": "55200599100;55621181100;15072981100;6602358649",
      "authorAffiliationIds": "60025153;60025153;60025153;60122238",
      "corresponding": "Gaiotti M.",
      "keywords": "Composite materials | Fatigue cracks | Fatigue loading | Fibre reinforced composites, polymer matrix composites | Finite element analysis | Ship | Shipbuilding",
      "abstract": "The paper describes the large-scale collapse test and its relative structural verification of an adhesive bonded and bolted joint between a bridge deck's hull structure, complete with plating and reinforcements, and the bulkhead made of sandwich composites, reinforced by a structural member. The hull structures are typical of shipbuilding and in particular of a military ship. The composite structure is quite complex and includes both fiberglass sandwiches and reinforced carbon fiber laminates for the structural member. Composite superstructures, in addition to significant weight decreases, also allow to improve the electromagnetic signature features of the ship by installing electronic devices within an integrated shaft constructed of appropriate composite materials. Various calculations have been performed to simulate the evidence, with complexity and detail level gradually increasing, up to a complete numerical model that also includes nonlinear effects in progressive collapse. Experimental results can be used to validate calculation models and evaluate their effectiveness in relation to purposes.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 2,
              "rank": 721,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 0,
              "rank": 412,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 5,
              "rank": 543,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 3,
              "rank": 340,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85038925874",
      "title": "Calibration of the cohesive parameters of fiberglass reinforced plastic plates with an embedded delamination by experiments",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2017,
      "volume": null,
      "issue_id": null,
      "pages": "139-145",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Maggiani Greta; Boote Dario; Gaggero Tomaso; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "57200045624;56214807300;55212255700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Maggiani G.",
      "keywords": "Cohesive elements | Cohesive interface | Cohesive model | Composite | Delamination | Fiberglass",
      "abstract": "The paper presents the calibration of a numerical collapse model of unidirectional fiberglass epoxy panels with an initially embedded delamination. The panels were tested under axial compression, able to induce buckling collapse. The penalty stiffness, the strength and the fracture toughness are the key parameters governing the cohesive interface. Their influence is investigated by a sensitivity analysis, aimed at adjusting the cohesive properties in order to calibrate the FE model based on the results of the experiments. The work serves as the basis for a promising strategy aimed at improving the current numerical models with progressive growing delaminations.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 31,
              "rank": 141,
              "quartile": "Q3"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 28,
              "rank": 67,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 26,
              "rank": 426,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85035042006",
      "title": "Reduced finite element models for mast analysis",
      "doi": "10.1201/9781315157368-20",
      "venue": "Progress in the Analysis and Design of Marine Structures Proceedings of the 6th International Conference on Marine Structures Marstruct 2017",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2017,
      "volume": null,
      "issue_id": null,
      "pages": "155-164",
      "issn": null,
      "eIssn": null,
      "source_id": "21100840005",
      "authors": "Lorenzetti A.; Gaiotti M.; Ghelardi S.; Rizzo C. M.",
      "author_ids": "57197809625;55200599100;56030081700;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Lorenzetti A.",
      "keywords": null,
      "abstract": "The complexity of a rigging system is due to loads in compression, bending and torsion transmitted from stays, shrouds and sails to the mast as well as to its slenderness and nonlinearities. Buckling is by far the governing limit state, although additional phenomena may occur simultaneously such as excessive displacement/strain and yielding. In thin walled structures, like mast panels, also local collapse must be checked and finite element analysis of a 2D shell, rather than 1D beam, modeled mast panel is necessary to capture local buckling and related phenomena of such type of structures. Aiming at simplified numerical models, applicable in preliminary design and for optimization purposes, this paper investigates the possibility to create a 1D-beam model based on moment-curvature relations at different load conditions able to assess not only global limit states but also local ones.",
      "citations": 4,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85031945055",
      "title": "Assessment of welded joints by strain energy density approach accounting for misalignments and geometrical imperfections",
      "doi": "10.1115/OMAE201761183",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2017,
      "volume": "4",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Gaiotti Marco; Rizzo Cesare Mario; Berto Filippo",
      "author_ids": "55200599100;15072981100;10042142600",
      "authorAffiliationIds": "60025153;60025153;60013141",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "Among recently introduced fatigue assessment approaches, the ones based on the notch stress intensity factor (N-SIF) concept appear to be very promising, both because of their theoretically soundness and because of the possibility of straightforward computation of parameters believed to govern the fatigue process. Actually, while such approaches can be considered in between stress-based approaches and crack propagation ones, quantities like N-SIF and strain energy density in a control volume can be evaluated by finite element analysis according to nowadays well-established procedures, mostly already implemented in commercial FEM software. The present study moves from a former one, dealing with butt joints between typical shipbuilding shell plates, and aims at assessing how the misalignment influences the fatigue strength estimation when applying the strain energy density approach. Eventually, the capabilities of such approach in accounting for misalignments is demonstrated and results are found in agreement with magnification factors currently recommended by guidelines and rules when applying other, stress based, fatigue assessment approaches.",
      "citations": 3,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84976550310",
      "title": "Effect of shear stresses on the ultimate strength of the hull girder of a containership",
      "doi": "10.17736/ijope.2016.jc649",
      "venue": "International Journal of Offshore and Polar Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2016,
      "volume": "26",
      "issue_id": "2",
      "pages": "183-191",
      "issn": "10535381",
      "eIssn": null,
      "source_id": "20452",
      "authors": "Gaiotti Marco; Fujikubo Masahiko; Grasso Nicola; Rizzo Cesare Mario",
      "author_ids": "55200599100;7003568966;56912346300;15072981100",
      "authorAffiliationIds": "60025153;60024322;60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "Buckling | Combined loads | Containership | Shear | Ultimate load",
      "abstract": "When using large models, building a comprehensive finite element (FE) numerical model able to simulate the portion of a containership whose extension in length is sufficient to properly evaluate combined loading effects is rather time consuming, and assigning proper boundary conditions representing the distribution of actual forces and moments on the hull girder is a challenging task. In this paper, the effect of shear stress distribution on the structural components of the hull girder is analyzed. At first, finite element (FE) models simulating a suitable length of the hull girder are considered. Later, smaller models of stiffened panels are extracted from the hull girder models and analyzed. The aim of this work is to investigate the shear stress distribution originating in the entire cross section and to build a smaller model extracted from a selected portion of the ship where hull girder collapse is supposed to initiate.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 34,
              "rank": 77,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 33,
              "rank": 487,
              "quartile": "Q3"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 29,
              "rank": 294,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2016,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 51,
              "rank": 266,
              "quartile": "Q2"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 51,
              "rank": 43,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 50,
              "rank": 130,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84950279126",
      "title": "Material selection for the gas containment system of a compressed natural gas carrier fleet",
      "doi": "10.1016/j.apor.2015.11.005",
      "venue": "Applied Ocean Research",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2016,
      "volume": "55",
      "issue_id": null,
      "pages": "37-47",
      "issn": "01411187",
      "eIssn": null,
      "source_id": "26776",
      "authors": "Gaiotti M.; Rizzo C. M.; Rizzuto E.; Vernengo G.",
      "author_ids": "55200599100;15072981100;6602173744;37662376400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "Compressed natural gas (CNG) | Fiber reinforced plastic (FRP) | Finite element method (FEM) | Multi-objective decision making environment | Ship synthesis model (SSM)",
      "abstract": "In this work, the possible exploitation of fiber-reinforced composites in the context of maritime transportation of compressed natural gas (CNG) is investigated. In addition to a more conventional steel configuration, two different fiber materials, carbon and glass, are considered as construction materials for pressure vessels (PVs) to be stored on board ships, with thickness optimized by FEM analysis.The considered scenario is represented by the transportation of CNG from an offshore well to a terminal on shore. Fleets of ships carrying CNG in pressure vessels manufactured with the investigated materials are generated by means of a ship synthesis model (SSM) software and compared on the basis of technical and economical indicators.The choice of the construction material influences considerably the weight of the PVs, which represent a major item of total ship weight and reflects directly on the general transport performances in terms of resistance, seakeeping and reliability in the service. On the other hand, capital as well as operating expenditures are considerably affected by the choice. When exploring the design space, the ship synthesis model is able, at a preliminary stage of the design, to account for the various technical and economical aspects, their implications and relationships. Results are presented of computations carried out in a specific case, identified by the annual gas production and other characteristics of the well terminal and a cruising route for the ships. The comparison is carried out on the basis of the cost per transported unit of gas and of the percentage of success in the transportation process. The computations show that the choice of the PV material has a key influence on the results in terms of optimal number, dimensions and speed of the ships.",
      "citations": 4,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 15,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2016,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 79,
              "rank": 18,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85046357953",
      "title": "Structural behaviour of yacht fillers",
      "doi": "10.3940/rina.ijsct.2016.b2.197",
      "venue": "Transactions of the Royal Institution of Naval Architects Part B International Journal of Small Craft Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2016,
      "volume": "158",
      "issue_id": null,
      "pages": "89-99",
      "issn": "17400694",
      "eIssn": null,
      "source_id": "5000154004",
      "authors": "Gaiotti M.; Rizzo C. M.; Nebbia G.; Caleo A.",
      "author_ids": "55200599100;15072981100;56865689000;56865960200",
      "authorAffiliationIds": "60025153;60025153;60025153;60083109",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "The first part of this paper focuses on the mechanical characterization of fillers obtained by an experimental campaign specifically designed to obtain adequate information about coating products currently applied on yacht hulls. The final aim was to assess their structural behaviour as well as their interactions and effects onto the shell plating. Fillers may be considered as two-components particulate composites characterized by type size and content of microspheres randomly embedded in a resin matrix. Hull and superstructure of yachts are covered by filler to obtain smooth surfaces necessary for faired and painted shiny exteriors. Simple tests were designed and carried out on several commercially available fillers: compression tests on isolated filler specimens and three point bending tests on specimens made by filler applied onto a steel substrate were considered sufficient to obtain an isotropic constitutive model characterization. Numerical models were thereafter built up to highlight some specific effects of the structural behaviour of plated structures coated by fillers.",
      "citations": 1,
      "quartile": [
        {
          "year": 2016,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 18,
              "rank": 71,
              "quartile": "Q4"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 10,
              "rank": 232,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84996538307",
      "title": "Effect of combined shear stresses on the ultimate axial response of the double bottom of a containership",
      "doi": "10.1115/OMAE201654908",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": "9",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Gaiotti Marco; Fujikubo Masahiko; Bacoccoli Riccardo; Rizzo Cesare Mario",
      "author_ids": "55200599100;7003568966;57192072746;15072981100",
      "authorAffiliationIds": "60025153;60024322;60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "Ultimate strength of the hull girder of containerships became a significant issue in the last years in view of recent accidents and related investigations. Actually, larger and larger ships were put into service and still are designed and built. Recognizing such an issue, investigations were carried out and led to the issuance of a specific longitudinal strength standard for containerships by the International Association of Classification Societies [1]. Loading conditions become more and more challenging and especially combinations of various actions were found to impair the hull girder ultimate strength. In the attempt to better understand the influence of load combinations onto the ultimate strength of the hull girder, investigations were carried out. In this paper, the effects of the shear is considered using rather refined and accurate finite element models of a typical containership double bottom.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84931007067",
      "title": "On the shear lag effective breadth concept for composite hull structures",
      "doi": "10.1080/17445302.2014.887172",
      "venue": "Ships and Offshore Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2015,
      "volume": "10",
      "issue_id": "3",
      "pages": "272-289",
      "issn": "17445302",
      "eIssn": null,
      "source_id": "19700186818",
      "authors": "Ghelardi Stefano; Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "56030081700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Ghelardi S.",
      "keywords": "composites | effective breadth | finite element analysis | stiffened plates",
      "abstract": "The aim of this paper is to study the concept of shear lag effective breadth of plating, widely applied in the scantling assessments of metallic ship structures, for the special case of composite hull stiffened plating. Indeed, geometries and material behaviour are rather different and the definition of the effective breadth is worthy of investigation. A broad literature survey highlighted that the case of composites is almost not covered by previous studies and that only simplified empirical formulations are proposed for effective breadth evaluations in the rules of classification societies. Thus, suitable finite element models were created and validated to investigate the behaviour of the effective breadth of stiffened laminates when varying geometrical and other typical parameters of composite made ship structures. It was found useful to switch from stresses to strains in the effective breadth definition, considering the anisotropy of the material. An extensive sensitivity analysis allowed assessing the effect of parameters governing the phenomenon. Eventually, regression formulae are proposed summarising the outcomes and possibly applicable in design scantling practice.",
      "citations": 5,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 71,
              "rank": 33,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 68,
              "rank": 235,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2015,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 60,
              "rank": 36,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 54,
              "rank": 241,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84931005847",
      "title": "Dynamic buckling of masts of large sail ships",
      "doi": "10.1080/17445302.2014.887175",
      "venue": "Ships and Offshore Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2015,
      "volume": "10",
      "issue_id": "3",
      "pages": "290-301",
      "issn": "17445302",
      "eIssn": null,
      "source_id": "19700186818",
      "authors": "Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "dynamic buckling | FEM | mast | rigging | sail ship",
      "abstract": "The design of sail systems is a fascinating topic that naval architects have been facing since many centuries and nowadays is revived because of the increasing size of modern pleasure and racing yachts. It is hence surprising that empiricism largely drives mast and rigging design even at the present time. Actually, while structural dynamics is explicitly considered in current scantling design of hull structures, this is not usually the case for mast and rigging. However, numerical simulations can now be successfully applied to assess effects of load variations in time. Considering the governing limit states and the typical behaviour of a pre-tensioned slender structure, the dynamic buckling of the bottom panel of a typical large mast is evaluated in this paper, showing significant differences from the widely applied quasi-static approach. The obtained results provide a new perspective for the scantling assessment of sail systems, overcoming the current empirical and prescriptive approach proposed by rules of classification societies and international standards.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 71,
              "rank": 33,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 68,
              "rank": 235,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2015,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 60,
              "rank": 36,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 54,
              "rank": 241,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84983580369",
      "title": "Optimization of the ballistic properties of an advanced composite armor system: Analysis and validation of numerical models subject to high velocity impacts",
      "doi": null,
      "venue": "Maritime Technology and Engineering Proceedings of Martech 2014 2nd International Conference on Maritime Technology and Engineering",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": "1",
      "issue_id": null,
      "pages": "463-474",
      "issn": null,
      "eIssn": null,
      "source_id": "21100776075",
      "authors": "Sabadin G.; Gaiotti M.; Rizzo C. M.; Bassano A.",
      "author_ids": "57190866719;55200599100;15072981100;26021711300",
      "authorAffiliationIds": "60025153;60025153;60025153;113302561",
      "corresponding": "Sabadin G.",
      "keywords": null,
      "abstract": "This research focuses on the optimization of the ballistic properties of an advanced composite armor system made by an Alumina ceramic outer layer and a second back-packing layer formed by aramidic fibers in an epoxy matrix. This new advanced armor can be integrated e.g. in superstructures of a fast speed patrol boat in order to ensure the protection of the crew and of the equipment installed on board. Different numerical simulations have been conducted in Autodyn™ environment in order to model the non-linear dynamics of interactions between a NATO 7.62 Armour Piercing bullet and a range of different target models. To analyze the fragmentation and fracture behavior of ceramic tiles, different numerical modeling strategies were used. Moreover, the best setting of numerical parameters involved in the description of the mathematical model have been obtained and validated. These numerical results have been compared to experimental tests: the comparison has been used to analyze, modify and finally validate the most cost effective modeling strategy and the main parameters involved in the dynamic simulation of High Velocity Impact (HVI) obtaining a finite element model that describe with good agreement the results of the experimental tests.",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84944686137",
      "title": "Influence of air inclusions on marine composites inter-laminar shear strength",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": "2015-January",
      "issue_id": null,
      "pages": "593-601",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Godani Mattia; Gaiotti Marco; Rizzo Cesare Mario",
      "author_ids": "56118741700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Godani M.",
      "keywords": "Air inclusion | Composite | Finite element analysis | Inter-laminar shear | Testing",
      "abstract": "This paper proposes a complete experimental/numerical comparison, carried out at the Marine Structures Testing Lab of the University of Genoa, Italy, on the evaluation of the inter-laminar shear strength in composite laminates typically used in the marine industry and offshore wind energy, manufactured including a non-negligible percentage of voids, in order to assess its effects on the inter-laminar shear strength. The specimens originally obtained from larger panels made by pre-impregnated fabrics, were manufactured according to the ASTM standard D3846-79, which is the test required by most Classification Societies for the evaluation of the inter-laminar shear strength of composites.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2015,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 38,
              "rank": 112,
              "quartile": "Q3"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 37,
              "rank": 56,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 32,
              "rank": 358,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84944685240",
      "title": "Effect of shear stresses onto the hull girder ultimate strength of a containership",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": "2015-January",
      "issue_id": null,
      "pages": "1135-1143",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Fujikubo Masahiko; Gaiotti Marco; Grasso Nicola; Rizzo Cesare Mario",
      "author_ids": "7003568966;55200599100;56912346300;15072981100",
      "authorAffiliationIds": "60024322;;;",
      "corresponding": "Fujikubo M.",
      "keywords": "Buckling | Combined loads | Containership | Shear | Ultimate load",
      "abstract": "When considering the ultimate strength of hull girders, reference is usually made to pure vertical bending and collapse analysis is carried out by progressively increasing the curvature of the beam. However, reality is much more complex and combined loads may affect the collapse behavior of the structure. Building a complete FE numerical model able to simulate a ship's portion whose extension in length be sufficient to properly evaluate combined loading effects is rather time consuming, both in terms of modelling and of computational time. Moreover, when dealing with large models, assigning properly boundary conditions representing actual forces and moments distribution on the hull girder is a challenging task. In this paper the effect of shear stress distribution on the hull girder structural components is analyzed. At first, finite element models simulating a suitable length of the hull girder are considered. Later on, smaller models of stiffened panels are extracted from hull girder models and analyzed. Shear stress distributions due to both shear forces and torsion moments acting on the hull girder appear to influence the ultimate strength. The aim of this work is to investigate the shear stress distribution originating in the whole cross section and build a smaller model extracted from a selected portion of the ship where hull girder collapse is supposed to initiate. Proper boundary conditions and load application are investigated in order to match the stress distributions found in the global model.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2015,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 38,
              "rank": 112,
              "quartile": "Q3"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 37,
              "rank": 56,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 32,
              "rank": 358,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84942133848",
      "title": "Mechanical characterization of yachts and pleasure crafts fillers",
      "doi": "10.1201/b18179-83",
      "venue": "Analysis and Design of Marine Structures Proceedings of the 5th International Conference on Marine Structures Marstruct 2015",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": "627-635",
      "issn": null,
      "eIssn": null,
      "source_id": "21100986043",
      "authors": "Nebbia G.; Rizzo C. M.; Gaiotti M.; Caleo A.",
      "author_ids": "56865689000;15072981100;55200599100;56865960200",
      "authorAffiliationIds": "60025153;60025153;60025153;113018464",
      "corresponding": "Nebbia G.",
      "keywords": null,
      "abstract": "This paper describes an experimental campaign specifically intended for the mechanical characterization of fillers. Fillers are two-components particulate composites, characterized by type, size and content of glass microsphere, randomly embedded in an epoxy matrix. Hull and superstructure of yachts are covered by filler to mould the surfaces. To obtain painted shiny surfaces, the filler should be perfectly levelled, faired and smoothed. Differently to the works presented in open literature, this paper focuses on the macro-mechanics properties regardless the fillers’ internal mechanic. Two types of tests were designed and conducted on six different fillers: a compression strength test on simple filler specimens and a three point bending test on specimens made by filler applied onto a steel substrate. Load- displacement curves of tested fillers were acquired providing the basis for the characterization of strength and stiffness. Results are repeatable and consistent and comparisons among different fillers are presented.",
      "citations": 5,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84906919672",
      "title": "Numerical simulation strategies of single lap joints",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2014,
      "volume": null,
      "issue_id": null,
      "pages": "179-186",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Tomaso Emma; Risso Giovanni; Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "56349242000;55212605200;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60122238;60025153;60025153",
      "corresponding": "Tomaso E.",
      "keywords": "Adina | Bonded joint | Cohesive zone model | Marc | Single lap test",
      "abstract": "Single Lap Joints between steel and composite adherends, bonded with an epoxy resin, are numerically examined. The purpose of this work is to verify the reliability of different numerical strategies in simulating the delamination of the interfaces. Theoretical fundamentals of each method are taken into account. The main geometrical parameter is the overlap length. Numerical results are compared to experimental tests; benchmarks of the simulation quality are the elastic stiffness of the joint and its failure load. Copyright © 2014 by the International Society of Offshore and Polar Engineers (ISOPE).",
      "citations": 4,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2014,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 44,
              "rank": 97,
              "quartile": "Q3"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 41,
              "rank": 52,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 37,
              "rank": 327,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84898828190",
      "title": "Interlaminar shear strength of marine composite laminates: Tests and numerical simulations",
      "doi": "10.1016/j.compstruct.2014.02.013",
      "venue": "Composite Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2014,
      "volume": "112",
      "issue_id": "1",
      "pages": "122-133",
      "issn": "02638223",
      "eIssn": null,
      "source_id": "15063",
      "authors": "Godani M.; Gaiotti M.; Rizzo C. M.",
      "author_ids": "56118741700;55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Godani M.",
      "keywords": "Experimental testing | FEM | Interlaminar shear | Marine composites",
      "abstract": "This paper deals with an experimental/numerical comparison of the interlaminar shear stress in typical marine composite laminates manufactured according to two different fabrication processes, namely vacuum infusion and pre-impregnated lay-up. Experimental tests were carried out at the Marine Structures Testing Lab of the University of Genova. Actually, among widely applied empirical formulations for the characterization of composites suggested by Classification Societies rules, the ones for the interlaminar shear strength appear the most scattered because of the complexity in assessing failure phenomena. Composite manufacturers generally carry out rather extensive tests for the complete characterization of the laminates.Due to non-linearities involved in the captioned study, the support of nonlinear numerical models was required. The aim of the comprehensive use of numerical approaches is the reduction of time-consuming and expensive experimental campaigns.Three different FE modeling strategies are proposed in order to verify the reliability of the numerical results in comparison with experimental targets. The merits and shortcomings of each are discussed, also comparing different types of finite element formulations and mesh refinement sensitivity. © 2014 Elsevier Ltd.",
      "citations": 21,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 97,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Ceramics and Composites",
              "percentile": 92,
              "rank": 10,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2014,
          "subjects": [
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 98,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Ceramics and Composites",
              "percentile": 92,
              "rank": 7,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84893025184",
      "title": "An high order mixed interpolation tensorial components (MITC) shell element approach for modeling the buckling behavior of delaminated composites",
      "doi": "10.1016/j.compstruct.2013.10.003",
      "venue": "Composite Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2014,
      "volume": "108",
      "issue_id": "1",
      "pages": "657-666",
      "issn": "02638223",
      "eIssn": null,
      "source_id": "15063",
      "authors": "Gaiotti Marco; Rizzo Cesare M.; Branner Kim; Berring Peter",
      "author_ids": "55200599100;15072981100;22937137000;36607392100",
      "authorAffiliationIds": "60025153;60025153;60011373;60011373",
      "corresponding": "Gaiotti M.",
      "keywords": "Buckling | Composites | Delamination | FEM modeling | Tests",
      "abstract": "This paper describes the experimental and numerical studies carried out on delaminated fiberglass epoxy resin laminates made-up by different fabrication methods, namely by vacuum infusion and prepreg. While the tested specimens were originally intended for the assessment of buckling behavior of composite laminates of wind turbine blades, results were found valuable for the marine industry as well, because similar laminates are used for the hull shell and stiffeners. Systematic calculations were carried out to assess the effects of an embedded delamination on the buckling load, varying the size and through thickness position of the delamination. Different finite element modeling strategies were considered and validated against the experimental results. The one applying the 9 nodes MITC shell elements was found matching the experimental data despite failure modes were different for the two fabrication methods. © 2013 Elsevier Ltd.",
      "citations": 22,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 97,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Ceramics and Composites",
              "percentile": 92,
              "rank": 10,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2014,
          "subjects": [
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 98,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Ceramics and Composites",
              "percentile": 92,
              "rank": 7,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84874913673",
      "title": "Finite element modeling strategies for sandwich composite laminates under compressive loading",
      "doi": "10.1016/j.oceaneng.2013.01.031",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2013,
      "volume": "63",
      "issue_id": null,
      "pages": "44-51",
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "Buckling | Composites | Delamination | FEM modeling | Sandwich",
      "abstract": "This paper deals with the buckling behavior of composite sandwich columns under compressive loading. Namely, finite element (FE) modeling strategies are discussed with the aim to test a suitable and cost effective solution for assessing the buckling behavior of delaminated sandwich laminates. Indeed, pleasure craft industry is now facing the challenge of thinner and thinner skin laminates. Buckling, that in past years was not a governing limit state because of rather high thicknesses and of limited spans of structural elements, should be now assessed possibly accounting for actual defects, i.e. delaminations, and applying straightforward but cost-effective approaches, easy to implement in the everyday practice of composite hull structural design. A suitable test case, available in open literature, was selected and results of the proposed modeling strategy are compared with experimental ones as well as with other numerical estimates, showing its capabilities and addressing hints for FE application. © 2013 Elsevier Ltd.",
      "citations": 23,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2013,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 85,
              "rank": 13,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 72,
              "rank": 27,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84874498011",
      "title": "Calibration of a finite element composite delamination model by experiments",
      "doi": "10.1201/b15120-53",
      "venue": "Analysis and Design of Marine Structures Proceedings of the 4th International Conference on Marine Structures Marstruct 2013",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2013,
      "volume": null,
      "issue_id": null,
      "pages": "389-396",
      "issn": null,
      "eIssn": null,
      "source_id": "21100229849",
      "authors": "Gaiotti M.; Rizzo C. M.; Branner K.; Berring P.",
      "author_ids": "55200599100;15072981100;22937137000;36607392100",
      "authorAffiliationIds": "60025153;60025153;60011373;60011373",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "This paper deals with the mechanical behavior under in plane compressive loading of thick and mostly unidirectional glass fiber composite plates made with an initial embedded delamination. The delamination is rectangular in shape, causing the separation of the central part of the plate into two distinct sub-laminates. The work focuses on experimental validation of a finite element model built using the 9-noded MITC9 shell elements, which prevent locking effects and aiming to capture the highly non linear buckling features involved in the problem. The geometry has been numerically defined by a previously established modeling strategy (Branner et al., 2011; Gaiotti & Rizzo, 2011), using a pure shell model where the delamination is accounted for by properly offsetting its surfaces and connecting them to the intact plate via rigid link constraining algorithms. The numerical model developed by the University of Genova is compared with the experimental results provided by an extensive experimental campaign conducted by the Department of Wind Energy at the Technical University of Denmark (Branner & Berring, 2011). Along with the experimental/numerical comparison, an attempt to identify the fracture modes related to the production methods is presented in this paper. A microscopic analysis of the fracture surfaces was carried out in order to better understand the failure mechanisms. © 2013 Taylor & Francis Group.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84896832152",
      "title": "Buckling behavior of FRP sandwich panels made by hand layup and vacuum bag infusion procedure",
      "doi": null,
      "venue": "Sustainable Maritime Transportation and Exploitation of Sea Resources Proceedings of the 14th International Congress of the International Maritime Association of the Mediterranean Imam 2011",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2012,
      "volume": "1",
      "issue_id": null,
      "pages": "385-392",
      "issn": null,
      "eIssn": null,
      "source_id": "21100291826",
      "authors": "Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "This paper deals with strength of composite sandwich panels typically used in pleasure boats and naval industry. The focus is on the influence of fabrication processes onto the mechanical behavior, namely onto buckling strength. Both, experimental and numerical analyses were carried out in the Ship Structures Laboratory of the University of Genova on rectangular specimens, whose dimensions and geometry were conceived to induce buckling collapse, being this one a typical failure mode under compressive loading for thin skins sandwich. Tests on both hand layup fabricated and infusion made panels were carried out measuring compressive load vs. shortening and lateral deflection. Videos of the tests were taken and used to gather some measurements and to assess failure time and location. Experimental results were compared with different numerical models, developed considering large deformations in the PVC core under buckling conditions. Various finite element types and different implementation were considered to model complex interactions between core and skins. The conclusions of this paper aim to provide designers of pleasure and naval crafts with some hints about different strategies to build up costeffective numerical models for predicting buckling and post-buckling behavior of sandwich hulls, taking advantage of calibrations obtained through experimental testing. © 2012 Taylor & Francis Group, London, UK.",
      "citations": 6,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84860338143",
      "title": "An analytical/numerical study on buckling behaviour of typical composite top hat stiffened panels",
      "doi": "10.1080/17445302.2010.505370",
      "venue": "Ships and Offshore Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2012,
      "volume": "7",
      "issue_id": "2",
      "pages": "151-164",
      "issn": "17445302",
      "eIssn": null,
      "source_id": "19700186818",
      "authors": "Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": "buckling | composite | naval structures | pleasure craft | scantling assessments",
      "abstract": "This paper deals with the buckling strength of typical ship stiffened panels built in fibreglass composite laminates. The results obtained applying analytical formulations based on equilibrium and potential energy equations are compared with the ones obtained by linearised eigenvalue analyses of rather detailed finite-element models. Analytical formulations consider an elementary panel only, accounting for the boundary effects of stiffeners surrounding its edges, while FE models fully describe the interactions among plate and stiffeners as a whole. A sensitivity analysis to highlight the most influencing parameters in the problem is also presented.So far no systematic scantling assessment of buckling behaviour of hull shell and deck panels seems to be recommended by classification societies' rules for pleasure crafts made in composite materials. Thus, this paper aims at illustrating the application limits of analytical methods, natural candidates to become the basis of rule requirements. Difficulties in the evaluation of torsion behaviour of stiffeners and of corresponding buckling modes involving both the plate and the stiffeners are highlighted. Some concluding suggestions for rule scantling assessment formulations are eventually provided. © 2012 Taylor and Francis Group, LLC.",
      "citations": 14,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 71,
              "rank": 33,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 68,
              "rank": 235,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2012,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 58,
              "rank": 36,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 46,
              "rank": 267,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84875938149",
      "title": "Comparison of two finite element methods with experiments of delaminated composite panels",
      "doi": null,
      "venue": "Iccm International Conferences on Composite Materials",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2011,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "19900192335",
      "authors": "Branner K.; Berring P.; Gaiotti M.; Rizzo C. M.",
      "author_ids": "22937137000;36607392100;55200599100;15072981100",
      "authorAffiliationIds": "60011373;60011373;60025153;60025153",
      "corresponding": "Branner K.",
      "keywords": "Compressive strength | Delamination | Experiments | Finite element analysis",
      "abstract": null,
      "citations": 5,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85059551556",
      "title": "Buckling behavior of FRP sandwich panels made by hand layup and vacuum bag infusion procedure",
      "doi": null,
      "venue": "Sustainable Maritime Transportation and Exploitation of Sea Resources",
      "type": "Book",
      "sub_type": "Book Chapter",
      "year": 2011,
      "volume": null,
      "issue_id": null,
      "pages": "385-392",
      "issn": null,
      "eIssn": null,
      "source_id": "21100894060",
      "authors": "Gaiotti Marco; Rizzo Cesare M.",
      "author_ids": "55200599100;15072981100",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "This paper deals with strength of composite sandwich panels typically used in pleasure boats and naval industry. The focus is on the influence of fabrication processes onto the mechanical behavior, namely onto buckling strength. Both, experimental and numerical analyses were carried out in the Ship Structures Laboratory of the University of Genova on rectangular specimens, whose dimensions and geometry were conceived to induce buckling collapse, being this one a typical failure mode under compressive loading for thin skins sandwich. Tests on both hand layup fabricated and infusion made panels were carried out measuring compressive load vs. shortening and lateral deflection. Videos of the tests were taken and used to gather some measurements and to assess failure time and location. Experimental results were compared with different numerical models, developed considering large deformations in the PVC core under buckling conditions. Various finite element types and different implementation were considered to model complex interactions between core and skins. The conclusions of this paper aim to provide designers of pleasure and naval crafts with some hints about different strategies to build up costeffective numerical models for predicting buckling and post-buckling behavior of sandwich hulls, taking advantage of calibrations obtained through experimental testing.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85133226618",
      "title": "Finite elements modeling of delaminations in composite laminates",
      "doi": null,
      "venue": "Advances in Marine Structures",
      "type": "Book",
      "sub_type": "Book Chapter",
      "year": 2011,
      "volume": null,
      "issue_id": null,
      "pages": "133-139",
      "issn": null,
      "eIssn": null,
      "source_id": "21101094529",
      "authors": "Gaiotti M.; Rizzo C. M.; Branner K.; Berring P.",
      "author_ids": "55200599100;15072981100;22937137000;36607392100",
      "authorAffiliationIds": "60025153;60025153;60011373;60011373",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "The application of composite materials in many structures poses to engineers the problem to create reliable and relatively simple methods, able to estimate the strength of multilayer composite structures. Multilayer composites, like other laminated materials, suffer from layer separation, i.e., delaminations, which may affect the stiffness and stability of structural components. Especially deep delaminations in the mid surface of laminates are expected to reduce the effective flexural stiffness and lead to collapse, often due to buckling behaviour. This paper deals with the numerical modelling of the buckling strength of composite laminates containing delaminations. Namely, non-linear buckling and post-buckling analyses are carried out to predict the critical buckling load of elementary composite laminates affected by rectangular delaminations of different sizes and locations, which are modelled by finite elements using ifferent techniques. Results obtained with different finite element models are compared and discussed.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84860788878",
      "title": "Finite elements modeling of delaminations in composite laminates",
      "doi": "10.1201/b10771-18",
      "venue": "Advances in Marine Structures Proceedings of the 3rd International Conference on Marine Structures Marstruct 2011",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2011,
      "volume": null,
      "issue_id": null,
      "pages": "133-139",
      "issn": null,
      "eIssn": null,
      "source_id": "21100201968",
      "authors": "Gaiotti M.; Rizzo C. M.; Branner K.; Berring P.",
      "author_ids": "55200599100;15072981100;22937137000;36607392100",
      "authorAffiliationIds": "60025153;60025153;60011373;60011373",
      "corresponding": "Gaiotti M.",
      "keywords": null,
      "abstract": "The application of composite materials in many structures poses to engineers the problem to create reliable and relatively simple methods, able to estimate the strength of multilayer composite structures. Multilayer composites, like other laminated materials, suffer from layer separation, i.e., delaminations, which may affect the stiffness and stability of structural components. Especially deep delaminations in the mid surface of laminates are expected to reduce the effective flexural stiffness and lead to collapse, often due to buckling behaviour. This paper deals with the numerical modelling of the buckling strength of composite laminates containing delaminations. Namely, non-linear buckling and post-buckling analyses are carried out to predict the critical buckling load of elementary composite laminates affected by rectangular delaminations of different sizes and locations, which are modelled by finite elements using different techniques. Results obtained with different finite element models are compared and discussed. © 2011 Taylor & Francis Group, London.",
      "citations": 9,
      "quartile": null
    }
  ],
  "iris_products": [
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1265103",
      "authors": "Pais, T.; Vergassola, G.; Gaiotti, M.; Rizzo, C. M.; Valtanen, J.; Kivela, S.; Lenarduzzi, W.; Hauninen, M.; Laot, A. H.; Gilles, P. P.; El Faziki, M.; Nechita, M.; Popescu, G.; Thormodsaeter, J.; Severeide, K.; Mendibil, A.; Miguelez, F.; Campos, J. A.; Sanchez-Beaskoetxea, J.; Boullosa-Falces, D.; Rossi, A.",
      "legacy_id": 661209,
      "year": 2025,
      "miur_type": "273",
      "title": "An Overview of the Shipbuilding Labour Market: The LeaderSHIP EU Project",
      "scopus_id": "2-s2.0-105016215567",
      "doi": "10.3233/PMST250079",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1269516",
      "authors": "Mannacio, F.; Barbato, A.; Di Marzo, F.; Gaiotti, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 666566,
      "year": 2025,
      "miur_type": "262",
      "title": "Study of the effects of underwater explosions on the bases of on-board equipment in naval units: Experimental validation of numerical models",
      "scopus_id": "2-s2.0-105015841810",
      "type": "01.01 - Articolo su rivista",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1243375",
      "authors": "Barsotti, B.; Battini, C.; Gaiotti, M.; Rizzo, C. M.; Vergassola, G.",
      "legacy_id": 633667,
      "year": 2025,
      "miur_type": "262",
      "title": "Experimental and numerical assessment of ultimate strength of a transversally loaded thin-walled deck structure",
      "scopus_id": "2-s2.0-85218884211",
      "doi": "10.1016/j.marstruc.2025.103793",
      "isi_id": "WOS:001435874600001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "3",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1156993",
      "authors": "Barsotti, B.; Gaiotti, M.",
      "legacy_id": 522656,
      "year": 2024,
      "miur_type": "262",
      "title": "Cumulative buckling deformation of stiffened panel under cyclic loading",
      "scopus_id": "2-s2.0-85173522453",
      "doi": "10.1177/14750902231198902",
      "isi_id": "WOS:001075581600001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "3",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1174029",
      "authors": "Gaiotti, M.; Aguiari, M.; Vergassola, G.; Rizzo, C. M.",
      "legacy_id": 546285,
      "year": 2024,
      "miur_type": "262",
      "title": "A rational approach for the scantling design of GRP pleasure crafts",
      "scopus_id": "2-s2.0-85190502162",
      "doi": "10.1016/j.oceaneng.2024.117866",
      "isi_id": "WOS:001231813900001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "0",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1275478",
      "authors": "Gaiotti, M.; Barsotti, B.; Brubak, L.; Chen, B. -Q.; Darie, I.; Georgiadis, D.; Ishibashi, K.; Korgesaar, M.; Lv, Y.; Nahshon, K.; Paredes, M.; Ringsberg, J.; Schipperen, I.; Tatsumi, A.; Vaz, M.; Wang, Y.; Zamarin, A.; Zhan, Z.",
      "legacy_id": 673198,
      "year": 2024,
      "miur_type": "273",
      "title": "ISSC 2025 COMMITTEE III.1 - COMPRESSIVE TEST OF A TRANSVERSELY STIFFENED THIN-PLATED STRUCTURE WITH EXPECTED EARLY NONLINEAR RESPONSE PRIOR TO THE ULTIMATE CAPACITY. PRELIMINARY COMPARISON OF THE NUMERICAL RESULTS",
      "scopus_id": "2-s2.0-85209919571",
      "doi": "10.1115/OMAE2024-126382",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1275496",
      "authors": "Barsotti, B.; Gaiotti, M.",
      "legacy_id": 673217,
      "year": 2024,
      "miur_type": "273",
      "title": "RESIDUAL PLASTIC STRAIN EFFECTS ON THE ULTIMATE CAPACITY FOR A HSLA STIFFENED PANEL SUBJECTED TO TWO DIFFERENT CYCLIC LOAD CONDITIONS",
      "scopus_id": "2-s2.0-85209877783",
      "doi": "10.1115/OMAE2024-126720",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1178355",
      "authors": "Mannacio, F.; Di Marzo, F.; Gaiotti, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 552012,
      "year": 2024,
      "miur_type": "262",
      "title": "A Design Approach to Assess Effects of Non-Contact Underwater Explosions on Naval Composite Vessels",
      "scopus_id": "2-s2.0-85194164622",
      "doi": "10.1007/s11804-024-00421-6",
      "isi_id": "WOS:001230327200006",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "3",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1130898",
      "authors": "Mannacio, F.; Barbato, A.; Di Marzo, F.; Gaiotti, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 488588,
      "year": 2023,
      "miur_type": "273",
      "title": "Studio degli effetti delle esplosioni subacquee sui basamenti dei macchinari montati a bordo delle unità navali: validazione sperimentale di modelli numerici",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1156995",
      "authors": "Barsotti, B.; Gaiotti, M.",
      "legacy_id": 522658,
      "year": 2023,
      "miur_type": "273",
      "title": "Cumulative buckling deformation of stiffened panel under cyclic loading",
      "scopus_id": "2-s2.0-85145590797",
      "doi": "10.1201/9781003358961-15",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1275438",
      "authors": "Barsotti, B.; Gaiotti, M.",
      "legacy_id": 673158,
      "year": 2023,
      "miur_type": "273",
      "title": "Evaluation of residual plastic strain on a stiffened panel subjected to compression and tension-compression cyclic load",
      "scopus_id": "2-s2.0-85185845946",
      "doi": "10.1201/9781003399759-44",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1275476",
      "authors": "Barsotti, B.; Gaiotti, M.",
      "legacy_id": 673181,
      "year": 2023,
      "miur_type": "273",
      "title": "FEM numerical strategies for the evaluation of the accumulated plastic strain due to a cyclic load condition",
      "scopus_id": "2-s2.0-85185832744",
      "doi": "10.1201/9781003399759-45",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1156177",
      "authors": "Mannacio, F.; Di Marzo, F.; Gaiotti, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 521116,
      "year": 2023,
      "miur_type": "262",
      "title": "An open benchmark to assess the effects of underwater explosions on steel panels using the volume of fluid approach",
      "scopus_id": "2-s2.0-85174731719",
      "doi": "10.1016/j.oceaneng.2023.116093",
      "isi_id": "WOS:001104016200001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "4",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1130897",
      "authors": "Barsotti, B.; Cestineto, F.; Gambino, A.; Gaiotti, M.; Menini, S.; Risso, G.; Sacchet, A.; Rizzo, C. M.",
      "legacy_id": 488587,
      "year": 2023,
      "miur_type": "273",
      "title": "Applicazione di una procedura di verifica a buckling non lineare per il dimensionamento delle strutture navali",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1101913",
      "authors": "Pais, T; Gaiotti, M; Rizzo, Cm",
      "legacy_id": 445209,
      "year": 2022,
      "miur_type": "262",
      "title": "A Quick and Practical Approach for Concept-design of Submerged Thin-walled Stiffened Cylinders",
      "scopus_id": "2-s2.0-85139423839",
      "doi": "10.1007/s11804-022-00280-z",
      "isi_id": "WOS:000865261900010",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "2",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1083097",
      "authors": "Mannacio, F.; Barbato, A.; Di Marzo, F.; Gaiotti, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 421192,
      "year": 2022,
      "miur_type": "262",
      "title": "Shock effects of underwater explosion on naval ship foundations: Validation of numerical models by dedicated tests",
      "scopus_id": "2-s2.0-85129684332",
      "doi": "10.1016/j.oceaneng.2022.111290",
      "isi_id": "WOS:000798237100002",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "22",
      "citations_scopus": "25"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1156999",
      "authors": "Hess, P. E.; An, C.; Brubak, L.; Chen, X.; Chiu, J. T.; Czujko, J.; Darie, I.; Feng, G.; Gaiotti, M.; Jang, B. S.; Kefal, A.; Makmun, S.; Ringsberg, J.; Romanoff, J.; Saad-Eldeen, S.; Schipperen, I.; Tabri, K.; Wang, Y.; Yanagihara, D.",
      "legacy_id": 522662,
      "year": 2022,
      "miur_type": "273",
      "title": "ULTIMATE STRENGTH",
      "scopus_id": "2-s2.0-85158885068",
      "doi": "10.5957/ISSC-2022-COMMITTEE-III-1",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102388",
      "authors": "Gaiotti, M.; Vergassola, G.; Pais, T.",
      "legacy_id": 445698,
      "year": 2022,
      "miur_type": "273",
      "title": "A STRATEGY FOR THE REDUCTION OF STRUCTURAL WEIGHT OF COMPOSITE VESSELS",
      "scopus_id": "2-s2.0-85140717918",
      "doi": "10.1115/OMAE2022-80387",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1101915",
      "authors": "Mannacio, F.; Di Marzo, F.; Gaiotti, M.; Guzzo, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 445223,
      "year": 2022,
      "miur_type": "273",
      "title": "Shock characterization of fiberglass composite laminates: numerical and experimental comparison",
      "scopus_id": "2-s2.0-85138178431",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1105593",
      "authors": "Pais, Tatiana; Gaiotti, Marco; Barsotti, Beatrice",
      "legacy_id": 451480,
      "year": 2022,
      "miur_type": "262",
      "title": "Evaluation of the Residual Capacity of a Submarine for Different Limit States with Various Initial Imperfection Models",
      "type": "01.01 - Articolo su rivista"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1048233",
      "authors": "Poggi, L.; Gaggero, T.; Gaiotti, M.; Ravina, E.; Rizzo, C. M.",
      "legacy_id": 367135,
      "year": 2022,
      "miur_type": "262",
      "title": "Robotic inspection of ships: inherent challenges and assessment of their effectiveness",
      "scopus_id": "2-s2.0-85098516150",
      "doi": "10.1080/17445302.2020.1866378",
      "isi_id": "WOS:000603854100001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "9",
      "citations_scopus": "16"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1130895",
      "authors": "Mannacio, F.; Di Marzo, F.; Gaiotti, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 488585,
      "year": 2022,
      "miur_type": "273",
      "title": "The Effects on Non-Contact Underwater Explosions on Naval Composite Structures: Design Numerical Analyses and Experimental Validation",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1096257",
      "authors": "Mannacio, F.; Di Marzo, F.; Gaiotti, M.; Guzzo, M.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 436330,
      "year": 2022,
      "miur_type": "262",
      "title": "Characterization of underwater shock transient effects on naval E-glass biaxial fiberglass laminates: An experimental and numerical method",
      "scopus_id": "2-s2.0-85138021167",
      "doi": "10.1016/j.apor.2022.103356",
      "isi_id": "WOS:000866454000001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "3",
      "citations_scopus": "6"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1096256",
      "authors": "Aguiari, M.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 436332,
      "year": 2022,
      "miur_type": "262",
      "title": "Ship weight reduction by parametric design of hull scantling",
      "scopus_id": "2-s2.0-85137095436",
      "doi": "10.1016/j.oceaneng.2022.112370",
      "isi_id": "WOS:000878267300013",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "7",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1052237",
      "authors": "Poggi, Laura; Gaggero, Tomaso; Gaiotti, Marco; Ravina, Enrico; Rizzo, CESARE MARIO",
      "legacy_id": 386252,
      "year": 2021,
      "miur_type": "262",
      "title": "Recenti sviluppi nell'ispezione da remoto di strutture navali",
      "scopus_id": "2-s2.0-85128908896",
      "type": "01.01 - Articolo su rivista",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1076607",
      "authors": "Barbato, A.; Gaiotti, M.; Mannacio, F.; Rizzo, C. M.; Venturini, M.",
      "legacy_id": 413832,
      "year": 2021,
      "miur_type": "268",
      "title": "Analysis of the shock effects on a typical foundation structure: experimental and numerical investigation",
      "scopus_id": "2-s2.0-85216609274",
      "doi": "10.1201/9781003230373-8",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1083111",
      "authors": "Ringsberg, J. W.; Darie, I.; Nahshon, K.; Shilling, G.; Vaz, M. A.; Benson, S.; Brubak, L.; Feng, G.; Fujikubo, M.; Gaiotti, M.; Hu, Z.; Jang, B. -S.; Paik, J. -K.; Slagstad, M.; Tabri, K.; Wang, Y.; Wiegard, B.; Yanagihara, D.",
      "legacy_id": 421188,
      "year": 2021,
      "miur_type": "262",
      "title": "The ISSC 2022 committee III.1-Ultimate strength benchmark study on the ultimate limit state analysis of a stiffened plate structure subjected to uniaxial compressive loads",
      "scopus_id": "2-s2.0-85107680091",
      "doi": "10.1016/j.marstruc.2021.103026",
      "isi_id": "WOS:000684201900006",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "37",
      "citations_scopus": "43"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1076609",
      "authors": "Shah, F.; Gaggero, T.; Gaiotti, M.; Ivaldi, L.; Rizzo, C. M.",
      "legacy_id": 413835,
      "year": 2021,
      "miur_type": "268",
      "title": "Structural Surface Assessment of Ship Structures Intended for Robotic Inspection Applications",
      "scopus_id": "2-s2.0-85185318302",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1083213",
      "authors": "Aguiari, M.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 421329,
      "year": 2021,
      "miur_type": "273",
      "title": "La riduzione del peso dello scafo: un diverso approccio alla progettazione delle navi militari",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1052241",
      "authors": "Aguiari, M.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 386256,
      "year": 2021,
      "miur_type": "262",
      "title": "A design approach to reduce hull weight of naval ships",
      "scopus_id": "2-s2.0-85109904613",
      "doi": "10.1080/09377255.2021.1947666",
      "isi_id": "WOS:000670097600001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "5",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1048231",
      "authors": "Shah, F. M.; Gaggero, T.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 381533,
      "year": 2021,
      "miur_type": "262",
      "title": "Condition assessment of ship structure using robot assisted 3D-reconstruction",
      "scopus_id": "2-s2.0-85099578385",
      "doi": "10.1080/09377255.2021.1872219",
      "isi_id": "WOS:000610540500001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "9",
      "citations_scopus": "10"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1103775",
      "dc.date.accepted": "2022-12-12",
      "authors": "Poggi, Laura; Gaggero, Tomaso; Gaiotti, Marco; Rizzo, CESARE MARIO; Ravina, Enrico",
      "legacy_id": 447682,
      "year": 2020,
      "miur_type": "285",
      "title": "METODO DI VALIDAZIONE DI TECNOLOGIE ROBOTICHE PER L’ISPEZIONE DI UN AMBIENTE NAVALE",
      "type": "05.01 - Brevetto"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1029015",
      "authors": "Poggi, L.; Rizzo, C. M.; Gaggero, T.; Gaiotti, M.; Ravina, E.",
      "legacy_id": 359270,
      "year": 2020,
      "miur_type": "273",
      "title": "Assessment of ship robotic inspections",
      "scopus_id": "2-s2.0-85093359103",
      "doi": "10.1109/ETFA46521.2020.9211949",
      "isi_id": "WOS:000627406500241",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1035758",
      "authors": "Poggi, L.; Gaggero, T.; Gaiotti, M.; Ravina, E.; Rizzo, C. M.",
      "legacy_id": 367136,
      "year": 2020,
      "miur_type": "262",
      "title": "Recent developments in remote inspections of ship structures",
      "scopus_id": "2-s2.0-85095915080",
      "doi": "10.1016/j.ijnaoe.2020.09.001",
      "isi_id": "WOS:000594417800072",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "23",
      "citations_scopus": "28"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/996515",
      "authors": "Gaiotti, Marco; Zamarin, Albert; Josefson, B. Lennart; Matulja, Tin",
      "legacy_id": 321535,
      "year": 2020,
      "miur_type": "262",
      "title": "A numerical sensitivity analysis on the cohesive parameters of a carbon-steel single lap joint",
      "scopus_id": "2-s2.0-85078107396",
      "doi": "10.1016/j.oceaneng.2019.04.091",
      "isi_id": "WOS:000519658600020",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "12",
      "citations_scopus": "15"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1029011",
      "authors": "Barsotti, B.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 359266,
      "year": 2020,
      "miur_type": "262",
      "title": "Recent Industrial Developments of Marine Composites Limit States and Design Approaches on Strength",
      "scopus_id": "2-s2.0-85092354518",
      "doi": "10.1007/s11804-020-00171-1",
      "isi_id": "WOS:000576370400002",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "29",
      "citations_scopus": "34"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/997521",
      "authors": "Poggi, L.; Gaggero, T.; Gaiotti, M.; Ravina, E.; Rizzo, C. M.",
      "legacy_id": 322610,
      "year": 2019,
      "miur_type": "262",
      "title": "Ispezione robotizzata di strutture navali",
      "type": "01.01 - Articolo su rivista"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/984719",
      "authors": "Gaggero, T.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 308016,
      "year": 2019,
      "miur_type": "262",
      "title": "Uncertainties estimates of hull girder still water loads of bulk and dry cargo ships through Monte Carlo simulations",
      "scopus_id": "2-s2.0-85074454172",
      "doi": "10.1016/j.marstruc.2019.102688",
      "isi_id": "WOS:000513992900001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "4",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/997321",
      "authors": "Ghelardi, S.; Conti, C.; Gaiotti, M.; Rizzo, C. M.; Paci, M.",
      "legacy_id": 322380,
      "year": 2019,
      "miur_type": "262",
      "title": "Scantling assessment of large yacht rigs using carbon-fiber and aluminum masts",
      "scopus_id": "2-s2.0-85072723036",
      "doi": "10.1016/j.oceaneng.2019.106480",
      "isi_id": "WOS:000495142800037",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "2",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/997519",
      "authors": "Poggi, L.; Gaggero, T.; Gaiotti, M.; Ravina, E.; Rizzo, C. M.",
      "legacy_id": 322608,
      "year": 2019,
      "miur_type": "273",
      "title": "Robotic inspection of ship structures: how to fill the gap between available technologies and current survey practices?",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/957649",
      "authors": "Gaiotti, M.; Ghelardi, S.; Rizzo, C. M.",
      "legacy_id": 277585,
      "year": 2019,
      "miur_type": "268",
      "title": "Dynamic buckling of composite mast panels of sail ships",
      "scopus_id": "2-s2.0-85068510400",
      "isi_id": "WOS:000565639000046",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "2",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/914764",
      "authors": "Gaggero, Stefano; Gaggero, Tomaso; Gaiotti, Marco; Ghelardi, Stefano; Vernengo, Giuliano; Villa, Diego",
      "legacy_id": 229296,
      "year": 2018,
      "miur_type": "273",
      "title": "Sensitivity analysis of impact loads by CFD solvers for structural FEM computation on ship structures",
      "scopus_id": "2-s2.0-85053478087",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/911998",
      "authors": "Gaiotti, M.; Rizzo, C. M.; Ferrari, N.; Montella, A",
      "legacy_id": 226281,
      "year": 2018,
      "miur_type": "273",
      "title": "Buckling of stiffened panels: an improved linearized approach compared to nonlinear collapse analysis",
      "scopus_id": "2-s2.0-85134054938",
      "isi_id": "WOS:000449723800090",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/893478",
      "authors": "Sabadin, G.; Gaiotti, M.; Rizzo, C. M.; Bassano, A.",
      "legacy_id": 205835,
      "year": 2018,
      "miur_type": "262",
      "title": "Development and validation of a numerical model for the simulation of high velocity impacts on advanced composite armor systems",
      "scopus_id": "2-s2.0-85037327316",
      "doi": "10.1007/s11071-017-3981-4",
      "isi_id": "WOS:000424037200027",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "14",
      "citations_scopus": "18"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/912000",
      "authors": "Gaiotti, Marco; Ravina, Enrico; Rizzo, Cesare M.; Ungaro, Andrea",
      "legacy_id": 226283,
      "year": 2018,
      "miur_type": "262",
      "title": "Testing and simulation of a bolted and bonded joint between steel deck and composite side shell plating of a naval vessel",
      "scopus_id": "2-s2.0-85048422857",
      "doi": "10.1016/j.engstruct.2018.06.008",
      "isi_id": "WOS:000445440300019",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "15",
      "citations_scopus": "18"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/870033",
      "authors": "Lorenzetti, A; Gaiotti, Marco; Ghelardi, Stefano; Rizzo, CESARE MARIO",
      "legacy_id": 180191,
      "year": 2017,
      "miur_type": "273",
      "title": "Reduced finite element models for mast analysis",
      "scopus_id": "2-s2.0-85035042006",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/885746",
      "authors": "Gaggero, Tomaso; Gaiotti, Marco; Rizzo, Cesare Mario",
      "legacy_id": 197007,
      "year": 2017,
      "miur_type": "262",
      "title": "Effects of uncertainties in loading conditions of bulk carriers on hull girder still water loads",
      "scopus_id": "2-s2.0-85030458085",
      "doi": "10.1016/j.marstruc.2017.06.001",
      "isi_id": "WOS:000406728800012",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "5",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/885751",
      "authors": "Maggiani, G.; Boote, D.; Gaggero, T.; Gaiotti, M.; Rizzo, C. M.",
      "legacy_id": 197013,
      "year": 2017,
      "miur_type": "273",
      "title": "Calibration of the cohesive parameters of fiberglass reinforced plastic plates with an embedded delamination by experiments",
      "scopus_id": "2-s2.0-85038925874",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/870035",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO; Berto, F.",
      "legacy_id": 180193,
      "year": 2017,
      "miur_type": "273",
      "title": "Assessment of welded joints by SED approach accounting for misalignments and geometrical imperfections",
      "scopus_id": "2-s2.0-85031945055",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/885755",
      "authors": "Gaiotti, Marco; Ravina, Enrico; Rizzo, Cesare M.; Ungaro, Andrea",
      "legacy_id": 197017,
      "year": 2017,
      "miur_type": "273",
      "title": "Prova in grande scala e verifiche strutturali di un giunto scafo-sovrastruttura incollato e bullonato (Large scale test fo a bolted/bonded joint)",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/840071",
      "authors": "Gaiotti, Marco; Fujikubo, M.; Grasso, Nicola; Rizzo, CESARE MARIO",
      "legacy_id": 147038,
      "year": 2016,
      "miur_type": "262",
      "title": "Effect of shear stresses onto the hull girder ultimate strength of a containership",
      "scopus_id": "2-s2.0-84976550310",
      "type": "01.01 - Articolo su rivista",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/858157",
      "authors": "Gaiotti, Marco; Nebbia, Giulia; Rizzo, CESARE MARIO; Caleo, A.",
      "legacy_id": 167057,
      "year": 2016,
      "miur_type": "262",
      "title": "Structural behaviour of yacht fillers",
      "scopus_id": "2-s2.0-85046357953",
      "doi": "10.3940/rina.ijsct.2016.b2.197",
      "type": "01.01 - Articolo su rivista",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/840072",
      "authors": "Bacoccoli, R.; Fujikubo, M.; Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 147039,
      "year": 2016,
      "miur_type": "273",
      "title": "Effect of combined shear stresses on the ultimate axial response of the double bottom of a containership",
      "scopus_id": "2-s2.0-84996538307",
      "isi_id": "WOS:000393091200041",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/809950",
      "authors": "Godani, M.; Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 112814,
      "year": 2015,
      "miur_type": "273",
      "title": "Influence of air inclusions on the marine composites inter-laminar shear strength",
      "scopus_id": "2-s2.0-84944686137",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/809951",
      "authors": "Fujikubo, Masahiko; Gaiotti, Marco; Grasso, Nicola; Rizzo, CESARE MARIO",
      "legacy_id": 112815,
      "year": 2015,
      "miur_type": "273",
      "title": "Effect of shear stresses onto the hull girder ultimate strength of a containership",
      "scopus_id": "2-s2.0-84944685240",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/812696",
      "authors": "Nebbia, Giulia; Gaiotti, Marco; Rizzo, CESARE MARIO; Caleo, A.; Ivaldi, A.",
      "legacy_id": 116631,
      "year": 2015,
      "miur_type": "273",
      "title": "Mechanical behavior of fillers: tests and comparisons",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/840068",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO; Rizzuto, E.; Vernengo, Giuliano",
      "legacy_id": 147035,
      "year": 2015,
      "miur_type": "262",
      "title": "Material Selection for the Gas Containment System of a Compressed Natural Gas Carrier Fleet",
      "scopus_id": "2-s2.0-84950279126",
      "doi": "10.1016/j.apor.2015.11.005",
      "isi_id": "WOS:000370898400003",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "3",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/809020",
      "authors": "G., Nebbia; Rizzo, CESARE MARIO; Gaiotti, Marco; A., Caleo",
      "legacy_id": 110104,
      "year": 2015,
      "miur_type": "268",
      "title": "Mechanical characterization of yachts and pleasure crafts fillers",
      "scopus_id": "2-s2.0-84942133848",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "5"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/690990",
      "authors": "Ghelardi, S.; Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 10511,
      "year": 2015,
      "miur_type": "262",
      "title": "On the shear lag effective breadth concept for composite hull structures",
      "scopus_id": "2-s2.0-84931007067",
      "doi": "10.1080/17445302.2014.887172",
      "isi_id": "WOS:000356364400006",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "1",
      "citations_scopus": "5"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/690991",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 10512,
      "year": 2015,
      "miur_type": "262",
      "title": "Dynamic buckling of masts of large sail ships",
      "scopus_id": "2-s2.0-84931005847",
      "doi": "10.1080/17445302.2014.887175",
      "isi_id": "WOS:000356364400007",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "4",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/721183",
      "authors": "Tomaso, E.; Gaiotti, Marco; Risso, G.; Rizzo, CESARE MARIO",
      "legacy_id": 103548,
      "year": 2014,
      "miur_type": "268",
      "title": "Numerical Simulation Strategies of Single Lap Joints",
      "scopus_id": "2-s2.0-84906919672",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/809017",
      "authors": "G., Sabadin; Gaiotti, Marco; Rizzo, CESARE MARIO; A., Bassano",
      "legacy_id": 110101,
      "year": 2014,
      "miur_type": "268",
      "title": "Optimization of the ballistic properties of an Advanced Composite Armor system: Analysis and validation of numerical models subject to high velocity impacts",
      "scopus_id": "2-s2.0-84983580369",
      "isi_id": "WOS:000380506300049",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "1",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/628591",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO; Branner, K.; Berring, P.",
      "legacy_id": 98971,
      "year": 2014,
      "miur_type": "262",
      "title": "An high order Mixed Interpolation Tensorial Components (MITC) shell element approach for delaminated composite modeling",
      "scopus_id": "2-s2.0-84893025184",
      "doi": "10.1016/j.compstruct.2013.10.003",
      "isi_id": "WOS:000329881500062",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "18",
      "citations_scopus": "22"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/690989",
      "authors": "M., Godani; Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 101173,
      "year": 2014,
      "miur_type": "262",
      "title": "Interlaminar shear strength of marine composite laminates: Tests and numerical simulations",
      "scopus_id": "2-s2.0-84898828190",
      "doi": "10.1016/j.compstruct.2014.02.013",
      "isi_id": "WOS:000336345500011",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "14",
      "citations_scopus": "21"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/558518",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 96882,
      "year": 2013,
      "miur_type": "262",
      "title": "Finite element modeling strategies for sandwich composite laminates under compressive loading",
      "scopus_id": "2-s2.0-84874913673",
      "doi": "10.1016/j.oceaneng.2013.01.031",
      "isi_id": "WOS:000318323400006",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "16",
      "citations_scopus": "23"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/570520",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO; Branner, K.; Berring, P.",
      "legacy_id": 97163,
      "year": 2013,
      "miur_type": "268",
      "title": "Calibration of a finite element composite delamination model by experiments",
      "scopus_id": "2-s2.0-84874498011",
      "isi_id": "WOS:000328198800043",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "1",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/386901",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 82801,
      "year": 2012,
      "miur_type": "273",
      "title": "Comportamento ad instabiltà di pannelli sandwich costruiti mediante differente metodo produttivo: hand layup ed infusione, e relativa modellazione numerica",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/230133",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 35288,
      "year": 2012,
      "miur_type": "262",
      "title": "An analytical / numerical study on buckling behaviour of typical composite top hat stiffened panels",
      "scopus_id": "2-s2.0-84860338143",
      "doi": "10.1080/17445302.2010.505370",
      "isi_id": "WOS:000303589700004",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "11",
      "citations_scopus": "14"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/276077",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 55391,
      "year": 2011,
      "miur_type": "262",
      "title": "Resistenza a compressione di pannelli sandwich per la costruzione navale: modelli numerici e prove sperimentali",
      "type": "01.01 - Articolo su rivista"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/276493",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO; Branner, K.; Berring, P.",
      "legacy_id": 55660,
      "year": 2011,
      "miur_type": "268",
      "title": "Finite elements modeling of delaminations in composite laminates",
      "scopus_id": "2-s2.0-84860788878",
      "isi_id": "WOS:000391811000015",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "2",
      "citations_scopus": "9"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/315098",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 69708,
      "year": 2011,
      "miur_type": "268",
      "title": "Buckling behavior of FRP sandwich panels made by hand layupand vacuum bag infusion procedure",
      "scopus_id": "2-s2.0-84896832152",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "6"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/276491",
      "authors": "Branner, K.; Berring, P.; Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 55658,
      "year": 2011,
      "miur_type": "273",
      "title": "Comparison of two finite element methods with experiments of delaminated composite panels",
      "scopus_id": "2-s2.0-84875938149",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "5"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/241605",
      "authors": "Gaiotti, Marco; Rizzo, CESARE MARIO",
      "legacy_id": 42104,
      "year": 2009,
      "miur_type": "273",
      "title": "An experimental/numerical study on bending behaviour of composite sandwich panels",
      "type": "04.01 - Contributo in atti di convegno"
    }
  ],
  "retrieved_at": "2025-11-14T15:14:05.598773"
}