{
  "surname": "Martelli",
  "name": "Michele",
  "unit": "NAV",
  "email": "michele.martelli@unige.it",
  "phone": "",
  "page": "https://rubrica.unige.it/personale/V0RDXFxp",
  "website": "",
  "unige_id": "274760",
  "scopus_id": "55521641400",
  "role": "Professore associato",
  "grade": "Prof.Associato Legge 240/10 - t.pieno - classe 2",
  "ssd": "IIND-01/B (Costruzioni e impianti navali)",
  "location": [
    {
      "building": "Villa Cambiaso - padiglioni (ED_161450103)",
      "floor": "1° piano",
      "room": "US_161450103.I.036"
    }
  ],
  "career": [
    {
      "role": "CB",
      "from": "2012-11-29 00:00:00.0000000",
      "to": "2014-05-30 00:00:00.0000000"
    },
    {
      "role": "AR",
      "from": "2013-01-02 00:00:00.0000000",
      "to": "2015-01-01 00:00:00.0000000"
    },
    {
      "role": "RD",
      "from": "2015-01-02 00:00:00.0000000",
      "to": "2019-11-29 00:00:00.0000000"
    },
    {
      "role": "PA",
      "from": "2019-11-30 00:00:00.0000000",
      "to": "2222-02-02 00:00:00.0000000"
    }
  ],
  "responsibilities": [],
  "teaching": {
    "2025": [
      {
        "course": "IMPIANTI NAVALI B (56992)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "IMPIANTI DI PROPULSIONE NAVALE (108719)",
        "degree": "LM-34 - INGEGNERIA NAVALE"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2024": [
      {
        "course": "IMPIANTI DI PROPULSIONE NAVALE (108719)",
        "degree": "LM-34 - INGEGNERIA NAVALE"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2023": [
      {
        "course": "IMPIANTI NAVALI A (66131)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "IMPIANTI DI PROPULSIONE NAVALE (108719)",
        "degree": "LM-34 - INGEGNERIA NAVALE"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2022": [
      {
        "course": "IMPIANTI NAVALI A (66131)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "IMPIANTI DI PROPULSIONE NAVALE (66114)",
        "degree": "LM-34 - INGEGNERIA NAVALE"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2021": [
      {
        "course": "IMPIANTI NAVALI A (66131)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "IMPIANTI DI PROPULSIONE NAVALE (66114)",
        "degree": "LM-34 - INGEGNERIA NAVALE"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ],
    "2020": [
      {
        "course": "IMPIANTI NAVALI A (66131)",
        "degree": "L-9 - INGEGNERIA NAUTICA"
      },
      {
        "course": "IMPIANTI DI PROPULSIONE NAVALE (66114)",
        "degree": "LM-34 - INGEGNERIA NAVALE"
      },
      {
        "course": "SHIP PROPULSION PLANTS (66288)",
        "degree": "LM-34 - YACHT DESIGN"
      }
    ]
  },
  "scopus_metrics": [
    {
      "period": "absolute",
      "hindex": 19,
      "total_products": 79,
      "journals": 36,
      "conferences": 37,
      "citations": 1097,
      "start": 1900,
      "end": 2025
    },
    {
      "period": "15 years (2010-2025)",
      "hindex": 19,
      "total_products": 79,
      "journals": 36,
      "conferences": 37,
      "citations": 1097,
      "start": 2010,
      "end": 2025
    },
    {
      "period": "10 years (2015-2025)",
      "hindex": 16,
      "total_products": 68,
      "journals": 33,
      "conferences": 31,
      "citations": 893,
      "start": 2015,
      "end": 2025
    },
    {
      "period": "05 years (2020-2025)",
      "hindex": 11,
      "total_products": 44,
      "journals": 23,
      "conferences": 18,
      "citations": 398,
      "start": 2020,
      "end": 2025
    }
  ],
  "scopus_products": [
    {
      "scopus_id": "2-s2.0-105012265713",
      "title": "Human detection in marine disaster search and rescue scenario: a multi-modal early fusion approach",
      "doi": "10.1016/j.oceaneng.2025.122341",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": "340",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Ponzini Filippo; Van Hamme David; Martelli Michele",
      "author_ids": "58576469000;25723895200;55521641400",
      "authorAffiliationIds": "60025153;60033316;60025153",
      "corresponding": "Ponzini F.",
      "keywords": "LiDAR | Marine autonomous surface ship | Search and rescue | Situational awareness | Thermal camera",
      "abstract": "Marine disasters pose significant risks to both victims and rescuers, often occurring in challenging conditions. To address this, we propose a robust perception system for human-in-water search and rescue, leveraging early fusion of thermal imaging and LiDAR data. The system employs the YOLOv8 deep neural network to detect and classify survivors from multi-source images, maintaining high reliability even in adverse environments. The framework has been designed, implemented, and evaluated on a newly collected real-world dataset, specifically created for this application. Additional data augmentation simulates harsh operational and environmental conditions to enhance robustness. Performance was assessed in terms of detection accuracy and computational efficiency. The proposed multi-sensor approach achieved a precision of 93.5 % and a recall of 94.2 %, outperforming single-sensor models and demonstrating superior generalization in complex scenarios. Additionally, it reduces computational cost by approximately 64 % compared to a late fusion strategy, supporting efficient real-time processing. These results confirm that the proposed system significantly improves perception capabilities while meeting real-time constraints, making it suitable for deployment in time-critical maritime rescue operations. By integrating autonomous sensing and intelligent processing, this work contributes to safer and more effective search and rescue missions at sea.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105016151432",
      "title": "Digital Technologies Can Modify the Decision-Making Process on Ship Bridges",
      "doi": "10.3233/PMST250094",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": "10",
      "issue_id": null,
      "pages": "793-801",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Martelli Michele; Longo Giacomo; Russo Enrico; Zaccone Raphael",
      "author_ids": "55521641400;57468566600;57197855120;56717793100",
      "authorAffiliationIds": "60025153;60121711;60121711;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Autonomous Ship | Collision avoidance | Decision support system | MASS",
      "abstract": "Digital technologies have experienced fast growth over the last year, with unexpected impacts on everyday life. The maritime sector is also positively affected by the introduction of new systems and technologies, especially in ship handling. The main reason behind adopting these technologies is to reduce human error, which could lead to serious accidents with massive repercussions on the safety of life at sea and the marine environment. Evaluating the impact on the bridge team's behaviour and the performance of the manoeuvre is a challenge and will help the future development of more advanced navigation systems. This paper aims to test a decision support system that relies on a path-planning module suitable for collision avoidance using a bridge simulator. A test scenario has been set up to reproduce a familiar coastal navigation scenario where several ships navigate in a narrow area. The goal of the test is to avoid collisions by respecting the COLREG on a foggy day, ensuring the safety distance and returning on track. Experienced masters and inexperienced people have been involved in the testing procedure. All the primary navigation information has been recorded and analysed both qualitatively and quantitatively, adopting dedicated metrics. The results prove that testing in a simulation environment can provide a valid test case and show that inexperienced personnel can also perform a safe escape route in compliance with international regulations.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105002009151",
      "title": "LiDAR target detection and classification for ship situational awareness: A hybrid learning approach",
      "doi": "10.1016/j.apor.2025.104552",
      "venue": "Applied Ocean Research",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": "158",
      "issue_id": null,
      "pages": null,
      "issn": "01411187",
      "eIssn": null,
      "source_id": "26776",
      "authors": "Ponzini Filippo; Zaccone Raphael; Martelli Michele",
      "author_ids": "58576469000;56717793100;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Ponzini F.",
      "keywords": "LiDAR | Marine Autonomous Surface Ships | Marine situational awareness | Navigation system | Obstacle classification | Obstacle detection",
      "abstract": "In recent years, LiDARs have been used to enhance situational awareness of autonomous vehicles, including in the marine domain, driven by the need for reliable detections in Marine Autonomous Surface Ships and Unmanned Surface Vehicles. Detecting obstacles and targets within point clouds is generally handled by a fully unsupervised learning framework. While effective and simple, this approach cannot classify targets. This paper presents a combined unsupervised/supervised approach for detecting and classifying marine targets and obstacles. The unsupervised detection framework is maintained by incorporating a lightweight supervised module capable of classifying detection outputs without disrupting the workflow. Rather than training on the entire point cloud, the proposed method focuses on selected target features, reducing model size and information exchange. Specifically, a Random Forest Classifier is trained on features extracted from the point-cloud dataset. The acquisition of an ad-hoc training dataset and its statistical analysis are presented to identify key features. The selection, training, and validation processes are outlined. Finally, the supervised model is integrated into a state-of-the-art unsupervised LiDAR detection pipeline and tested in a real scenario. The results demonstrate the hybrid framework's effectiveness and compliance with real-time constraints.",
      "citations": 5,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 15,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105012467146",
      "title": "Model Identification, Dynamic Positioning, and Thrust Allocation System for the milliAmpere1 Autonomous Ferry Prototype: Field Trial Results",
      "doi": "10.1109/ACCESS.2025.3593251",
      "venue": "IEEE Access",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": "13",
      "issue_id": null,
      "pages": "133609-133634",
      "issn": null,
      "eIssn": "21693536",
      "source_id": "21100374601",
      "authors": "Hinostroza Miguel; Fruzzetti Camilla; Gudahl Tufte Andreas; Lexau Simon J.N.; Gusev Alexey; Eide Egil; Brekke Edmund F.; Lekkas Anastasios M.; Skjetne Roger; Martelli Michele; Breivik Morten",
      "author_ids": "56017701600;57427556800;60029276200;59460184200;59959538000;7004958403;25031502300;6505747533;6602785213;55521641400;56206241300",
      "authorAffiliationIds": "60013141;60025153;60013141;60013141;60013141;60013141;60013141;60013141;60013141;60025153;60013141",
      "corresponding": "Hinostroza M.",
      "keywords": "dynamic positioning control | full-scale experiments | Maritime autonomous surface ships | ship model identification | thrust allocation | urban electrical ferry",
      "abstract": "Autonomous electric ferries offer an eco-friendly solution for sustainable and intelligent urban mobility. Currently, these ferries are undergoing successful trial operations on short routes for passenger transportation in European and Scandinavian cities. This paper presents experimental results on model identification, thrust allocation (TA), and dynamic positioning (DP) system for the milliAmpere1 (mA1) autonomous electric ferry prototype. The mA1 is a small prototype ferry used as a test platform in several research projects at the Norwegian University of Science and Technology (NTNU). It recently went through a system upgrade and is now equipped with four symmetrically distributed azimuth thrusters. These new systems require a new mathematical model and a reliable DP and TA system to enable autonomous operation. The DP system is responsible for calculating the total force and moment required to keep position or move between waypoints. At the same time, the TA algorithm coordinates the thrusters to ensure that the resulting force they generate matches the request from the DP control algorithm. The DP is designed with a horizontal plane control law, using a feedforward plus feedback control. The TA is formulated as a quadratic programming problem, which includes cost functions for power consumption. A third-order reference guidance system is implemented to ensure smooth and continuous signals for the DP desired position, velocity, and acceleration. Additionally, system model identification was performed to determine the parameters of the actuator dynamics. Full-scale trials were conducted to evaluate the performance of the proposed system in a sheltered basin situated in Trondheim, Norway, under low-wind conditions. The field trial results indicate that the proposed approach successfully stabilized and maintained a desired trajectory.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 88,
              "rank": 42,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 83,
              "rank": 41,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 78,
              "rank": 101,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85210284265",
      "title": "Time Domain Design of a Marine Target Tracking System Accounting for Environmental Disturbances",
      "doi": "10.3390/jmse12112058",
      "venue": "Journal of Marine Science and Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "12",
      "issue_id": "11",
      "pages": null,
      "issn": null,
      "eIssn": "20771312",
      "source_id": "21100830140",
      "authors": "Fruzzetti Camilla; Buzzurro Cristiana; Donnarumma Silvia; Martelli Michele",
      "author_ids": "57427556800;59426737200;55350308600;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Fruzzetti C.",
      "keywords": "environmental disturbances | marine autonomous surface ship | target tracking",
      "abstract": "Environmental disturbances represent significant challenges to the performance and accuracy of autonomous systems, especially in marine environments, where their impact varies based on disturbance severity and the employed guidance law. This paper comprehensively investigates a marine target tracking system using time-domain simulations incorporating realistic environmental disturbances. Three guidance laws and four key performance indicators are analysed to evaluate system performance under disturbed and ideal conditions. A robust and systematic evaluation pipeline is developed and applied to a case study featuring a scaled tugboat model. This approach provides a reliable method to assess tracking accuracy and robustness in adverse conditions. The results are selected from a wide range of possibilities to show the effect of the disturbances on the selected target tracking motion control scenario with two manoeuvres and two environmental conditions. The results are measured through the selected key performance indicators, and several phases are identified for each manoeuvre to extend the analysis not only to the global KPI values but also to the partial values of defined phases. They reveal the quantitative effects of environmental disturbances, exposing different system behaviours and trends. These findings demonstrate the effectiveness of the proposed pipeline in quantifying tracking system performance, delivering useful understandings of the system under environmental disturbances. The broader implications of this study are substantial, offering enhanced predictive accuracy for the performance of the analysed systems, particularly in the context of target tracking. Furthermore, introducing numerical key performance indicators facilitates a more rigorous comparison of different system characteristics, enabling informed decisions in designing and optimising autonomous operations in challenging environments.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 75,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 73,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 72,
              "rank": 77,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 74,
              "rank": 30,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 71,
              "rank": 116,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 68,
              "rank": 87,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85182953922",
      "title": "Multiphysics Modeling and Simulation of Integrated Electric Propulsion System for Ship Dynamic Positioning",
      "doi": "10.1109/TIA.2024.3355869",
      "venue": "IEEE Transactions on Industry Applications",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "60",
      "issue_id": "3",
      "pages": "4958-4967",
      "issn": "00939994",
      "eIssn": "19399367",
      "source_id": "17361",
      "authors": "Donnarumma Silvia; Martelli Michele; D'Agostino Fabio; Kaza Daniele; Silvestro Federico",
      "author_ids": "55350308600;55521641400;56553864200;57218924925;23026343700",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Donnarumma S.",
      "keywords": "Dynamic positioning | electric propulsion | frequency regulation | multiphysics modeling",
      "abstract": "The article presents a multiphysics modelling approach to design an integrated electric propulsion system for ship dynamic positioning purposes. The simulation platform integrates the model of the shipboard power plant, the hydrodynamic and environmental forces and the dynamic positioning controller. The shipboard power system has been modelled considering the electro-mechanical behaviour, i.e. the power-frequency dynamic, so that the platform can run in real time and be linked with the control hardware. The simulation platform has been tested through a detailed simulation campaign by using as a study case a Platform Supply Vessel where its behaviour in harsh conditions has been validated. Moreover, a control hardware-in-the-loop configuration has been realized, where the controller logic has been implemented in a real PCL. Finally, a comparison between the two simulation approaches is shown and the results are discussed.",
      "citations": 4,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Control and Systems Engineering",
              "percentile": 90,
              "rank": 38,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 89,
              "rank": 102,
              "quartile": "Q1"
            },
            {
              "subject": "Industrial and Manufacturing Engineering",
              "percentile": 88,
              "rank": 49,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 89,
              "rank": 99,
              "quartile": "Q1"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 88,
              "rank": 43,
              "quartile": "Q1"
            },
            {
              "subject": "Industrial and Manufacturing Engineering",
              "percentile": 87,
              "rank": 52,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85175652778",
      "title": "Probabilistic operability and greenhouse gas assessment during dynamic positioning operations",
      "doi": "10.1177/14750902231203441",
      "venue": "Proceedings of the Institution of Mechanical Engineers Part M Journal of Engineering for the Maritime Environment",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "238",
      "issue_id": "2",
      "pages": "336-347",
      "issn": "14750902",
      "eIssn": "20413084",
      "source_id": "25596",
      "authors": "Fruzzetti Camilla; Donnarumma Silvia; Maggiani Francesca; Martelli Michele",
      "author_ids": "57427556800;55350308600;58042017600;55521641400",
      "authorAffiliationIds": "60025153;60025153;60211436;60025153",
      "corresponding": "Fruzzetti C.",
      "keywords": "Dynamic positioning | electric propulsion | environmental disturbances | GHG emissions | operability assessment | optimized allocation | scatter diagram analysis | station keeping capability",
      "abstract": "A Dynamic Positioning system automatically maintains both the position and heading of a vessel by using its thrusters in the presence of external disturbances. This goal is ensured by a controller that compensates for the environmental disturbances and computes the proper set-points for each actuator. The core of such a system is composed of force and thrust allocation modules that tailor the required forces and moment over the available actuators. The propulsion systems used are often over-actuated and the thrust allocation algorithm implies an infinite number of solutions since it is impossible to solve analytically the problem. Over the years efforts from the research community dealt with the optimization in terms of accuracy, energy consumption, and maintenance with innovative allocation strategies were investigated. However, no publications or rules indicate the procedure for the evaluation of exhaust gas emission during dynamic positioning operations. For such a reason, the paper aims to develop an optimization procedure that includes an ad-hoc objective function with relative non-linear constraints for the thrust allocation logic that tends to minimize the actuators’ thrust. The procedure accounts for non-linear hydrodynamic effects on the thrust generation, including thruster-thruster and thruster-hull interactions, to obtain the most realistic results as possible. Moreover, following the IMO suggestions, the production of greenhouses gases emissions is evaluated in probabilistic terms. The proposed approach provides indicators in terms of yearly operability, fuel consumption, and environmental footprint during dynamic positioning operations that could be used for proper decisions in ship deployment.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 68,
              "rank": 37,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 66,
              "rank": 249,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 72,
              "rank": 32,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 67,
              "rank": 238,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85210105149",
      "title": "A structured metric approach to compare marine collision avoidance algorithms",
      "doi": "10.24868/11143",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Zaccone R.; Donnarumma S.; Martelli M.",
      "author_ids": "56717793100;55350308600;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": "Autonomous Navigation | COLREG | MASS | Path Planning | Simulation",
      "abstract": "The rapid advancement of technologies enabling autonomous ship capabilities has outpaced the development of corresponding legislative and regulatory frameworks, creating a bottleneck in the global application of autonomous ships as defined by the four MASS degrees of autonomy. A significant issue is the absence of a well-defined process for certifying new algorithms and systems to be installed on board. Recently, a reliable, open-access structured set of scenarios, including several challenging COLREG encounter situations, has been published, intended for testing the numerous path-planning algorithms developed over the years. When connected to the testing framework, the modules must accomplish two primary tasks: determining the applicable COLREG rules (COLREG classification) and computing an evasive route. This paper focuses on defining an approach to evaluate the performance of collision avoidance algorithms through dedicated metrics. These metrics are formulated to quantitatively compare escape manoeuvres according to relevant performance indexes, helping a human-based compliance evaluation assess COLREG adherence. The operation of the comparison metrics is demonstrated by testing an existing collision avoidance algorithm developed by the authors. This demonstration underscores the effectiveness of the analyzed algorithms in efficiently managing the challenging scenarios proposed in the literature. Finally, the paper provides valuable suggestions for modifying and improving the testing scenarios to enhance the robustness of the comparison metrics.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 11,
              "rank": 860,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 7,
              "rank": 348,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 4,
              "rank": 178,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85200733361",
      "title": "Ship Collision detection and classification employing AIS data",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": "1",
      "issue_id": null,
      "pages": "3359-3363",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Martelli Michele; Žuškin Srdan; Cellerino Elena; Zaccone Raphael",
      "author_ids": "55521641400;55808104300;59251623400;56717793100",
      "authorAffiliationIds": "60025153;60271610;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "AIS data | Autonomous navigation | Collision avoidance | Collision risk | COLREG",
      "abstract": "Currently, a dramatic evolution of the decision support systems for the maritime field is experienced by both academia and the major industrial stakeholders investing in researching new approaches to prevent a collision at sea. The primary motivation is to reduce the number of preventable accidents to safeguard life at sea and to preserve the fragile marine environment. For such a reason, the authors propose an approach to early detect the risk of collision at sea based on the AIS (Automatic Identification System) data in coastal areas. Although RADAR (RAdio Detection And Ranging) is primarily used for collision avoidance, this paper additionally suggests the use of AIS for the early detection of DSS (Decision Support System). AIS is selected among the available sources of information nowadays since it is widely used, as it is mandatory for commercial and navy ships and optional for other surface vehicles. In the last years, even if not required, more and more yachts, boats, and sailing boats have voluntarily installed AIS transmitters and/or receivers. The collision detection is formalised with simple but effective mathematical formulations and provides the primary navigational information and the expected COLREG (Collision Regulations) scenario. The approach is tested and quantitatively validated in batch mode, with field data also allowing for a qualitative analysis of the master's behaviour. Moreover, some statistics concerning the different scenario occurrences are reported to identify the most probable situations better. The results show that it is possible to detect the risk of collision automatically based on AIS data, even in closed range and even with GPS accuracy. The outcomes of the detection modules can be used as the input for collision avoidance path planning as a future step toward marine autonomous navigation.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 14,
              "rank": 98,
              "quartile": "Q4"
            },
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 11,
              "rank": 266,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 10,
              "rank": 646,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85200538613",
      "title": "Model-Based Motion Control Design for the Milliampere1 Prototype Ferry",
      "doi": "10.23919/ECC64448.2024.10591071",
      "venue": "2024 European Control Conference Ecc 2024",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "3636-3643",
      "issn": null,
      "eIssn": null,
      "source_id": "21101240865",
      "authors": "Fruzzetti Camilla; Martelli Michele; Lekkas Anastasios; Skjetne Roger; Breivik Morten",
      "author_ids": "57427556800;55521641400;6505747533;6602785213;56206241300",
      "authorAffiliationIds": "60025153;60025153;60013141;60013141;60013141",
      "corresponding": "Fruzzetti C.",
      "keywords": null,
      "abstract": "Following the recent upgrade of the propulsion plant configuration for the milliAmpere1 passenger ferry prototype, a model-based controller pipeline suitable for all the milliAmpere1 speed ranges is proposed and evaluated. Some well-known methods for force allocation and reference model systems are implemented together with a nonlinear model-based motion controller, and a comparison study for different combinations is carried out to define the best solution for this application. Considering low-speed operations, the efficiency of three force allocation solutions and three reference models with two possible thruster configurations are investigated. The resulting controllers are evaluated with five performance metrics. For higher-speed operations, a solution with a reference model and a force allocation is presented and investigated. The controllers have been tested via numerical simulations, and based on the performance metrics, indications for the best design options are provided.",
      "citations": 4,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85192378578",
      "title": "Naval engineering and ship control special edition III",
      "doi": "10.1080/20464177.2024.2345220",
      "venue": "Journal of Marine Engineering and Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "23",
      "issue_id": "3",
      "pages": "155-156",
      "issn": "20464177",
      "eIssn": "20568487",
      "source_id": "21100470126",
      "authors": "Martelli M.; Geertsma R. D.",
      "author_ids": "55521641400;25927874500",
      "authorAffiliationIds": "60025153;60004193-60118236",
      "corresponding": "Martelli M.",
      "keywords": "alternative fuels | autonomous ships | Cybersecurity | iSCSS | ship control system",
      "abstract": "The third Naval Engineering and Ship Control special edition of the Journal of Marine Engineering and Technology aims to present cutting-edge research on naval engineering and ship control, as was presented during the International Naval Engineering Conference and Exhibition (INEC) and the International Ship Control Systems Symposium (iSCSS), held together in Delft in 2022.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 90,
              "rank": 12,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 88,
              "rank": 14,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85180840642",
      "title": "Adversarial waypoint injection attacks on Maritime Autonomous Surface Ships (MASS) collision avoidance systems",
      "doi": "10.1080/20464177.2023.2298521",
      "venue": "Journal of Marine Engineering and Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "23",
      "issue_id": "3",
      "pages": "184-195",
      "issn": "20464177",
      "eIssn": "20568487",
      "source_id": "21100470126",
      "authors": "Longo G.; Martelli M.; Russo E.; Merlo A.; Zaccone R.",
      "author_ids": "57468566600;55521641400;57197855120;15136674200;56717793100",
      "authorAffiliationIds": "60121711;60025153;60121711;130638655;60025153",
      "corresponding": "Longo G.",
      "keywords": "Autonomous ship | collision avoidance | cyber security | data injection attack",
      "abstract": "Autonomous navigation is currently subject to particular interest for naval and commercial vessels. In addition to the regulatory effort, several pieces of research tackled the development of new guidance laws, stable and robust control algorithms, methodologies to increase situational awareness, and collision avoidance algorithms. However, most of these systems blindly trust information from navigation sensors, which can malfunction or, even worse, have their data altered by cyber-attacks. This last scenario will be increasingly common shortly and represents a dangerous threat that future highly computerised ships must face. The proposed work shows an approach capable of hijacking a state-of-the-art collision avoidance algorithm route by feeding it with rogue data. The effects of such a cyber-attack are shown via an extensive simulation campaign, testing the methodology on three different COLREG scenarios: head-on, crossing, and overtaking. The study additionally highlights the susceptibility of forthcoming navigation systems to security breaches, which still needs to be addressed in the existing literature. According to the experimental findings, attackers can attract the autonomous ship guidance toward their objective at a mean distance of (Formula presented.). Finally, suggestions on how to harden these systems against this family of attacks are provided in the conclusion.",
      "citations": 15,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 90,
              "rank": 12,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 88,
              "rank": 14,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85174824987",
      "title": "E-Navigation: A Distributed Decision Support System With Extended Reality for Bridge and Ashore Seafarers",
      "doi": "10.1109/TITS.2023.3311817",
      "venue": "IEEE Transactions on Intelligent Transportation Systems",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2023,
      "volume": "24",
      "issue_id": "11",
      "pages": "13384-13395",
      "issn": "15249050",
      "eIssn": "15580016",
      "source_id": "18378",
      "authors": "Cassara Pietro; Di Summa Maria; Gotta Alberto; Martelli Michele",
      "author_ids": "24767643400;56308716000;9846429300;55521641400",
      "authorAffiliationIds": "60008218-60103966;60021199;60008218;60025153",
      "corresponding": "Cassara P.",
      "keywords": "Autonomous Ship; Extended reality | decision support system | digital twin | maritime IoT-based mobile communications | situation awareness | virtual bridge",
      "abstract": "A distributed decision support system has been developed to assist seafarers during several navigation tasks, for instance, in avoiding a collision with a detected obstacle in the sea and envisioning a future autonomous navigation system. In this paper, the decision support system is based on the results of a customized simulation model representing the ship's behavior, including hydrodynamics, propulsion, and control effects. Sensors monitor and collect the parameters of the environment and the ship onboard. The telemetry and the calculated route are visualized on a wearable visor exploiting augmented reality. Such context information is also replicated ashore through a narrow-band satellite link using an IoT publish-subscribe communication paradigm to allow one or more remote seafarers to supervise the situation in a virtual reality environment. Overall, the potential of the proposed system is presented and discussed for application in the context of autonomous navigation.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Automotive Engineering",
              "percentile": 98,
              "rank": 2,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 98,
              "rank": 15,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 97,
              "rank": 26,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Automotive Engineering",
              "percentile": 98,
              "rank": 3,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 97,
              "rank": 20,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 94,
              "rank": 43,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85171563043",
      "title": "Follow-the-Leader Guidance, Navigation, and Control of Surface Vessels: Design and Experiments",
      "doi": "10.1109/JOE.2023.3292422",
      "venue": "IEEE Journal of Oceanic Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2023,
      "volume": "48",
      "issue_id": "4",
      "pages": "997-1008",
      "issn": "03649059",
      "eIssn": "15581691",
      "source_id": "17277",
      "authors": "Piaggio Benedetto; Garofano Vittorio; Donnarumma Silvia; Alessandri Angelo; Negenborn Rudy; Martelli Michele",
      "author_ids": "57204360929;57210819545;55350308600;7005735677;16480813000;55521641400",
      "authorAffiliationIds": "60025153;60118236;60025153;60025153;60118236;60025153",
      "corresponding": "Piaggio B.",
      "keywords": "Azimuth-drive propulsion | escort tugs | follow-the-leader control | line of sight (LOS) | track keeping",
      "abstract": "A novel follow-the-leader approach for azimuth-driven vessels is devised and experimentally tested in a model-scale outdoor scenario. The vessels are equipped with global navigation satellite and inertial navigation systems. A line-of-sight algorithm ensures the yaw-check ability of the follower vessel along the leader's path, while a speed-regulation allows to track its velocity. Track generation, guidance, navigation, and control modules are designed and assembled to be executed on-board in real time. The results of an outdoor experimental campaign are illustrated to show the effectiveness of the proposed approach.",
      "citations": 5,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 90,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 88,
              "rank": 88,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 86,
              "rank": 135,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 96,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 92,
              "rank": 54,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 87,
              "rank": 101,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85163694623",
      "title": "A COLREGs-Compliant Decision Support Tool to Prevent Collisions at Sea",
      "doi": "10.12716/1001.17.02.11",
      "venue": "Transnav",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2023,
      "volume": "17",
      "issue_id": "2",
      "pages": "347-353",
      "issn": "20836473",
      "eIssn": "20836481",
      "source_id": "21100914186",
      "authors": "Martelli M.; Žuškin S.; Zaccone R.; Rudan I.",
      "author_ids": "55521641400;55808104300;56717793100;7007138278",
      "authorAffiliationIds": "60025153;60029546;60025153;60029546",
      "corresponding": "Martelli M.",
      "keywords": null,
      "abstract": "Groundings and collisions still represent the highest percentage of marine accidents despite the current attention on Maritime Education and Training and the improvement of sensor capability. Most of the time, a collision is caused by a human error with consequences ranging from moderate to severe, with a substantial impact on both environment and life safeguarded at sea. In this paper, a brief statistical data regarding human element as a root cause of marine incidents together with collision regulations misunderstanding is presented as a background chapter. Furthermore, the present work discusses a decision support system architecture to suggest an appropriate action when the risk of a potential collision is detected. The proposed architecture system is based on various modules integrated with proper sensor input data regarding the surrounding navigation area. As a result, the tool can support the Officers of Watch in the decision‐making process providing an early suggestion in compliance with the COLlision REGulations. The proposed system is intended to be used onboard independently from the degree of automation of the ship, and it is based on AIS, which is mandatory, making it widely applicable. The proper use of the system can considerably reduce the number of collisions, as demonstrated by the obtained results.",
      "citations": 9,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 35,
              "rank": 75,
              "quartile": "Q3"
            },
            {
              "subject": "Oceanography",
              "percentile": 34,
              "rank": 100,
              "quartile": "Q3"
            },
            {
              "subject": "Transportation",
              "percentile": 23,
              "rank": 121,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 31,
              "rank": 72,
              "quartile": "Q3"
            },
            {
              "subject": "Oceanography",
              "percentile": 21,
              "rank": 115,
              "quartile": "Q4"
            },
            {
              "subject": "Transportation",
              "percentile": 20,
              "rank": 112,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85179626443",
      "title": "Interaction between COLREG-compliant collision avoidance systems in a multiple MASS scenario",
      "doi": "10.1088/1742-6596/2618/1/012006",
      "venue": "Journal of Physics Conference Series",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": "2618",
      "issue_id": "1",
      "pages": null,
      "issn": "17426588",
      "eIssn": "17426596",
      "source_id": "130053",
      "authors": "Zaccone R.; Martelli M.",
      "author_ids": "56717793100;55521641400",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": null,
      "abstract": "The transportation systems are heading towards increasing autonomy in all domains, and the maritime field makes no exception. The International Maritime Organization has been working on releasing a regulatory framework for Maritime Autonomous Surface Ships (MASS) to keep pace with the technological developments in the field. Autonomous shipping forces the researcher and the designers to face a wide range of scientific challenges, such as navigation decision support systems, collision avoidance algorithms, path planning, navigation and control, sensor data processing and fusion, remote control, and communication, with the final intent of achieving a fully integrated and autonomous worldwide maritime transportation system, where a human-less collaborative conflict resolution could potentially retire the COLREGs. However, the maritime sector will first face a transition period where traditional ships will share the seas and interact with heterogeneous MASS with various autonomous capabilities featuring different and probably incompatible communication protocols. In such a scenario, the COLREGs will still play a primary role in helping the collision avoidance systems resolve conflicts and limiting the degrees of freedom. This paper aims to study the interaction among multiple vessels with autonomous collision avoidance capabilities operating in a close navigation scenario. The ships operate according to a COLREG-compliant collision avoidance algorithm. The paper relies on numerical simulation to systematically investigate different scenarios in which autonomous vessels operate and interact in the presence of fixed obstacles. Results are presented and critically discussed.",
      "citations": 6,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Physics and Astronomy (all)",
              "percentile": 22,
              "rank": 192,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Physics and Astronomy (all)",
              "percentile": 25,
              "rank": 182,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85179621934",
      "title": "A multi-sensor indoor tracking system for autonomous marine model-scale vehicles",
      "doi": "10.1088/1742-6596/2618/1/012008",
      "venue": "Journal of Physics Conference Series",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": "2618",
      "issue_id": "1",
      "pages": null,
      "issn": "17426588",
      "eIssn": "17426596",
      "source_id": "130053",
      "authors": "Ponzini Filippo; Zaccone Raphael; Martelli Michele",
      "author_ids": "58576469000;56717793100;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Ponzini F.",
      "keywords": null,
      "abstract": "Attitude estimation is a popular topic in marine engineering and robotics; the position and orientation of a vehicle are required as feedback from several control algorithms to improve autonomous navigation capabilities, such as dynamic positioning, track keeping, and autodocking. Typically, position and heading angles are provided by the Global Positioning System and compass. Usually, during the development and testing, the experiments are performed in a controlled environment, such as an indoor test tank. However, Global Positioning System systems can be unreliable due to non-negligible model scale errors or the absence of line-of-sight with the satellites. This article presents an experimental tracking system setup suitable for indoor testing facilities. In particular, the paper presents a tracking system based on a GigE camera and ArUco markers detection and a LiDAR-based tracking system relying on unsupervised machine learning techniques. The MQTT broker-based publish/subscribe message-queuing protocol allows real-time data communication and sharing. The proposed system was developed, installed, and tested in the COMPASS laboratory (University of Genoa). The two tracking systems' outcomes have been compared. Eventually, an accuracy analysis was performed by comparing the results to the ground truth in purpose-built experiments. The proposed approach can estimate the degrees of freedom of a self-propelled model-scale vessel in an indoor testing facility without requiring active or powered markers and share the information acquired with multiple entities in real-time at a high frame rate.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Physics and Astronomy (all)",
              "percentile": 22,
              "rank": 192,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Physics and Astronomy (all)",
              "percentile": 25,
              "rank": 182,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85161671157",
      "title": "Unmanned Surface Vehicle Chase a Moving Target Remotely Controlled",
      "doi": "10.1007/978-3-031-31268-7_14",
      "venue": "Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics",
      "type": "Book Series",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": "13866 LNCS",
      "issue_id": null,
      "pages": "243-254",
      "issn": "03029743",
      "eIssn": "16113349",
      "source_id": "25674",
      "authors": "Fruzzetti Camilla; Martelli Michele",
      "author_ids": "57427556800;55521641400",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Fruzzetti C.",
      "keywords": "Autonomous Surface Vessel | Guidance | Human in the loop | Target tracking",
      "abstract": "Shortly, it is expected to have hybrid marine scenarios in which manned and unmanned vehicles navigate in the same environment. The study of the interactions between autonomous and human-controlled vessels becomes essential to improve and make the control systems more resilient. For such a reason, this paper shows a simulation architecture to test the effectiveness of a guidance law in a target tracking scenario for surface navigation. The guidance logic is based on the idea of reaching and following a target when the future motion is unknown and only the instantaneous position and speed are available. The adopted guidance law can handle both the chasing and the following phases minimising the time needed to reach the chased vehicles. The actuators’ set-point generation is ensured by speed and heading controls, properly developed for this aim. A cyber-physical testing scenario has been developed and can run in real-time. Both target and interceptor dynamics are based on detailed mathematical models in which the parameters have been validated by dedicated tank experiments. An operator remotely controls the target through a human-machine interface and tries to leave behind the autonomously controlled interceptor to make the simulation’s results more realistic. At the end of the paper, the results are reported for investigation and the conclusions are drawn.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Theoretical Computer Science",
              "percentile": 48,
              "rank": 70,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 46,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 48,
              "rank": 121,
              "quartile": "Q3"
            },
            {
              "subject": "Theoretical Computer Science",
              "percentile": 47,
              "rank": 69,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85145613688",
      "title": "Dynamic positioning operability assessment by using thrust allocation optimization",
      "doi": "10.1201/9781003358961-5",
      "venue": "Sustainable Development and Innovations in Marine Technologies Proceedings of the 19th International Congress of the International Maritime Association of the Mediterranean Imam 2022",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": "25-32",
      "issn": null,
      "eIssn": null,
      "source_id": "21101130449",
      "authors": "Fruzzetti C.; Donnarumma S.; Martelli M.; Maggiani F.",
      "author_ids": "57427556800;55350308600;55521641400;58042017600",
      "authorAffiliationIds": "60025153;60025153;60025153;60211436",
      "corresponding": "Fruzzetti C.",
      "keywords": null,
      "abstract": "A Dynamic Positioning system can automatically maintain both the position and heading of a vessel by using its thrusters. The core is composed of force and thrust allocation modules that tailor the required forces and moment to compensate the external forces over the available actuators. The propulsion systems are often over-actuated and, then, it is impossible to solve analytically the thrust allocation algorithm. To address the challenge several methodologies are available, starting from reducing the order of the problem up to operation research techniques. The paper aims to develop an optimisation procedure that includes an ad-hoc objective function with relative non-linear constraints for the thrust allocation logic that tends to minimize the thrust of the actuator. The procedure accounts for non-linear hydrodynamic effects on the thrust generation, including thruster-thruster and thruster-hull interactions. Based on the assumption of equal available power, two different propulsion configurations are investigated in terms of yearly operability.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85141972835",
      "title": "Multi-obstacle detection and tracking algorithms for the marine environment based on unsupervised learning",
      "doi": "10.1016/j.oceaneng.2022.113034",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "266",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Faggioni N.; Ponzini F.; Martelli M.",
      "author_ids": "57205353851;58576469000;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Faggioni N.",
      "keywords": "Collision avoidance | Experimental trials | LiDAR point cloud | Multi-object tracking | Unsupervised learning",
      "abstract": "Nowadays, more than in the past, research is focused on the study and development of enabling technologies to achieve the goal of autonomous navigation. The investigations cover all industrial fields: automotive, aerospace, and maritime. The first level to be developed to achieve the goal of autonomous vehicles is obstacle detection and consecutively object tracking in real-time. The most important results were obtained in the automotive sector, where the available financial resources are more significant than the others. Indeed, several methods based on trained neural networks are used to detect the obstacles. Usually, the neural networks are trained by using large datasets of LiDAR point clouds and images. Unfortunately, it is impossible to emulate this approach in the marine sector because there are no large datasets for training a neural network. For such a reason, this paper aims to present multi-object tracking based on unsupervised learning. The proposed method is tailored for the challenging marine environment, and it is suitable for the detection and tracking of both fixed and moving obstacles. This paper presents a low-computational method for multi-object tracking based on unsupervised learning, and it is discussed and analysed step by step, indicating the pros and weaknesses. Moreover, the tracking has been tested on both experimental LiDAR point clouds and virtual LiDAR point clouds created employing a tailored virtual scenario. The results are reported and discussed.",
      "citations": 15,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 16,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85144952640",
      "title": "A Review of Ship-to-Ship Interactions in Calm Waters",
      "doi": "10.3390/jmse10121856",
      "venue": "Journal of Marine Science and Engineering",
      "type": "Journal",
      "sub_type": "Review",
      "year": 2022,
      "volume": "10",
      "issue_id": "12",
      "pages": null,
      "issn": null,
      "eIssn": "20771312",
      "source_id": "21100830140",
      "authors": "DeMarco Muscat-Fenech Claire; Sant Tonio; Zheku Vito Vasilis; Villa Diego; Martelli Michele",
      "author_ids": "57221923281;9241517500;58033617300;56250522200;55521641400",
      "authorAffiliationIds": "60072651;60072651;60025153;60025153;60025153",
      "corresponding": "DeMarco Muscat-Fenech C.",
      "keywords": "experimental model interactions | head-to-head encounters | lightering operations | overtaking manoeuvres | RANS solver | ship-to-ship interaction",
      "abstract": "The hydrodynamic interaction between two or more ships in harbours or inland waterways is a classical maritime engineering research area. In ship manoeuvring practice, ship masters try to determine the speed and gap limit when a ship is passing or encountering others, particularly in confined water ways. This requires an accurate prediction of the interaction force acting on both ships. The pioneer experimental studies showed that the interaction could lead to a very large yaw moment and this moment is strongly time-dependent, which could make the ships veer from their original courses, leading to collisions. Based on the findings on experimental measurements, some empirical formulas are proposed in the literature to predict such interaction forces. However, these formulas could provide a satisfactory estimation only when the ship speed is quite high, and the water depth is shallow and constant. Numerical simulation overcomes this issue by simulating the ship-to-ship problem by considering the effect of the 3D ship hull, variable water depth and ship speed. Numerical simulation has now become the most widely adopted method to investigate the ship-to-ship problem. In the present study, the development of the methodologies of ship-to-ship problems will be reviewed, and the research gap and challenges will be summarized.",
      "citations": 10,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 75,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 73,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 72,
              "rank": 77,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 61,
              "rank": 39,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 61,
              "rank": 137,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 55,
              "rank": 110,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85133540544",
      "title": "Z-Drive Escort Tug manoeuvrability model and simulation, Part II: A full-scale validation",
      "doi": "10.1016/j.oceaneng.2022.111881",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "259",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Piaggio Benedetto; Viviani Michele; Martelli Michele; Figari Massimo",
      "author_ids": "57204360929;58090077400;55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Piaggio B.",
      "keywords": "Azimuthal Stern Drive | Dynamic simulation | Escort towing | Manoeuvring | Tugs | Z-Drive",
      "abstract": "A deep insight into the manoeuvring characterisation of a wider class of Azimuthal Stern Drive Escort tugs (ASD) is undertaken with the scope of defining a real-time parametric manoeuvring simulation code for the free-sailing and towing operations. In the part I of the work a physics-based 4-DOF prediction parametric tool for the dynamic behaviour of the ASD tug has been developed, and a validation with model-scale Escort-towing tests has been presented. In the present paper a second validation methodology, based on full-scale measurements, is discussed. This verification envisages simulator's capability of describing the free-sailing performance of a different but compatible hull, having dimensions, propulsion, skeg characteristics significantly different with respect to the “parent design” used to develop the tool. The experimental campaign involves the measurements purposely performed during sea trials onto two sister-ship ASD new-buildings (RM3213). Turning circle, zig-zag manoeuvres, and Dieudonne’ spiral tests are deeply analysed and the results used for validation purpose. The simulation results showed a satisfactory agreement with the full scale manoeuvres, positively demonstrating the ability of the parametric mathematical formulations to forecast customised tug manoeuvrability for tug design purposes.",
      "citations": 12,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 16,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85138206739",
      "title": "Rapid Prototyping for Enhanced Dynamic Positioning Systems",
      "doi": "10.3233/PMST220075",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "6",
      "issue_id": null,
      "pages": "641-649",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Donnarumma Silvia; Fruzzetti Camilla; Martelli Michele; Chiti Roberto; Pecoraro Andrea; Sebastiani Luca",
      "author_ids": "55350308600;57427556800;55521641400;56845710200;57893035300;16022741600",
      "authorAffiliationIds": "60025153;60025153;60025153;109904344;109904344;109904344",
      "corresponding": "Donnarumma S.",
      "keywords": "dynamic positioning | hardware-in-the-loop | model-based design",
      "abstract": "The paper aims to show the design procedure for a Class-2 dynamic positioning system, from initial conceptualisation upon factory assessment test. The approach involves the use of simulation-based design combined with hardware-in-the-loop testing. This kind of approach involves a detailed knowledge of the investigated ship but gives significant well-known advantages. A custom simulation platform has been developed to have realistic feedbacks of the case-study ship. The dynamic positioning controller structure, including regulator, force and thrust allocation; have been conceptualised, and then, after the porting procedure, the dynamic positioning software has been downloaded in the real programmable logic controller. Several hardware-in-the-loop tests have been carried out to fine-tune the controller parameters. The results show, under different environmental conditions, the respect of the design criteria.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 9,
              "rank": 91,
              "quartile": "Q4"
            },
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 7,
              "rank": 178,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 4,
              "rank": 600,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85138134028",
      "title": "The Study of an Innovative Propulsion Plant for a High-Speed Catamaran Ferry for Decarbonisation in the Marine Industry",
      "doi": "10.3233/PMST220059",
      "venue": "Progress in Marine Science and Technology",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "6",
      "issue_id": null,
      "pages": "494-502",
      "issn": "25430955",
      "eIssn": "25430963",
      "source_id": "21101107127",
      "authors": "Taylor Alessandro; Mizzi Kurt; Spijker Selmar; Martelli Michele; Gutteridge Kurt",
      "author_ids": "57893780700;56366619800;57893540800;55521641400;57893540900",
      "authorAffiliationIds": "60025153;128580661;128580661;60025153;128580661",
      "corresponding": "Taylor A.",
      "keywords": "catamaran | electric | ferry | high-speed | Hybrid",
      "abstract": "This paper supports decarbonisation in the marine industry by demostrating that a proper design methodology and state of the art technologies can significantly reduce greenhouse gas emissions. The paper demonstrates the possibility of reducing the environmental footprint of Marine High-Speed passenger transportation with innovative propulsion plant designs. The challenging solutions to designing a high-speed hybrid catamaran ferry, that satisfy design criteria and requirements, are presented and applied to a realistic case study. The design process investigated the potential electrification of the vessel to reduce its carbon footprint without compromising function and performance and a quantitative comparison to a conventional propulsion plant was carried out and presented.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 22,
              "rank": 200,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 15,
              "rank": 99,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 13,
              "rank": 640,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 9,
              "rank": 91,
              "quartile": "Q4"
            },
            {
              "subject": "Safety, Risk, Reliability and Quality",
              "percentile": 7,
              "rank": 178,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 4,
              "rank": 600,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85128997540",
      "title": "A design framework for combined marine propulsion control systems: From conceptualisation to sea trials validation",
      "doi": "10.1016/j.oceaneng.2022.111282",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "254",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Martelli M.; Figari M.",
      "author_ids": "55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Combined propulsion plant | Energy efficiency | Naval vessel | Ship dynamics | Ship propulsion | Simulation",
      "abstract": "The ship's dynamic performance (acceleration, turning ability, crash stop) strongly depends on both the propulsion system and its control. The steady-state performance analysis of propulsion systems has shown that onboard energy usage benefits from the employment of simulation techniques. Besides, these techniques provide significant advantages in designing the control logic of sophisticated and complex systems. The present work summarizes the research activities conducted to develop suitable simulation framework for the propulsion systems of naval vessels. Theoretical and mathematical models have thus been developed in this paper to simulate the propulsion of ships. Model-scale experiments and full-scale trials have been used to increase the fidelity of the models. The research outcome is a conceptual framework and a fully validated parametric software representing the vessel's dynamic behaviour and propulsion system in steady-state and abrupt manoeuvres. Thanks to this simulation framework, the propulsion control system could be designed, validated, and calibrated before its installation on board, reducing the commissioning time and minimising the propulsion control system's onboard calibration during the acceptance sea trials.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 16,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85123782693",
      "title": "A time-domain methodology to assess the dynamic positioning performances",
      "doi": "10.1016/j.oceaneng.2022.110668",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "247",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Martelli M.; Faggioni N.; Donnarumma S.",
      "author_ids": "55521641400;57205353851;55350308600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Capability plot | Control optimisation | Dynamic positioning | Dynamic simulator | Model-based design",
      "abstract": "This paper presents the procedure for designing a Dynamic Positioning system and evaluating its performance using a dynamic approach. Generally, static analysis is the standard preliminary design method for a Dynamic Position system; however, this has some drawbacks for a realistic representation of the system operating in real conditions since the transient behaviours are neglected. The proposed procedure provides results in a novelty manner, and they are named Time-domain Dynamic Positioning Capability Plots. They were obtained by a model-based design approach using a ship's dynamic simulator. The dynamic simulator is based on a fully actuated testing model. Indeed, the proposed tool has been designed on a tug vessel equipped with two azimuth thrusters and one bow-thruster. In particular, two force allocation logics for the station keeping manoeuvres have been developed; one is an optimised thrust allocation logic, the other is obtained with the primary goal to reduce as much as possible azimuth thrusters rotation. The two different allocations can fulfil both open-loop and closed-loop commands, but only the closed-loop has been discussed. Eventually, the comparison between static capability plots and the capability plots obtained by several dynamic simulations has been provided, presented, and discussed.",
      "citations": 14,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 16,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85123502826",
      "title": "Dynamic target chasing: parameters and performance indicators assessment",
      "doi": "10.1007/s00773-021-00865-3",
      "venue": "Journal of Marine Science and Technology Japan",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "27",
      "issue_id": "1",
      "pages": "712-729",
      "issn": "09484280",
      "eIssn": null,
      "source_id": "27784",
      "authors": "Fruzzetti Camilla; Donnarumma Silvia; Martelli Michele",
      "author_ids": "57427556800;55350308600;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Fruzzetti C.",
      "keywords": "Autonomous surface vessel | Constant bearing | Guidance | Line-of-sight | Target tracking",
      "abstract": "This paper aims to present a systematic approach to evaluate the parameters affecting the vessel’s performances in the target tracking motion control scenario and, for this reason, three guidance laws have been formalised. Such scenario consists of reaching and following a target of which it is only possible to know the instantaneous position and velocity, hence when the future motion is unknown. The standard Line-Of-Sight, Pure Pursuit, and Constant Bearing have been modified and deeply tested. The target tracking scenario has been divided into two parts: the target approach and following strategies. The increase in system complexity needs advanced tools to predict the vehicle response in both standard and non-standard conditions. Simulation can support the designer’s effort for the transition from a traditional to an autonomous ship in the whole ship design; hence, all the guidance laws have been virtually tested and a sensitivity analysis is carried out to understand each parameter effect. Several manoeuvres have been performed and the results are shown to highlight benefits and drawbacks for each law. Eventually, key performance indicators are outlined and some suggestions are given to the proper settings of the guidance law parameters in the function of the specific mission.",
      "citations": 11,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Oceanography",
              "percentile": 83,
              "rank": 26,
              "quartile": "Q1"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 76,
              "rank": 28,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 75,
              "rank": 178,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 70,
              "rank": 123,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 74,
              "rank": 161,
              "quartile": "Q2"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 73,
              "rank": 27,
              "quartile": "Q2"
            },
            {
              "subject": "Oceanography",
              "percentile": 71,
              "rank": 39,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanics of Materials",
              "percentile": 71,
              "rank": 113,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85187450570",
      "title": "Collision-avoidance capabilities reduction after a cyber-attack to the navigation sensors",
      "doi": "10.24868/10729",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Longo Giacomo; Martelli Michele; Russo Enrico; Zaccone Raphael",
      "author_ids": "57468566600;55521641400;57197855120;56717793100",
      "authorAffiliationIds": "60121711;60025153;60121711;60025153",
      "corresponding": "Longo G.",
      "keywords": "Autonomous Ship | Collision Avoidance | Cyber-attack | Cyber-range",
      "abstract": "The interest in autonomous navigation for surface ships has arisen over the years for both naval vessels and commercial ships. In literature, several pieces of research addressed the challenges of developing new guidance laws, stable and robust control algorithms, methodologies to increase situational awareness, and collision avoidance algorithms. Current papers base their outcome on blind trust in the information coming from navigation sensors. However, sensors can be subjected to malfunctioning, or even worse, cyber-attackers may hijack their data. This last scenario will be more and more common in the near future and represents a dangerous threat that future generation ships must face. In this work, a grey-box approach has been used to predict the outcomes of a stateof-the-art collision avoidance algorithm. Based on that, the attack consists of injecting fictitious targets as the input of the collision avoidance to force the ship to follow a predetermined and malicious track. A set of dedicated simulations using a ship simulator is carried out, and the effects of such a cyber-attack on the automatic collision avoidance system are shown. Based on the obtained results, at the end of the paper, effects on the evasive route generations are analysed and deeply discussed.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85187410750",
      "title": "Detecting and Tracking Multi-Object in Real Marine Environment",
      "doi": "10.24868/10707",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Martelli Michele; Faggioni Nicolo; Ponzini Filippo",
      "author_ids": "55521641400;57205353851;58576469000",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Autonomous Ship | Collision Detection | LiDAR Point Cloud | Multi-Object Tracking | Sea Trials | Unsupervised Learning",
      "abstract": "In recent years, the maritime sector has been witnessing a growing interest in autonomous navigation due to its advantages in safety. Within this framework, it is challenging to have available an automatic collision avoidance system based on data coming from the onboard sensors. For instance, LiDAR (Light Detection and Ranging) sensors are often employed to obtain a virtualized model of the surrounding environment in order to obtain an increase of situational awareness. Deep Learning approaches are widely used in the automotive sector for obstacle detection, particularly, trained Convolutional Neural Networks. Still, they imply a training phase based on a large dataset of pre-labelled LiDAR scans. Unfortunately, an extensive training dataset is not yet available for the marine environment. For such a reason, this paper presents in detail a low-computational alternative procedure based on Unsupervised Learning which overcomes the lack of a training dataset; each step is investigated, from the data sampling up to the multi-target tracking of the detected obstacles. In particular, the proposed object detection framework has been tested by means of an extensive on-field data collection campaign carried out during sea trials by equipping a ship with a LiDAR. Furthermore, Euclidean distance-based clustering algorithm and a bounding-box construction method based on Principal Component Analysis have been adopted. Moreover, a specific tracking system with no prediction filters is proposed to fulfil the strict time constraint for fast reactions in complex scenarios where several objects need to be tracked. The algorithm has been tested versus the well-known Global Nearest Neighbour tracker; such a comparison includes the computational cost and the results’ accuracy. The whole approach has been tested on such a challenging and dynamic marine scenario, and the results obtained are presented and discussed. Such and outcome shows that the proposed approach can detect and track multiple objects with reasonable accuracy; moreover, the outputs are provided near real-time. To conclude, the pros, the weaknesses, and future developments are reported.",
      "citations": 4,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85136216304",
      "title": "A simulation based tool to assess the propulsion performance of modern conventional submarines",
      "doi": "10.1109/SPEEDAM53979.2022.9842197",
      "venue": "2022 International Symposium on Power Electronics Electrical Drives Automation and Motion Speedam 2022",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": null,
      "issue_id": null,
      "pages": "628-633",
      "issn": null,
      "eIssn": null,
      "source_id": "21101101911",
      "authors": "Zaccone Raphael; Figari Massimo; Martelli Michele",
      "author_ids": "56717793100;6507282370;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": "Air independent propulsion | Dynamical simulation | Hybrid propulsion | Naval ships | Submarines",
      "abstract": "The propulsion system of modern conventional submarines features multiple energy conversion and storage devices and users, which operate closely interconnected. The basic design and sizing of the components commonly rely on steady-state calculations, neglecting the interactions between the propulsion system components. An adequately tailored simulation-based approach is beneficial to ensure the design fulfills the operating requirements in the advanced design phases. Time-domain simulation provides information otherwise unavailable with standard design tools. Moreover, the decision-making process involved in modeling the system and developing the simulation tool shares several similarities with the actual design of the physical system. This paper proposes a simulation model of the propulsion system of a conventional submarine. The theoretical aspects, hypotheses, and simplifications are first discussed. The proposed approach is then applied to a case study to show the potential benefits arising from dynamic simulation when evaluating the performance of a conventional submarine unit.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85136188410",
      "title": "Multiphysics Modeling and Simulation of Integrated Electric Propulsion System for Ship Dynamic Positioning",
      "doi": "10.1109/SPEEDAM53979.2022.9841976",
      "venue": "2022 International Symposium on Power Electronics Electrical Drives Automation and Motion Speedam 2022",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": null,
      "issue_id": null,
      "pages": "645-650",
      "issn": null,
      "eIssn": null,
      "source_id": "21101101911",
      "authors": "Donnarumma S.; Martelli M.; D'Agostino F.; Kaza D.; Silvestro F.",
      "author_ids": "55350308600;55521641400;56553864200;57218924925;23026343700",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Donnarumma S.",
      "keywords": "Dynamic positioning | electric propulsion | frequency regulation | multiphysics modeling",
      "abstract": "The paper presents a multiphysics modelling approach to design an integrated electric propulsion system for ship dynamic positioning purposes. The simulation platform integrates the model of the shipboard power plant, the hydrodynamic and environmental forces and the dynamic positioning controller. The shipboard power systems have been modelled considering the electro-mechanical behaviour of the power-frequency dynamic so that the platform can run in real-time and be linked with the controller hardware. The simulation platform has been tested through a detailed simulation campaign by using as a study case a Platform Supply Vessel where its behaviour is harsh condition has been validated.",
      "citations": 3,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85128769544",
      "title": "Obstacle Detection in Real and Synthetic Harbour Scenarios",
      "doi": "10.1007/978-3-030-98260-7_2",
      "venue": "Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics",
      "type": "Book Series",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "13207 LNCS",
      "issue_id": null,
      "pages": "26-38",
      "issn": "03029743",
      "eIssn": "16113349",
      "source_id": "25674",
      "authors": "Faggioni Nicolò; Leonardi Nicola; Ponzini Filippo; Sebastiani Luca; Martelli Michele",
      "author_ids": "57205353851;57610700600;58576469000;16022741600;55521641400",
      "authorAffiliationIds": "60025153;121267422;60025153;121267422;60025153",
      "corresponding": "Faggioni N.",
      "keywords": "Autonomous navigation | Clustering | LiDAR point cloud | Marine scenario",
      "abstract": "In the last decade, the autonomous vehicle has been investigated by both academia and industry. One of the open research topics is obstacle detection and avoidance in real-time; for such a challenge, the most used approaches are based on deep learning, especially in the automotive sector. Usually, trained neural networks are used to detect the obstacles by receiving the point clouds from LiDAR as input data. However, this approach is currently not feasible in the marine sector as there are no large datasets of LiDAR point clouds and relatively few RGB images available to train networks. For such a reason, this paper aims to present the first step for the design of an alternative approach that integrates unsupervised and supervised learning algorithms for the detection and tracking of both fixed and moving obstacles. A virtual scenario that can be customized according to the users’ purpose has been developed and used to collect data by emulating the LiDAR and camera behaviour. Moreover, the preliminary on-field LiDAR recording is presented and processed. The unsupervised clustering algorithms have been tested, and the pros and cons of the different clustering approaches are shown.",
      "citations": 11,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Theoretical Computer Science",
              "percentile": 48,
              "rank": 70,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 46,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 46,
              "rank": 126,
              "quartile": "Q3"
            },
            {
              "subject": "Theoretical Computer Science",
              "percentile": 34,
              "rank": 84,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85107834293",
      "title": "Optimisation of a diesel-electric ship propulsion and power generation system using a genetic algorithm",
      "doi": "10.3390/jmse9060587",
      "venue": "Journal of Marine Science and Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "9",
      "issue_id": "6",
      "pages": null,
      "issn": null,
      "eIssn": "20771312",
      "source_id": "21100830140",
      "authors": "Zaccone Raphael; Campora Ugo; Martelli Michele",
      "author_ids": "56717793100;6508251998;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": "Electric propulsion | Energy efficiency | Genetic algorithm | Optimisation | Ship design | Ship propulsion",
      "abstract": "In recent decades, the design of ship propulsion systems has been focusing on energy efficiency and low pollutant emissions. In this framework, diesel–electric propulsion has become a standard for many ship types and has proven its worth for flexible propulsion design and manage-ment. This paper presents an approach to the optimal design of diesel–electric propulsion systems, minimising the fuel consumption while meeting the power and speed requirements. A genetic algorithm performs the optimisation, used to determine the number and type of engines installed on-board and the engines’ design speed and power, selecting within a dataset of four-stroke diesel engines. The same algorithm is then adapted and applied to determine the optimal load sharing strategy in off-design conditions, taking advantage of the high flexibility of the diesel–electric propulsion plants. In order to apply the algorithm, the propulsion layout design is formulated as an optimisation problem, translating the system requirements into a cost function and a set of linear and non-linear constraints. Eventually, the method is applied to a case study vessel: first, the optimal diesel–electric propulsion plants are determined, then the optimal off-design load sharing and working conditions are computed. AC and DC network solutions are compared and critically discussed in both design and off-design conditions.",
      "citations": 32,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 75,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 73,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 72,
              "rank": 77,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 57,
              "rank": 42,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 51,
              "rank": 159,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 49,
              "rank": 121,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85102491760",
      "title": "Parameter identification of a model scale ship drive train",
      "doi": "10.3390/jmse9030268",
      "venue": "Journal of Marine Science and Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "9",
      "issue_id": "3",
      "pages": "1-26",
      "issn": null,
      "eIssn": "20771312",
      "source_id": "21100830140",
      "authors": "Vrijdag Arthur; Martelli Michele",
      "author_ids": "23010544000;55521641400",
      "authorAffiliationIds": "60118247;60025153",
      "corresponding": "Vrijdag A.",
      "keywords": "Condition-based maintenance | Data-driven ship propulsion model | Digital twin | Marine propulsion system | Parameter identification",
      "abstract": "Simulation models of the ship propulsion system play an increasingly important role, for instance in controller design and condition monitoring. However, creation of such simulation models requires significant time and effort. In this paper, the application of deterministic identification techniques on a DC-electric ship drive train is explored as an alternative for data-driven identification techniques that require extensive measured data sets collected over long periods of ship operation. First, a nonlinear and a linear simulation model that represent the dynamic behavior of the propulsion plant are developed, and the main parameters to be identified are defined. Then, a set of experiments on a model scale boat in the bollard pull condition are conducted using an ad hoc experimental setup and data acquisition system. Subsequently, various types of identification techniques are applied, aiming to determine the unknown model parameters. Eventually, a comparison is made between experimental and simulated results, using the different sets of the estimated parameters. The value of the demonstrated approaches lies in the fast determination of unknown system parameters. These parameters can be used in simulation models, which in turn can be used for various purposes such as system controller development and tuning. Furthermore, periodic determination of system parameters can support condition monitoring to detect faults or degradation of the system. The latter point directly deals with the condition-based maintenance issue; in fact, monitoring the propulsion plant parameters over time could allow for better management (and timing) of maintenance. Although the developed ideas are far from ready to be used on the full-scale, the authors believe that the methodologies are promising enough to be developed further towards a full-scale application.",
      "citations": 5,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 75,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 73,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 72,
              "rank": 77,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 57,
              "rank": 42,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 51,
              "rank": 159,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 49,
              "rank": 121,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85145495960",
      "title": "Z-drive escort tug manoeuvrability modelling: From model-scale to full-scale validation",
      "doi": "10.1201/9781003216599-23",
      "venue": "Developments in Maritime Technology and Engineering Proceedings of the 5th International Conference on Maritime Technology and Engineering Martech 2020",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2021,
      "volume": "2",
      "issue_id": null,
      "pages": "207-216",
      "issn": null,
      "eIssn": null,
      "source_id": "21101129854",
      "authors": "Piaggio B.; Viviani M.; Martelli M.; Figari M.",
      "author_ids": "57204360929;58090077400;55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Piaggio B.",
      "keywords": null,
      "abstract": "A deep insight into the manoeuvring characterisation of a broader class of Azimuthal Stern Drive Escort tugs (ASD) is undertaken with the scope of defining a parametric manoeuvring simulation code for the free-sailing and towing operations. To this end, given a simple set of tug design parameters (main dimensions, skeg size, azimuthal size, propeller pitch, main engines, etc.), a physics-based 4-DOF mathematical prediction tool for the dynamic behaviour of the ASD tug has been developed in calm seas. Two independent validation processes have been provided to prove the suitability of the modelling: the first model-scale, while the second full-scale. The present paper presents the free-sailing full-scale validation of a different but compatible hull, having dimensions, propulsion, skeg characteristics significantly different with respect to the “parent-design” (RM2812) used to develop the code principally. The verification involved the measurements purposely performed during sea trials onto two sister-ship ASD new-buildings (RM3213).",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85120571973",
      "title": "An Outlook on the Future Marine Traffic Management System for Autonomous Ships",
      "doi": "10.1109/ACCESS.2021.3130741",
      "venue": "IEEE Access",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "9",
      "issue_id": null,
      "pages": "157316-157328",
      "issn": null,
      "eIssn": "21693536",
      "source_id": "21100374601",
      "authors": "Martelli Michele; Virdis Antonio; Gotta Alberto; Cassara Pietro; DI Summa Maria",
      "author_ids": "55521641400;56342812200;9846429300;24767643400;56308716000",
      "authorAffiliationIds": "60025153;60028868;60008218;60008218;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Autonomous navigation | control | guidance | navigation | vessel traffic system",
      "abstract": "In the shipping digitalisation process, the peak will be reached with the advent of a wholly autonomous and at the same time safe and reliable ship. Full autonomy could be obtained by two linked Artificial-Intelligence systems representing the ship navigator and the ship engineer that possess sensing and analysis skills, situational awareness, planning, and control capabilities. Many efforts have been made in developing onboard systems; however, the shore facilities are not ready yet to deal with these new technologies. The paper aims to present the innovative technologies and methodologies needed to develop a futuristic Vessel Traffic System. The proposed systems will aim at faultless data acquisition and processing, provide input to decision-making systems, and suggest evasive manoeuvre; to deal with hazards and systems failure without human intervention onboard. The system is composed of three different and interacting layers. The first is an artificially intelligent tool to detect and control autonomous ships, thanks to situation recognition and obstacle avoidance strategies. The second is an orchestration and management platform designed to coordinate the sensing/actuation infrastructure and the AI algorithms' results made available by multiple ships, mustering edge, and distributed computing techniques to fulfil the specific harsh requirements of the sea environment. The final part is a holistic guidance-navigation-control framework to manage autonomous ships' navigation in a crowded area. Eventually, a cyber-physical scenario, using both a ship digital-twin and a real model-scale ship, is suggested to test and validate the innovative system without the availability of a full-scale scenario.",
      "citations": 54,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 88,
              "rank": 42,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 83,
              "rank": 41,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 78,
              "rank": 101,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 90,
              "rank": 28,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 85,
              "rank": 34,
              "quartile": "Q1"
            },
            {
              "subject": null,
              "percentile": 82,
              "rank": 124,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 77,
              "rank": 104,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85077165478",
      "title": "The use of computational fluid dynamic technique in ship control design",
      "doi": "10.1080/17445302.2019.1706908",
      "venue": "Ships and Offshore Structures",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "16",
      "issue_id": "1",
      "pages": "31-45",
      "issn": "17445302",
      "eIssn": null,
      "source_id": "19700186818",
      "authors": "Martelli M.; Villa D.; Viviani M.; Donnarumma S.; Figari M.",
      "author_ids": "55521641400;56250522200;58090077400;55350308600;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "CFD | control design | marine propulsion plant | Ship dynamics | simulation techniques | slow-speed manoeuvrability",
      "abstract": "This paper presents a methodology to develop the control systems of a surface vessel by using both computational fluid dynamics techniques and model-based control design. The model-based control design is supported by a simulation platform where both the ship hydrodynamics and the propulsion plant are modelled together. The application of CFD is related to the direct evaluation of the hull forces in the ship hydrodynamic model, for different manoeuvring conditions. The developed design tool is essential in the preliminary design phase, as a benchmark to test the control algorithms for autonomous ships. The comparison between numerical assessment and regression-based formulae has been performed on non-standard manoeuvres to quantify the difference in thrust allocation from the point of view of control design. Eventually, to validate the effectiveness of the proposed methodology, the results of the sea trials for different manoeuvres are shown.",
      "citations": 15,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 71,
              "rank": 33,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 68,
              "rank": 235,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 66,
              "rank": 203,
              "quartile": "Q2"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 65,
              "rank": 34,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85090804759",
      "title": "Development of a multiphysics real-time simulator for model-based design of a DC shipboard microgrid",
      "doi": "10.3390/en13143580",
      "venue": "Energies",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "13",
      "issue_id": "14",
      "pages": null,
      "issn": null,
      "eIssn": "19961073",
      "source_id": "62932",
      "authors": "D'Agostino Fabio; Kaza Daniele; Martelli Michele; Schiapparelli Giacomo P.; Silvestro Federico; Soldano Carlo",
      "author_ids": "56553864200;57218924925;55521641400;57204003255;23026343700;57218925964",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;60102057",
      "corresponding": "D'Agostino F.",
      "keywords": "DC microgrid | HIL | Marine propulsion | Model-based design | Multi physics simulation | Ship dynamic | Shipboard power systems",
      "abstract": "Recent and strict regulations in the maritime sector regarding exhaust gas emissions has led to an evolution of shipboard systems with a progressive increase of complexity, from the early utilization of electric propulsion to the realization of an integrated shipboard power system organized as a microgrid. Therefore, novel approaches, such as the model-based design, start to be experimented by industries to obtain multiphysics models able to study the impact of different designing solutions. In this context, this paper illustrates in detail the development of a multiphysics simulation framework, able to mimic the behaviour of a DC electric ship equipped with electric propulsion, rotating generators and battery energy storage systems. The simulation platform has been realized within the retrofitting project of a Ro-Ro Pax vessel, to size components and to validate control strategies before the system commissioning. It has been implemented on the Opal-RT simulator, as the core component of the future research infrastructure of the University of Genoa, which will include power converters, storage systems, and a ship bridge simulator. The proposed model includes the propulsion plant, characterized by propellers and ship dynamics, and the entire shipboard power system. Each component has been detailed together with its own regulators, such as the automatic voltage regulator of synchronous generators, the torque control of permanent magnet synchronous motors and the current control loop of power converters. The paper illustrates also details concerning the practical deployment of the proposed models within the real-time simulator, in order to share the computational effort among the available processor cores.",
      "citations": 19,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Control and Optimization",
              "percentile": 94,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Engineering (miscellaneous)",
              "percentile": 86,
              "rank": 38,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 84,
              "rank": 155,
              "quartile": "Q1"
            },
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 78,
              "rank": 71,
              "quartile": "Q1"
            },
            {
              "subject": "Fuel Technology",
              "percentile": 70,
              "rank": 40,
              "quartile": "Q2"
            },
            {
              "subject": "Renewable Energy, Sustainability and the Environment",
              "percentile": 64,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Energy (miscellaneous)",
              "percentile": 64,
              "rank": 39,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Control and Optimization",
              "percentile": 85,
              "rank": 17,
              "quartile": "Q1"
            },
            {
              "subject": "Engineering (miscellaneous)",
              "percentile": 83,
              "rank": 13,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 73,
              "rank": 183,
              "quartile": "Q2"
            },
            {
              "subject": "Energy (miscellaneous)",
              "percentile": 72,
              "rank": 7,
              "quartile": "Q2"
            },
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 72,
              "rank": 62,
              "quartile": "Q2"
            },
            {
              "subject": "Fuel Technology",
              "percentile": 67,
              "rank": 33,
              "quartile": "Q2"
            },
            {
              "subject": "Renewable Energy, Sustainability and the Environment",
              "percentile": 64,
              "rank": 69,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85075005148",
      "title": "A collision avoidance algorithm for ship guidance applications",
      "doi": "10.1080/20464177.2019.1685836",
      "venue": "Journal of Marine Engineering and Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "19",
      "issue_id": "sup1",
      "pages": "62-75",
      "issn": "20464177",
      "eIssn": "20568487",
      "source_id": "21100470126",
      "authors": "Zaccone Raphael; Martelli Michele",
      "author_ids": "56717793100;55521641400",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": null,
      "abstract": "The paper presents a collision avoidance algorithm for ship open sea navigation, based on an ad hoc modified version of the Rapidly-exploring Random Tree (RRT*) algorithm. The proposed approach is designed to act as the high level layer of the navigation control structure for an autonomous ship. Collision and grounding still represent the primary source of sea accidents, thus an automatic system able to detect static and moving obstacles and plan an evasive route could significantly improve safety during navigation, especially in crowded areas. Focusing on the maritime field, a review of the scientific literature dealing with collision avoidance is presented, showing potential benefits and weaknesses of the different approaches. Among the several methods, details about the RRT and RRT* algorithms are given. The ship path planning problem is introduced and discussed, formulating suitable cost functions and taking into account both topological and kinematic constraints. The algorithm is able to manage multiple moving obstacles with variable speed and course. Eventually, a time-domain ship simulator is used to test the effectiveness of the proposed algorithm over a number of realistic operation scenarios. The obtained results are presented and critically discussed.",
      "citations": 73,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 90,
              "rank": 12,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 57,
              "rank": 41,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85110557089",
      "title": "A novel model based-design approach for a dynamic positioning system",
      "doi": "10.24868/issn.2631-8741.2020.002",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "1",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Martelli M.; Faggioni N.; Donnarumma S.",
      "author_ids": "55521641400;57205353851;55350308600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Control Optimisation | Dynamic Positioning | Model-based Analysis | Motion Control",
      "abstract": "This paper aims to present a novel approach to design a dynamic positioning system by using a dynamic model based-design approach. The proposed study has been performed to both develop and preliminarily test the control logic that should be implemented on a model scale vessel. Indeed, the proposed tool has been designed for a fully actuated tug vessel equipped with two azimuthal thrusters and one bow-thruster, emulated in behaviour with a dynamic simulator. Thanks to the model actuation, it was possible to design a unique, optimised allocation logic able to fulfil both open-loop and closed-loop commands, sufficiently proved and tuned before the installation onboard. Moreover, a thorough comparison between different design methods, static and dynamic performance evaluation has been carried out. Two different operational modes are tested, and the results are presented: joystick and station keeping.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85110438737",
      "title": "Follow-the-leader control strategy for azimuth propulsion system on surface vessels",
      "doi": "10.24868/issn.2631-8741.2020.004",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "1",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Piaggio B.; Garofano V.; Donnarumma S.; Alessandri A.; Negenborn R. R.; Martelli M.",
      "author_ids": "57204360929;57210819545;55350308600;7005735677;16480813000;55521641400",
      "authorAffiliationIds": "60025153;60118236;60025153;60025153;60118236;60025153",
      "corresponding": "Piaggio B.",
      "keywords": "Azimuthal Propulsion | Follow-the-Leader | Line-of-Sight | Path-Following | Platooning | Tugs",
      "abstract": "This paper presents an effective autonomous follow-the-leader strategy for Azimuthal Stern Drive vessels. The control logic has been investigated from a theoretical point of view. A line-of-sight algorithm is exploited to ensure yaw-check ability, while a speed-check feature is implemented to track the velocity of the target along the path. For this purpose, a linearised manoeuvrability model for azimuthal drive surface vessels is presented. A model-based control synthesis is proposed to ensure the stability of the closed-loop system and robust PID controllers are designed by using Linear Matrix Inequalities technique. The control strategy has been successively validated in two steps, initially by using simulation techniques, and then experimentally using an outdoor scenario with model scale tugs. The path planning, navigation, guidance and control modules are studied, detailed, and digitally implemented on-board of the model scale tugs. The models are supplied with GNSS+INS navigation system. Low-level management and control of Azimuthals angles and shaft revolutions is implemented on-board. High-level decen-tralised path planning, guidance, and control sequence evaluation are dealt with at a remote ground station. In particular, the presented follow-the-leader strategy meets the most generic needs of platooning convoys, and, in the specific instance, of Escort convoy tugs. The operative profile of the latter concerns long-lasting and routine chases with the continuous demand of tuning heading and speed to track the target vessels, until the rare occurrence of an emergency event. In a realistic scenario, the proposed control system would be beneficial for the tug master’s lucidity and alertness, while reducing avoidable risks. At the end of the paper, the results of the experimental campaign are shown to demonstrate the effectiveness of the proposed control logic.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85110427177",
      "title": "The collaborative autonomous shipping experiment (Case): Motivations, theory, infrastructure, and experimental challenges",
      "doi": "10.24868/issn.2631-8741.2020.014",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "1",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Haseltalab Ali; Garofano Vittorio; Afzal Muhammad Raheel; Faggioni Nicoló; Li Shijie; Liu Jialun; Ma Feng; Martelli Michele; Singh Yogang; Slaets Peter; You Xu; Negenborn Rudy R.",
      "author_ids": "56820151300;57210819545;55607245400;57205353851;56044135200;36548777800;59105097100;55521641400;57192315885;15137408000;57796234200;16480813000",
      "authorAffiliationIds": "60118236;60118236;60025063;60025153;60022414;60022414-115178096;60022414-115178096;60025153;60025063;60025063;60022414-115178096;60118236",
      "corresponding": "Haseltalab A.",
      "keywords": "Collaborative Shipping | Model Vessels. Autonomous Shipping | Obstacle Avoidance | Path Planning | Trajectory Tracking",
      "abstract": "The future autonomous ships will be operating in an environment where different autonomous and non-autonomous vessels with different characteristics exist. These vessels are owned by different parties and each uses its owned unique approaches for guidance and navigation. The Collaborative Autonomous Shipping Experiment (CASE) aims at emulating such an environment and also stimulating the move of automatic ship control algorithms towards practice by bringing together different institutes researching on autonomous vessels under an umbrella to experiment with collective sailing in inland waterways. In this paper, the experiments of CASE 2020 are explained, the characteristics of different participating vessels are discussed and some of the control and perception algorithms that are planned to be used at CASE 2020 are presented. CASE 2020 will be held in parallel to iSCSS 2020 at Delft University of Technology, the Netherlands.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85083715563",
      "title": "Simulation of the Guidance and Control Systems for Underactuated Vessels",
      "doi": "10.1007/978-3-030-43890-6_9",
      "venue": "Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics",
      "type": "Book Series",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "11995 LNCS",
      "issue_id": null,
      "pages": "108-119",
      "issn": "03029743",
      "eIssn": "16113349",
      "source_id": "25674",
      "authors": "Donnarumma Silvia; Figari Massimo; Martelli Michele; Zaccone Raphael",
      "author_ids": "55350308600;6507282370;55521641400;56717793100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Donnarumma S.",
      "keywords": "Autonomous vessels | Collision avoidance | Simulation | Track keeping",
      "abstract": "Intelligent and/or autonomous vehicle technologies are rapidly growing to meet the needs of marine safety and transport efficiency. One of the requirements to manage autonomous vehicles includes the integration between route planning and automatic motion control. In the authors’ opinion, the latter could be sketched in three different layers: obstacle detection, planning and actuation. Moreover, the three layers should be able to interact in real-time. Dealing with such a challenging task, one of the best techniques to develop and test the logic is the use of the time-domain simulation. In the present work, a simulation model, integrating a path planning algorithm in the presence of obstacles with a track keeping controller, is developed. The path planning is based on a modified version of the Rapidly-exploring Random Tree (RRT*) algorithm. The track keeping is based on the Line-of-Sight (LOS) waypoints navigation for underactuated vessels. To achieve more reliable results, a detailed ship simulation model is used as a benchmark. Different scenarios and navigation modes are successfully tested, and the results are presented and analysed.",
      "citations": 16,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Theoretical Computer Science",
              "percentile": 48,
              "rank": 70,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 46,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 50,
              "rank": 113,
              "quartile": "Q2"
            },
            {
              "subject": "Theoretical Computer Science",
              "percentile": 24,
              "rank": 91,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85079226039",
      "title": "Development of a navigation support system by means of a synthetic scenario",
      "doi": null,
      "venue": "Sustainable Development and Innovations in Marine Technologies Proceedings of the 18th International Congress of the International Maritime Association of the Mediterranean Imam 2019",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": null,
      "issue_id": null,
      "pages": "481-487",
      "issn": null,
      "eIssn": null,
      "source_id": "21100944631",
      "authors": "Martelli M.; Faggioni N.; Zaccone R.",
      "author_ids": "55521641400;57205353851;56717793100",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": null,
      "abstract": "The main idea of this paper is to connect a synthetic scenario and a time domain ship dynamic simulator, in order to enhance the situational awareness of the bridge crew. The VR is used to represent the surrounding environment, and the Human-In-The-Loop (HITL) techniques permits the user to interact with the simulation. The combined use of a simulator and a synthetic scenario allows multiple choices, such as performing emergency or non-standard manoeuvres, receiving feedbacks and, in case, making the proper actions on the ship. In this paper, this approach is applied to develop a VR-based decision support system for collision avoidance, firstly implementing simple collision avoidance strategies and then elaborating the tool to visualise the information in a synthetic 3D scenario. At the end of the paper, results related to the described application are presented, and the benefits and the weakness of the proposed methodology are discussed.",
      "citations": 8,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85073011172",
      "title": "Z-Drive Escort Tug manoeuvrability model and simulation",
      "doi": "10.1016/j.oceaneng.2019.106461",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "191",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Piaggio Benedetto; Viviani Michele; Martelli Michele; Figari Massimo",
      "author_ids": "57204360929;58090077400;55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Piaggio B.",
      "keywords": "Azimuthal Stern Drive | Dynamic simulation | Escort towing | Manoeuvring Model | Tugs | z-Drive",
      "abstract": "The ability to predict the tug's handling, effectiveness, and safety at early design stage is paramount in view of an optimal design process. In this framework, the availability of a reliable manoeuvrability prediction model is beneficial. This paper presents a novel 4-DOF parametric manoeuvrability model dedicated to the manoeuvrability analysis of Azimuthal Stern Drive Escort Tugs. An extensive captive model testing campaign is exploited to develop the mathematical model, conceived following the MMG model concept. The modelling pursues a physics-based approach aimed at characterising the complete manoeuvring hydrodynamics of the vessel. The hull+skeg and azimuthals force contributions are analysed separately and are then coupled to analyse their interaction. A complete, real-time simulator is presented, which is capable of simulating the dynamics of a towing convoy in several real case scenarios. This capability is envisaged to become a very useful tool for the tug designer, allowing to address realistic operational conditions with a focus on manoeuvring capabilities, risk assessment, risk mitigation, operational safety and effectiveness.",
      "citations": 32,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 76,
              "rank": 32,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85059667461",
      "title": "Fuel saving in a marine propulsion plant by using a continuously variable transmission",
      "doi": "10.1177/1475090218806977",
      "venue": "Proceedings of the Institution of Mechanical Engineers Part M Journal of Engineering for the Maritime Environment",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "233",
      "issue_id": "4",
      "pages": "1007-1021",
      "issn": "14750902",
      "eIssn": "20413084",
      "source_id": "25596",
      "authors": "Martelli Michele; Faggioni Nicolò; Berselli Giovanni",
      "author_ids": "55521641400;57205353851;24483038000",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "continuously variable transmission | fuel consumption | Marine propulsion plant | ship energy efficiency | time domain simulation",
      "abstract": "Nowadays, more than in the past, marine industries are paying increasing attention to the environmental impact of ships and vessels. Several solutions have been studied and adopted with the final aim of reducing the exhaust gas emissions, mainly acting on the fuel consumption reduction. Within this scenario, the aim of this article is to investigate the energy performance and the fuel saving potential when employing a magnetic continuously variable transmission in a marine propulsion system. Such magnetic continuously variable transmission, considered among other possible continuously variable transmission designs since its torque capabilities are perfectly suitable for the application at hand, is employed in order to optimize the overall propulsion efficiency through an appropriate optimal variation of the reduction ratio as a function of the propeller loads. A secondary benefit, although not less important, is that the magnetic continuously variable transmission is an oil-free transmission that consequently offers a lower environmental impact as compared to traditional lubricated gearboxes. Owing to these considerations, in the article, the magnetic continuously variable transmission size is first selected on the basis of a simplified static model of the vessel. Subsequently, a dynamic mathematical model representing the overall drivetrain dynamic of the propulsion plant is developed, with the purpose of simulating the transmission behaviour during fast ship manoeuvres. Then, in order to test the effectiveness of the proposed design, a trawler is selected as a case study. This particular ship type has been chosen as it provides a variegated operative profile in terms of speed and required thrust, thus being a representative case of those ships in which a continuously variable transmission installation could effectively provide practical benefits. A quantitative analysis of the plant efficiency is finally provided and critically discussed.",
      "citations": 6,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 68,
              "rank": 37,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 66,
              "rank": 249,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 67,
              "rank": 30,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 62,
              "rank": 222,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85069898764",
      "title": "Experimental assessment of the fouling control coating effect on the fuel consumption rate",
      "doi": "10.1016/j.oceaneng.2019.106233",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "188",
      "issue_id": null,
      "pages": null,
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Notti Emilio; Figari Massimo; Sala Antonello; Martelli Michele",
      "author_ids": "56045283900;6507282370;7101706705;55521641400",
      "authorAffiliationIds": "60021199;60025153;60021199-60103695;60025153",
      "corresponding": "Notti E.",
      "keywords": "Energy efficiency | Fisheries | Foul-release coating | Fuel saving | Marine propulsion plant",
      "abstract": "Fishing is an energy-intensive economic activity. Research in several fields is conducted to improve the energy and environmental profile of fishing vessels. As regards the technical measures, the assessment of benefits is often hampered by boundary conditions that are difficult to quantify and side effects that are difficult to unravel. This study examined the impact of a fluoropolymer-based fouling release paint on the fuel consumption rate of a Mediterranean bottom trawler. The analysis of a series of sea trial campaigns allowed for a quantitative and qualitative comparison of fuel consumption rate during the regular fishing activities. Comparing the fuel consumption rate before and after the application of the fluoropolymer-based foul-release coating, a reduction in fuel consumption rate was observed and quantified. Other advantages are discussed in this paper regarding the reduction of GHG emission, and the more environmental-friendly approach using biocide-free and non-banned products.",
      "citations": 12,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 87,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 76,
              "rank": 32,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85071527416",
      "title": "A colreg-compliant ship collision avoidance algorithm",
      "doi": "10.23919/ECC.2019.8796207",
      "venue": "2019 18th European Control Conference Ecc 2019",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2019,
      "volume": null,
      "issue_id": null,
      "pages": "2530-2535",
      "issn": null,
      "eIssn": null,
      "source_id": "21100926603",
      "authors": "Zaccone Raphael; Martelli Michele; Figari Massimo",
      "author_ids": "56717793100;55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": "Autonomous Ship | Collision Avoidance | COLREGs | Path Planning | RRT | Ship Simulator",
      "abstract": "The compliance with the navigation rules plays a primary role in the development of routing algorithms to be applied in autonomous navigation. For such a reason this paper presents the mathematical formulations necessary to implement the Collision Regulations (COLREGs) within a previously developed ship path planning algorithm. The proposed approach is designed to be part of a decision support system for the bridge operators, in order to enhance traditional navigation; or, looking forward, to be part of the autonomous ship guidance system. Unlike other approaches that can be found in the scientific literature, the proposed work relies on the algebra of vectors, in order to describe the different scenarios as provided for in the COLREGs. The formulations to handle: head-on, crossing and overtaking, are formalized, described in detail and discussed. Eventually, some test cases are presented to show the effectiveness of the implementation of the proposed modeling into a Rapidly-exploring Random Tree (RRT∗) algorithm. A simplified ship simulator is embedded in the algorithm to generate feasible solutions, taking into account the ship's manoeuvring capability.",
      "citations": 51,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85066424140",
      "title": "A diesel engine modelling approach for ship propulsion real-time simulators",
      "doi": "10.3390/jmse7050138",
      "venue": "Journal of Marine Science and Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "7",
      "issue_id": "5",
      "pages": null,
      "issn": null,
      "eIssn": "20771312",
      "source_id": "21100830140",
      "authors": "Altosole Marco; Campora Ugo; Figari Massimo; Laviola Michele; Martelli Michele",
      "author_ids": "13006187800;6508251998;6507282370;56046632000;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Altosole M.",
      "keywords": "Computation time | Cylinder dynamics | Diesel engine | Real-time simulation | Ship propulsion",
      "abstract": "A turbocharged diesel engine numerical model, suitable for real-time ship manoeuvre simulation, is presented in this paper. While some engine components (mainly the turbocharger, intercooler and manifolds) are modelled by a filling and emptying approach, the cylinder simulation is based on a set of five-dimensional numerical matrices (each matrix is generated by means of a more traditional thermodynamic model based on in-cylinder actual cycle). The new cylinder calculation approach strongly reduces the engine transient computation time, making it possible to transform the simulation model into a real-time executable application. As a case study, the simulation methodology is applied to a high speed four stroke turbocharged marine diesel engine, whose design and off design running data are available from the technical sheet. In order to verify the suitability of the proposed model in real-time simulation applications, a yacht propulsion plant simulator is developed. Numerical results in ship acceleration and deceleration manoeuvres are shown, reducing the simulation running time of 99% in comparison with the corresponding in-cylinder actual cycle engine model.",
      "citations": 37,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 75,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 73,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 72,
              "rank": 77,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 53,
              "rank": 43,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 46,
              "rank": 165,
              "quartile": "Q3"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 46,
              "rank": 117,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85069226288",
      "title": "Motion control for autonomous navigation in blue and narrow waters using switched controllers",
      "doi": "10.3390/jmse7060196",
      "venue": "Journal of Marine Science and Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "7",
      "issue_id": "6",
      "pages": null,
      "issn": null,
      "eIssn": "20771312",
      "source_id": "21100830140",
      "authors": "Alessandri Angelo; Donnarumma Silvia; Martelli Michele; Vignolo Stefano",
      "author_ids": "7005735677;55350308600;55521641400;6602505719",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Alessandri A.",
      "keywords": "Low-speed maneuvering | Marine simulation | Motion control",
      "abstract": "Autonomous ships represent one of the new frontiers of technological innovation in marine engineering, which demand the development of innovative control systems to guarantee efficient and safe navigation of vessels. A convenient control system should be able to command the several actuators installed on board in different conditions-for instance, during oceanic navigation, harbor approach, narrow channels, and crowed areas. Such tasks are accomplished by different switching controllers for high and low speed motion, which have to be orchestrated to ensure an effective maneuvering. An approach to the design of hierarchies of controllers for maneuvering and navigation of ships equipped with a standard propulsion configuration in both blue and narrow water is proposed. Different levels of control, from global to local, are defined and integrated to steer the vessel in such a way to increase the maneuvering capability in various scenarios.",
      "citations": 26,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 75,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 73,
              "rank": 110,
              "quartile": "Q2"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 72,
              "rank": 77,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 53,
              "rank": 43,
              "quartile": "Q2"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 46,
              "rank": 165,
              "quartile": "Q3"
            },
            {
              "subject": "Water Science and Technology",
              "percentile": 46,
              "rank": 117,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85031816570",
      "title": "Design and Validation of Dynamic Positioning for Marine Systems: A Case Study",
      "doi": "10.1109/JOE.2017.2732298",
      "venue": "IEEE Journal of Oceanic Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2018,
      "volume": "43",
      "issue_id": "3",
      "pages": "677-688",
      "issn": "03649059",
      "eIssn": null,
      "source_id": "17277",
      "authors": "Donnarumma Silvia; Figari Massimo; Martelli Michele; Vignolo Stefano; Viviani Michele",
      "author_ids": "55350308600;6507282370;55521641400;6602505719;58090077400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Donnarumma S.",
      "keywords": "Dynamic positioning | environmental disturbances | propulsion modeling | simulation-based design",
      "abstract": "The design of a dynamic positioning (DP) system is a challenging task with several technical fields involved in the problem solution. Numerical simulation is a powerful tool to aid the designer during the system development and to speed up the design process. This paper presents the simulation methodology adopted to design and test the DP system for a vessel with a standard propulsion configuration. Simulation results and sea trial measurements are compared to illustrate the reliability of the proposed simulation platform.",
      "citations": 40,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 90,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 88,
              "rank": 88,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 86,
              "rank": 135,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 87,
              "rank": 76,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 82,
              "rank": 117,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85087607228",
      "title": "A new escort tug family designed to anticipate new safety requirements and operational needs",
      "doi": "10.3233/978-1-61499-870-9-986",
      "venue": "Technology and Science for the Ships of the Future Proceedings of Nav 2018 19th International Conference on Ship and Maritime Research",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": null,
      "issue_id": null,
      "pages": "986-993",
      "issn": null,
      "eIssn": null,
      "source_id": "21101023871",
      "authors": "Figari Massimo; Martinelli Luca; Martelli Michele; Enoizi Lucia; Piaggio Benedetto",
      "author_ids": "6507282370;57203641272;55521641400;57204365897;57204360929",
      "authorAffiliationIds": "60025153;110039644;60025153;110039644;60025153",
      "corresponding": "Figari M.",
      "keywords": "Escort tug | Maneuvrability | Simulation | Tug",
      "abstract": "The aim of the paper is to describe an industry-academic collaboration to conduct a research project whose main goal is the design of a new escort tug family characterized by high intact/damage stability margins, good maneuvering capability and stable behavior during escort indirect assistance. The project is focused on three main research areas: hydrodynamic design and internal subdivision of the hull, simulation of the escort capabilities in different operational scenario, development of control logics that will allow autonomous or unmanned operations. The paper describes the methodological approach adopted for the design and will show some preliminary results. The tug has been designed to be in compliance with new amendments of the 2008 Intact Stability Code (Res. MSC.415(97)) which will enter into force on 1st January 2020) both for towing and for escort operations. Furthermore, a significant step towards enhancement of ship's safety is granted by tug's capability to withstand a damage in accordance with criteria applicable to OSVs. This paper describes the prototype hull and its stability characteristics. CFD calculations and towing tank tests have been performed in order to assess the hull design and to infer simulation models able to describe the behavior of a family of vessels. In particular, the propulsion and maneuverability aspects in escort operations are deeply investigated. Results of the project will form the bases for the conceptual application to a remotely controlled or autonomous escort tug.",
      "citations": 3,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85079251106",
      "title": "A random sampling based algorithm for ship path planning with obstacles",
      "doi": "10.24868/issn.2631-8741.2018.018",
      "venue": "Proceedings of the International Ship Control Systems Symposium",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "1",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "26318741",
      "source_id": "21101052918",
      "authors": "Zaccone R.; Martelli M.",
      "author_ids": "56717793100;55521641400",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": "Collision Avoidance | Path Planning | RRT* | Ship Simulator",
      "abstract": "The paper presents a path planning algorithm for ship guidance in presence of obstacles, based on an ad hoc modified version of the Rapidly-exploring Random Tree (RRT*) algorithm. The proposed approach is designed to be part of a decision support system for the bridge operators, in order to enhance traditional navigation. Focusing on the maritime field, a review of the scientific literature dealing with motion planning is presented, showing potential benefits and weaknesses of the different approaches. Among the several methods, details on RRT and RRT* algorithms are given. The ship path planning problem is introduced and discussed, formulating suitable cost functions and taking into account both topological and kinematic constraints. Eventually, an existing time domain ship simulator is used to test the effectiveness of the proposed algorithm over a number of realistic operation scenarios. The obtained results are presented and critically discussed.",
      "citations": 24,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 20,
              "rank": 793,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 20,
              "rank": 93,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 14,
              "rank": 327,
              "quartile": "Q4"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 9,
              "rank": 174,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85055354752",
      "title": "Escort tug hydrodynamic forces estimation in a design framework: From model test to manoeuvrability simulation",
      "doi": "10.1115/OMAE2018-78052",
      "venue": "Proceedings of the International Conference on Offshore Mechanics and Arctic Engineering OMAE",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "11B",
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "91440",
      "authors": "Piaggio Benedetto; Viviani Michele; Martelli Michele",
      "author_ids": "57204360929;58090077400;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Piaggio B.",
      "keywords": null,
      "abstract": "The manoeuvring capabilities of an escort tug are essential key-features with a view to an all-around design approach devoted to an optimum oriented framework. From the hull geometry settlement and propulsive solution definition, the ability to predict thoroughly the operative life in terms of handling, effectiveness, and safety becomes fundamental, even more with the perspective of developing smart control logics supporting the masters. With such an aim, the availability of a reliable manoeuvrability model is of fundamental importance. In this context, it is important to define an optimum set of captive manoeuvrability tests, whether experimental or numerical, in order to correctly identify the vessel escort performances in simulation; this, always keeping in mind the necessity to limit the effort in view of an application at an early-design stage. Starting from a wide experimental matrix, purposely designed and realized, the present investigation focuses on the quality and robustness of the different regression manoeuvrability models by letting vary the subsets of tests, in order to determine, finally, which is the most suitable hull model to be adopted and which is the minimum set to be performed.",
      "citations": 13,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85053479460",
      "title": "An optimization tool for ship route planning in real weather scenarios",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "2018-June",
      "issue_id": null,
      "pages": "738-744",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Zaccone Raphael; Figari Massimo; Martelli Michele",
      "author_ids": "56717793100;6507282370;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Zaccone R.",
      "keywords": "Dynamic programming | Ship propulsion | Ship simulation | Voyage optimization | Weather routing",
      "abstract": "Rough weather conditions can significantly affect the ship's operational capabilities, in terms of energy efficiency, safety, and comfort on board. With the aim to improve both the ship energy efficiency and the operability, the authors developed a voyage optimization methodology based on real weather forecast maps. This paper presents an overview of the different aspects of the voyage optimization, focusing on the operational implications of the developed method. The routing problem is parameterized in a discrete space-time domain, and the minimum fuel consumption routing solution is selected by means of a dynamic programming optimization algorithm, in compliance with the existing geographical, propulsive and operability constraints. Ship seakeeping and propulsion system is modelled to realistically estimate the propulsion performances and fuel consumption, as well as a number of ship motions-related operability indices, associated with a given sea state and wind condition. Eventually, a case study is shown, and a number of simulations in different operating scenarios are critically discussed.",
      "citations": 16,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 31,
              "rank": 64,
              "quartile": "Q3"
            },
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 28,
              "rank": 146,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 24,
              "rank": 442,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85041485618",
      "title": "Holistic modeling of the global propulsion energy index in waves for small craft",
      "doi": "10.17736/ijope.2017.mk54",
      "venue": "International Journal of Offshore and Polar Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2017,
      "volume": "27",
      "issue_id": "4",
      "pages": "442-447",
      "issn": "10535381",
      "eIssn": null,
      "source_id": "20452",
      "authors": "Martelli Michele; Vernengo Giuliano; Bruzzone Dario; Notti Emilio",
      "author_ids": "55521641400;37662376400;6602292559;56045283900",
      "authorAffiliationIds": "60025153;60025153;60025153;60007525",
      "corresponding": "Martelli M.",
      "keywords": "Added resistance | Boundary element method (BEM) | Decision support system | Energy efficiency | Fishery | Fuel consumption",
      "abstract": "In the international regulation framework, the energy-efficient operation of ships is becoming standard. In this respect, restrictions on new construction appear to encourage improvement to existing vessels often equipped with outdated technologies. One of the relevant aspects of propulsion plant design and fleet management is the propulsion need to accomplish the design requirements in a wide set of sea states or in conflicting operative conditions (e.g., laden/ballast, sailing/trawling), requiring very different performances. A preliminary assessment of the energy efficiency of the ship system is then crucial for optimizing both the operating costs and the impact on the sea environment. A new efficiency assessment method that includes engine fuel consumption evaluated by ad hoc statistic regressions and ship resistance in calm water and in waves computed by a 3-D boundary element method is proposed. An application to a hard-chine 18 m trawler is proposed as part of a wider decision support system or weather routing algorithm.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 34,
              "rank": 77,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 33,
              "rank": 487,
              "quartile": "Q3"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 29,
              "rank": 294,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Mechanical Engineering",
              "percentile": 39,
              "rank": 349,
              "quartile": "Q3"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 39,
              "rank": 57,
              "quartile": "Q3"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 36,
              "rank": 181,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85020982629",
      "title": "Real-Time model-based design for CODLAG propulsion control strategies",
      "doi": "10.1016/j.oceaneng.2017.06.029",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2017,
      "volume": "141",
      "issue_id": null,
      "pages": "265-276",
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Martelli M.; Figari M.",
      "author_ids": "55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "CODLAG | Control system | Hardware in the loop | Marine propulsion plant | Model-based design | Ship simulation",
      "abstract": "Design and optimization of propulsion control strategies is a crucial part of ship design. In fact, propulsion plant behaviour is greatly influenced by the control system dynamics. Acceleration, deceleration, crash stop, heavy turning are some examples of transient conditions that a propulsion plant has to sustain whilst maintaining optimal performance without reducing ship safety and reliability. In this paper, the methodology and the simulation models needed to design the propulsion control logics for an innovative CODLAG propulsion plant are discussed. The methodology is based on the RT-HIL already used by the authors in a previous naval ship project and consists in the development of the propulsion control logics in a virtual environment. In order to increase the reliability of the results new and more detailed ship simulation models have been developed and their validation discussed in the paper. Thanks to this methodology, it is possible to test the control system under different operational conditions off-line, ashore in the office, without any hazards for the real system. The overall design time is reduced and this allows reduction in the time and the related cost of the sea trials for the final commissioning. At the end of this paper, sea trials results are shown to demonstrate the effectiveness of the proposed approach.",
      "citations": 34,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 15,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 73,
              "rank": 31,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85016457628",
      "title": "Propulsion control strategies for ship emergency manoeuvres",
      "doi": "10.1016/j.oceaneng.2017.03.053",
      "venue": "Ocean Engineering",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2017,
      "volume": "137",
      "issue_id": null,
      "pages": "99-109",
      "issn": "00298018",
      "eIssn": null,
      "source_id": "28339",
      "authors": "Altosole M.; Martelli M.",
      "author_ids": "13006187800;55521641400",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Altosole M.",
      "keywords": "Crash stop | Engine | Propeller pitch | Ship propulsion control | Simulation based design | Slam start",
      "abstract": "This work deals with the propulsion control aspects relating to some of the most critical emergency manoeuvres of a ship: slam start and crash stop. In these particular situations a very important role is played by the automation system that has to manage the whole propulsive chain (i.e. main engine, mechanical transmission and propeller) in a safe and efficient way. With regard to this, a simulation based design methodology is adopted to develop and test new control schemes for ship propulsion. The proposed control layout is applicable to any type of propulsion systems equipped with controllable pitch propellers, since it is mainly based on the automatic adjustment of the propeller pitch. Thus the desired performance requirements are met through adaptive control strategies able to address the complex issues of slam start, crash stop and similar stressful manoeuvres. The adaptivity of the automation process to several critical propulsive conditions reduces significantly the number of the control parameters to be estimated, as recently demonstrated by the automation design of a new twin-screw ship. For this application, the comparison between simulation results and sea trials data is finally shown for validation design purposes.",
      "citations": 25,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 95,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 83,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 84,
              "rank": 15,
              "quartile": "Q1"
            },
            {
              "subject": "Environmental Engineering",
              "percentile": 73,
              "rank": 31,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85055317705",
      "title": "Manoeuvring model and simulation of the non-linear dynamic interaction between tethered ship and tug during escort",
      "doi": null,
      "venue": "Maritime Transportation and Harvesting of Sea Resources",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": "1",
      "issue_id": null,
      "pages": "95-104",
      "issn": null,
      "eIssn": null,
      "source_id": "21100886381",
      "authors": "Piaggio B.; Martelli M.; Viviani M.; Figari M.",
      "author_ids": "57204360929;55521641400;58090077400;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Piaggio B.",
      "keywords": null,
      "abstract": "When dealing with towing and Escort operations—indissolubly—a wider and complete modelling of the involved dynamics becomes fundamental, on both ship and tug side, even more so making unavoidable the need of correctly ponder the cables constraining coupling. With the aim to better understand the peculiarities of tug-ship interaction, a 6-DOF time domain simulator comprehensive of the propulsion dynamics has been developed, across the inter-connection imposed by the towing-line. Particular attention is focused on discovering the operational capabilities of the tug in exerting a force on the assisted ship during Escort, and the subsequent great influence that the reaction makes on the tug handling and effectiveness. A conceptual and critical discussion stands out, preparing the ground to future design strategies and hinting different solutions to be investigated, directly facing the operative profile of the vessel.",
      "citations": 10,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85053838368",
      "title": "Numerical and experimental investigation for the performance assessment of full electric marine propulsion plant",
      "doi": null,
      "venue": "Maritime Transportation and Harvesting of Sea Resources",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": "1",
      "issue_id": null,
      "pages": "87-93",
      "issn": null,
      "eIssn": null,
      "source_id": "21100886381",
      "authors": "Martelli M.; Figari M.",
      "author_ids": "55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": null,
      "abstract": "The advantage of hybrid diesel-electric propulsion is well known in terms of fuel consumption, especially for ships with variegated speed profiles or with different propulsion loads. Nowadays several hybrid configurations are available and in the preliminary design phase, the selection of the best configuration among several options could be a time-consuming task. Therefore, in this paper, a methodology is proposed, based on the main propulsion design parameters, to identify the global ship energy efficiency in function of the operational profile, considering both design and off-design conditions. In order to validate the method, a sea trial campaign has been done and the records have been analyzed. The developed tool helps, during the design phase, to choose the optimal propulsion configuration, number, type, and size, of the main engines and generators. The methodology is used to compare two design solutions, a conventional diesel propulsion and a proposed full electric plant using a ‘father and son’ power generation.",
      "citations": 7,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85015378566",
      "title": "Preliminary design of the hybrid propulsion architecture for the research vessel \"G. Dallaporta\"",
      "doi": "10.1109/ESARS-ITEC.2016.7841342",
      "venue": "2016 International Conference on Electrical Systems for Aircraft Railway Ship Propulsion and Road Vehicles and International Transportation Electrification Conference Esars Itec 2016",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "21101179807",
      "authors": "Capasso C.; Veneri O.; Notti E.; Sala A.; Figari M.; Martelli M.",
      "author_ids": "35328966800;8696403200;56045283900;7101706705;6507282370;55521641400",
      "authorAffiliationIds": "60083730;60083730;60007525;60007525;60025153;60025153",
      "corresponding": "Capasso C.",
      "keywords": "hybrid ship | marine energy generation systems | marine propulsion plant",
      "abstract": "This paper presents energy and power evaluations on propulsion and generation systems related to a research vessel, named G. DALLAPORTA. This vessel is used by the National Research Council of Italy for oceanographic campaigns, which are generally carried out in the Mediterranean Sea. The analysis is based on measurements of the main electrical and mechanical parameters, related to on board propulsion, oleodynamic and electric auxiliary systems, with reference to the original thermal configuration of the ship. These preliminary results, obtained through theoretical methodology, make possible the identification of a designing procedure for the hybridization of this vessel, in order to respect the international marine standards, in terms of emissions and safety procedures.",
      "citations": 31,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84994741708",
      "title": "A simulation approach for planing boats propulsion and manoeuvrability",
      "doi": "10.3940/rina.ijsct.2016.b1.180",
      "venue": "Transactions of the Royal Institution of Naval Architects Part B International Journal of Small Craft Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2016,
      "volume": "158",
      "issue_id": null,
      "pages": "B-27-B-42",
      "issn": "17400694",
      "eIssn": null,
      "source_id": "5000154004",
      "authors": "Ircani A.; Martelli M.; Viviani M.; Altosole M.; Podenzana-Bonvino C.; Grassi D.",
      "author_ids": "57191916408;55521641400;58090077400;13006187800;6507106439;36630335500",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;119025636",
      "corresponding": "Ircani A.",
      "keywords": null,
      "abstract": "A comprehensive approach to modelling and simulation of high speed craft dynamics during turning circle and zig-zag manoeuvres is presented in this paper. The high performance requirements for propulsion systems and the increasing attention being paid to planing hull manoeuvring features suggest the need for a thorough investigation into ship dynamics, starting in the preliminary design phase. Dynamic aspects of planing craft during manoeuvres cannot be adequately dealt with by traditional methodologies and purely steady state approaches. For this reason, the boat's dynamic behaviour is evaluated by means of a time domain simulator, able to represent the hull dynamics, including the mutual interactions with the propulsion system and propulsion controller. Manoeuvrability characteristics are simulated on the basis of captive model tests on planing hulls available in open literature. Compared with previous similar studies, in the present work a possible strategy is introduced to represent roll motion due to the propulsion and steering effects. Finally, the simulation results are compared with sea trial records in order to highlight the capabilities and shortcomings of the proposed method. The case study analysed is a boat equipped with two azimuthal propulsors driven by two highspeed diesel engines that ensure a speed up to 32.5 kn.",
      "citations": 14,
      "quartile": [
        {
          "year": 2016,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 18,
              "rank": 71,
              "quartile": "Q4"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 10,
              "rank": 232,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84987917208",
      "title": "Overall efficiency assessment of a trawler propulsion system based on hydrodynamic performance computations",
      "doi": null,
      "venue": "Proceedings of the International Offshore and Polar Engineering Conference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": "2016-January",
      "issue_id": null,
      "pages": "875-882",
      "issn": "10986189",
      "eIssn": "15551792",
      "source_id": "77392",
      "authors": "Martelli Michele; Vernengo Giuliano; Bruzzone Dario; Notti Emilio",
      "author_ids": "55521641400;37662376400;6602292559;56045283900",
      "authorAffiliationIds": "60025153;60025153;60025153;60007525",
      "corresponding": "Martelli M.",
      "keywords": "Added resistance in waves | Boundary element method (BEM) | Decision support system | Energy efficiency | Fishery | Fuel consumption",
      "abstract": "The energy efficiency evaluation of trawlers becomes more and more relevant as the trend of the government laws follows the path of restrictions to new constructions to encourage improvement to existing vessels, often equipped with outdated technologies. The two conditions a trawler need to meet during its operations, namely the sailing and the trawling phases, require in principle very different performances. Despite the higher speed reached when cruising from ports to fishing grounds, this type of ships experiences increased resistance as well as heavy loaded propellers during the trawling operations at low speed. In the light of the specific tasks of such a kind of vessel, a preliminary assessment of the energy efficiency of the ship-system is of crucial interest to optimize both the operating costs and the impact on the sea environment. In this context, hydrodynamic performances and the propulsion system have direct consequences on the fuel consumption, hence on the operational costs of the vessel. In the proposed model, the engine fuel consumption is evaluated by suitable statistic regression to account for the prime mover performance into the propulsion chain. Ship resistance in calm water and added resistance due to rough sea conditions are computed by a Boundary Element Method. Both are then integrated into the global efficiency assessment method. An application of energy efficiency assessment and optimization of a hard-chine 18 meters trawler is presented. The final results are shown as part of a wider decision support system to optimize the overall performance of the vessel operation in different environmental conditions.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 16,
              "rank": 273,
              "quartile": "Q4"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 13,
              "rank": 101,
              "quartile": "Q4"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 11,
              "rank": 650,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2016,
          "subjects": [
            {
              "subject": "Energy Engineering and Power Technology",
              "percentile": 32,
              "rank": 128,
              "quartile": "Q3"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 28,
              "rank": 63,
              "quartile": "Q3"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 27,
              "rank": 395,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84957713108",
      "title": "Marine propulsion simulation",
      "doi": null,
      "venue": "Marine Propulsion Simulation",
      "type": "Book",
      "sub_type": "Book",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": "1-104",
      "issn": null,
      "eIssn": null,
      "source_id": "21100444539",
      "authors": "Martelli Michele",
      "author_ids": "55521641400",
      "authorAffiliationIds": "60025153",
      "corresponding": "Martelli M.",
      "keywords": null,
      "abstract": "The propulsion system behaviour is a key aspect for the overall dynamics of a ship. However, despite its great importance, numerical methodologies for detailed investigations on marine propulsion dynamics are not yet widely covered in scientific literature. This book presents the main steps for the development of a multi-physic simulation platform, able to represent the motions of a twin screw ship in six degrees of freedom, taking into account the whole propulsion system and automation effects. A number of mathematical sub-models had been developed and calibrated by a set of experimental tests, in model and full scale. Finally, the sea trials campaign of a ship is used to validate and tune the developed simulator. The proposed simulation methodology can be used in the ship preliminary design phase, in order to plan and test the propulsion system and automation. Further applications can include the design optimization and crew training.",
      "citations": 38,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85100125962",
      "title": "System control design of autopilot and speed pilot for a patrol vessel by using lmis",
      "doi": "10.1201/b18855-76",
      "venue": "Towards Green Marine Technology and Transport Proceedings of the 16th International Congress of the International Maritime Association of the Mediterranean Imam 2015",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": "577-583",
      "issn": null,
      "eIssn": null,
      "source_id": "21101081684",
      "authors": "Alessandri A.; Donnarumma S.; Vignolo S.; Figari M.; Martelli M.; Chiti R.; Sebastiani L.",
      "author_ids": "7005735677;55350308600;6602505719;6507282370;55521641400;56845710200;16022741600",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;121267422;121267422",
      "corresponding": "Alessandri A.",
      "keywords": null,
      "abstract": "Heading and speed control for a patrol vessel is addressed by using simple PID regulators. The selection of the PID parameters for both controllers is accomplished by using decoupled linearized model of the original motion equations and LMIs as a design tool. The effectiveness of the resulting controllers is validated on the original dynamic equations and with the presence of external disturbances such as wind, waves, and current.",
      "citations": 24,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85012870906",
      "title": "Reverse engineering techniques for trawler hull 3D modelling and energy efficiency evaluation",
      "doi": null,
      "venue": "18th International Conference on Ships and Shipping Research Nav 2015",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": "1050-1060",
      "issn": null,
      "eIssn": null,
      "source_id": "21100795196",
      "authors": "Tassetti Anna Nora; Martelli Michele; Buglioni Gabriele",
      "author_ids": "57199423078;55521641400;6504551335",
      "authorAffiliationIds": "60021199;60025153;60021199",
      "corresponding": "Tassetti A.",
      "keywords": null,
      "abstract": "A large number of fishing vessels is not so efficient due to outdated technologies. Nevertheless, European Commission restrictions prevent new constructions, chiefly relating the major opportunities for reducing fuel consumption to retrofitting existing vessels. Improving the fishing vessel's efficiency at acceptable levels calls for technical interventions, these last are hard to be planned without basic information regarding the hull and the machineries installed on-board. In fact, in most of case construction plan, propeller drawings and engine performance maps are often not available to the designer. These lack do not allow for hydrodynamic and propulsion optimisations. In this context, a reverse engineering procedure is needed to first measure and then to reconstruct the shape, dimension and semantic information of the ship hull, rudder and propeller. The photogrammetric technique is employed for obtaining dense and accurate 3D models of free form vessel surfaces from digital images in accurate, flexible and economical way. At the same time, a manual measurement campaign is developed and carried out to scale and validate the photogrammetric model somewhere dealing with critical issues such as poor light/visibility and obstructed space around the object. Both imaged-based and direct measurement methodologies for 3D reverse ship hull modelling are proposed and critically compared to evaluate and choose the most appropriate and cost-effective re-engineering method for the studied shipbuilding ashore application. Eventually, the data coming from the photogrammetric model has been used to characterise the vessel. This is the first working step to study a possible technical action to increase the vessel energy efficiency.",
      "citations": 7,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84941730047",
      "title": "Dynamic positioning system of a vessel with conventional propulsion configuration: Modeling and simulation",
      "doi": "10.1201/b17494-97",
      "venue": "Maritime Technology and Engineering Proceedings of Martech 2014 2nd International Conference on Maritime Technology and Engineering",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": "725-734",
      "issn": null,
      "eIssn": null,
      "source_id": "21100991068",
      "authors": "Alessandri A.; Donnarumma S.; Luria G.; Martelli M.; Vignolo S.; Chiti R.; Sebastiani L.",
      "author_ids": "7005735677;55350308600;54946168800;55521641400;6602505719;56845710200;16022741600",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;109536273;109536273",
      "corresponding": "Alessandri A.",
      "keywords": null,
      "abstract": "A simulation model of the DP system for a conventional naval configuration is presented. A complete mathematical description of the dynamically positioned vessel is developed, including distinct models for low- and wave-frequency ship motions, slowly-varying wind and wave forces, and mechanical constraints on the actuators. A specific allocation logic is devised for such a configuration, by using a linear hydrodynamic model of the propeller-rudder interaction. An anti-windup control-loop correction is designed to improve the DP controller performance. Eventually, simulation results are described to illustrate the effectiveness of the DP system.",
      "citations": 19,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84938865811",
      "title": "Numerical models for ship dynamic positioning",
      "doi": null,
      "venue": "Marine 2015 Computational Methods in Marine Engineering Vi",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": "1078-1088",
      "issn": null,
      "eIssn": null,
      "source_id": "21100403413",
      "authors": "Donnarumma S.; Martelli M.; Vignolo S.",
      "author_ids": "55350308600;55521641400;6602505719",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Donnarumma S.",
      "keywords": "Dynamic positioning | Model-based design | Propulsion plant | Ship | Simulation",
      "abstract": "One of the best ways to design marine control systems before the construction of a ship is the use of simulation techniques. The paper presents two numerical models used to develop and test, in the preliminary design phase, a dynamic positioning (DP) system for marine vehicles. In particular, it refers to a surface vessel equipped with a conventional propulsion configuration, consisting of two controllable pitch propellers, two rudders and a single bow-thruster. For such a vessel, the DP system is required to manage the actuators in order to obtain a good dynamic positioning performance at zero-speed with moderate weather conditions. In order to verify control and allocation logics, two numerical models, with different degrees of details, have been developed and used in distinct steps. Several sub-systems as ship dynamics, propulsion plant, controller and environmental disturbances have been implemented making use of suitable mathematical models linked each other in order to take into account their mutual interactions. Eventually, simulation results are shown and critically compared in order to better understand the points of strength and weakness of the two proposed models.",
      "citations": 11,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84927770471",
      "title": "Numerical modelling of propulsion, control and ship motions in 6 degrees of freedom",
      "doi": "10.1177/1475090214544181",
      "venue": "Proceedings of the Institution of Mechanical Engineers Part M Journal of Engineering for the Maritime Environment",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2014,
      "volume": "228",
      "issue_id": "4",
      "pages": "373-397",
      "issn": "14750902",
      "eIssn": "20413084",
      "source_id": "25596",
      "authors": "Martelli Michele; Viviani Michele; Altosole Marco; Figari Massimo; Vignolo Stefano",
      "author_ids": "55521641400;58090077400;13006187800;6507282370;6602505719",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Manoeuvrability | Marine engine | Propulsion control simulation | Rudder | Sea trials | Ship motions",
      "abstract": "This work presents the main steps for the development of a multi-physic simulation platform, able to represent the dynamics of a twin-screw ship in 6 degrees of freedom, taking into account the complete propulsion system including automation effects. The simulation platform has to be used in the preliminary design phase in order to study and design the propulsion plant and its control system. The ship motion model has been developed including roll motion, in order to capture the ship heel angles during tight turning circles, which may be significant for a fast naval vessel. Moreover, the simulation model includes a simplified representation of the asymmetric behaviour of the two propeller shafts during manoeuvres, which cannot be neglected when dealing with the propulsion plant behaviour. Several sub-models have been developed and calibrated by means of a set of experimental tests, in model and full scale. The sea trial campaign is finally used to validate and tune the developed simulator; thus, the final version may be adopted as an optimization tool for other future designs (or sister ships) and training purposes. Although the presented case study has been validated on a specific ship, most of the discussed models have a general application.",
      "citations": 55,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 68,
              "rank": 37,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 66,
              "rank": 249,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2014,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 65,
              "rank": 30,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 59,
              "rank": 212,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84894418698",
      "title": "Simulation study on the interaction between sailing and motor propulsion to optimize performance and control of the tall ship \"Amerigo Vespucci\"",
      "doi": null,
      "venue": "Developments in Maritime Transportation and Exploitation of Sea Resources Proceedings of Imam 2013 15th International Congress of the International Maritime Association of the Mediterranean",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2014,
      "volume": "1",
      "issue_id": null,
      "pages": "575-582",
      "issn": null,
      "eIssn": null,
      "source_id": "21100286947",
      "authors": "Altosole M.; Figari M.; Martelli M.; Passano L.; Rocca M.; Giuliano M.; Piva L.",
      "author_ids": "13006187800;6507282370;55521641400;56046677200;56044957400;57197635695;55371679900",
      "authorAffiliationIds": "60025153;60025153;60025153;60081931;60081931;109885832;109885832",
      "corresponding": "Altosole M.",
      "keywords": null,
      "abstract": "The paper presents an integrated simulation approach, combining CFD and time-domain simulation techniques in order to represent the interaction between motor and sailing propulsion of the tall ship Amerigo Vespucci. Through a complete propulsion and generation system retrofitting, the ship will be equipped with a new electric propulsion motor, to be used not only for the motor propulsion but possibly also during the sailing navigation. A newly developed control system will drive the propeller to the \"zero-thrust\" condition during sailing, for every wind direction and force. Feasibility and benefits of this propulsion option are investigated by means of a motor-sailing propulsion simulator based on the CFD analysis carried out for the evaluation of the soft sails aerodynamics. © 2014 Taylor & Francis Group, London.",
      "citations": 5,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84906279798",
      "title": "Performance decay analysis of a marine gas turbine propulsion system",
      "doi": "10.5957/JOSR.58.3.130037",
      "venue": "Journal of Ship Research",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2014,
      "volume": "58",
      "issue_id": "3",
      "pages": "117-129",
      "issn": "00224502",
      "eIssn": "15420604",
      "source_id": "25663",
      "authors": "Altosole Marco; Campora Ugo; Martelli Michele; Figari Massimo",
      "author_ids": "13006187800;6508251998;55521641400;6507282370",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Altosole M.",
      "keywords": "Gas turbine | Maintenance | Performance decay | Pollutant emissions | Ship propulsion | Simulation",
      "abstract": "Marine propulsion plants are designed to be more and more efficient to minimize fuel consumption and pollution emissions. However, during the ship operating life, propulsion components and hull are characterized by a certain performance decay, responsible for a worse behavior of the overall propulsion plant. For this reason, the several propulsion components are periodically subjected to expensive maintenance works to restore, as far as possible, their original design characteristics. In the present study, the propulsive performance variation of a naval vessel, powered by a gas turbine as part of an innovative CODLAG system, is simulated and analyzed by means of a detailed and validated numerical code. A sensitivity analysis regarding the influence of the main components deterioration (gas turbine, propellers, and ship hull) on the overall behavior of the propulsion plant is carried out. Several speed profiles of the vessel have been analyzed in terms of the usual performance parameters (ship speed, engine power, and fuel consumption) as well as the pollution emissions of the gas turbine. The main aim of the work is to get useful information for the ship management and maintenance scheduling (condition-based maintenance).",
      "citations": 36,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Numerical Analysis",
              "percentile": 59,
              "rank": 37,
              "quartile": "Q2"
            },
            {
              "subject": "Applied Mathematics",
              "percentile": 59,
              "rank": 273,
              "quartile": "Q2"
            },
            {
              "subject": "Ocean Engineering",
              "percentile": 51,
              "rank": 57,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 48,
              "rank": 381,
              "quartile": "Q3"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 44,
              "rank": 231,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2014,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 77,
              "rank": 20,
              "quartile": "Q1"
            },
            {
              "subject": "Civil and Structural Engineering",
              "percentile": 75,
              "rank": 56,
              "quartile": "Q1"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 74,
              "rank": 134,
              "quartile": "Q2"
            },
            {
              "subject": "Applied Mathematics",
              "percentile": 67,
              "rank": 130,
              "quartile": "Q2"
            },
            {
              "subject": "Numerical Analysis",
              "percentile": 64,
              "rank": 15,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84900871276",
      "title": "Controllable pitch propeller actuating mechanism, modelling and simulation",
      "doi": "10.1177/1475090212468254",
      "venue": "Proceedings of the Institution of Mechanical Engineers Part M Journal of Engineering for the Maritime Environment",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2014,
      "volume": "228",
      "issue_id": "1",
      "pages": "29-43",
      "issn": "14750902",
      "eIssn": "20413084",
      "source_id": "25596",
      "authors": "Martelli Michele; Figari Massimo; Altosole Marco; Vignolo Stefano",
      "author_ids": "55521641400;6507282370;13006187800;6602505719",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Martelli M.",
      "keywords": "Controllable pitch propeller | Pitch mechanism | Ship propulsion | Simulation",
      "abstract": "This article focuses on the mathematical model of the pitch control mechanism for a marine controllable pitch propeller, with the aim of describing the dynamic behaviour of this kind of system and its influence on ship performance. Too great a load on the blades can result in high pressures in the actuating system, response delays and control system problems, which are ultimately responsible for most mechanism failures. The behaviour of the controllable pitch propeller actuating mechanism is considered in terms of blade position, oil pressures inside the controllable pitch propeller hub and magnitudes of the forces acting on the blades. In the proposed mathematical model, the forces acting on the propeller blade are evaluated taking into account the yaw motion of the ship, the propeller speed (including shaft accelerations and decelerations) and the turning of the blade during the pitch change. On the basis of the introduced procedure, a controllable pitch propeller numerical model as part of an overall propulsion and manoeuvrability simulator representing the dynamic behaviour of a twin-screw fast vessel is developed. The aim of this work is to represent the ship propulsion dynamics through time-domain simulation, based on which the designers can develop and test several design options, in order to avoid possible machinery overloads with their consequent failures and to obtain the best possible ship performances. In this aspect, the controllable pitch propeller model is an essential design tool. © IMechE 2013.",
      "citations": 51,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 68,
              "rank": 37,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 66,
              "rank": 249,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2014,
          "subjects": [
            {
              "subject": "Ocean Engineering",
              "percentile": 65,
              "rank": 30,
              "quartile": "Q2"
            },
            {
              "subject": "Mechanical Engineering",
              "percentile": 59,
              "rank": 212,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84891362895",
      "title": "Numerical analysis of the ship propulsion control system effect on manoeuvring characteristics in model and full scale marine 2013",
      "doi": null,
      "venue": "Computational Methods in Marine Engineering V Proceedings of the 5th International Conference on Computational Methods in Marine Engineering Marine 2013",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2013,
      "volume": null,
      "issue_id": null,
      "pages": "400-411",
      "issn": null,
      "eIssn": null,
      "source_id": "21100277019",
      "authors": "Altosole M.; Figari M.; Martelli M.; Nataletti M.; Vignolo S.; Viviani M.",
      "author_ids": "13006187800;6507282370;55521641400;55978646700;6602505719;58090077400",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Altosole M.",
      "keywords": "Control system | Marine propulsion plant | Model and full scale tests | Numerical simulation | Ship manoeuvrability",
      "abstract": "A comprehensive approach to simulate the interaction between the ship propulsion system and manoeuvrability, during transients and off design conditions, is presented. The increasing attention on the manoeuvring features of the vessel has forced designers to consider this aspect already in the preliminary stages of the project. Data about manoeuvring characteristics may be obtained by means of several model tests (at planar motion mechanism or with free running models). However, differences between model tests and full scale trials exist. From the hydrodynamic point of view, some disagreements are due to the scale effects but also the effect of the propulsion control system, highly non-linear, may provide a considerable contribution to such differences. These dynamical aspects cannot be taken into account with traditional methodologies and purely stationary approaches. For these reasons, the ship dynamic behaviour is evaluated by time domain simulators, developed by the authors, which include the ship dynamics, the propulsion plant dynamics and the propulsion control system logics. At the end of the paper some simulation results are shown in order to better understand the effects and the differences of the propulsion control settings on the ship manoeuvrability in model and full scale.",
      "citations": 3,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85054949955",
      "title": "Simulation study on the interaction between sailing and motor propulsion to optimize performance and control of the tall ship “Amerigo Vespucci”",
      "doi": null,
      "venue": "Developments in Maritime Transportation and Exploitation of Sea Resources",
      "type": "Book",
      "sub_type": "Book Chapter",
      "year": 2013,
      "volume": null,
      "issue_id": null,
      "pages": "575-582",
      "issn": null,
      "eIssn": null,
      "source_id": "21100881512",
      "authors": "Altosole M.; Figari M.; Martelli M.; Passano L.; Rocca M.; Giuliano M.; Piva L.",
      "author_ids": "13006187800;6507282370;55521641400;56046677200;56044957400;57197635695;55371679900",
      "authorAffiliationIds": "60025153;60025153;60025153;60081931;60081931;;",
      "corresponding": "Altosole M.",
      "keywords": null,
      "abstract": "The paper presents an integrated simulation approach, combining CFD and time-domain simulation techniques in order to represent the interaction between motor and sailing propulsion of the tall ship Amerigo Vespucci. Through a complete propulsion and generation system retrofitting, the ship will be equipped with a new electric propulsion motor, to be used not only for the motor propulsion but possibly also during the sailing navigation. A newly developed control system will drive the propeller to the “zero-thrust” condition during sailing, for every wind direction and force. Feasibility and benefits of this propulsion option are investigated by means of a motor-sailing propulsion simulator based on the CFD analysis carried out for the evaluation of the soft sails aerodynamics.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84871028646",
      "title": "Time-domain simulation for marine propulsion applications",
      "doi": null,
      "venue": "Proceedings of the 2012 Summer Computer Simulation Conference Scsc 2012 Part of Summersim 2012 Multiconference",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2012,
      "volume": "44",
      "issue_id": "10",
      "pages": "36-43",
      "issn": null,
      "eIssn": null,
      "source_id": "21100223168",
      "authors": "Altosole M.; Figari M.; Martelli M.",
      "author_ids": "13006187800;6507282370;55521641400",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Altosole M.",
      "keywords": "Control system | Ship propulsion | Virtual reality",
      "abstract": "The propulsion system dynamics is a key aspect of the overall behavior of a ship, for safety as well for commercial aspects. However, despite its great importance, numerical methodologies for deep investigations about the marine propulsion dynamics are not widely covered in public literature. This paper presents an overview of the simulation methodologies, developed by the authors in recent years with the support of colleagues and technicians from Genoa University and marine industry, to design marine propulsion plants and their control systems. The aim is to point out the importance of the dynamic aspects that cannot be neglected when studying ship propulsion matters. © 2012 SIMULATION COUNCILS, INC.",
      "citations": 25,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84896845373",
      "title": "A mathematical model of the propeller pitch change mechanism for the marine propulsion control design",
      "doi": null,
      "venue": "Sustainable Maritime Transportation and Exploitation of Sea Resources Proceedings of the 14th International Congress of the International Maritime Association of the Mediterranean Imam 2011",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2012,
      "volume": "2",
      "issue_id": null,
      "pages": "649-656",
      "issn": null,
      "eIssn": null,
      "source_id": "21100291826",
      "authors": "Altosole M.; Martelli M.; Vignolo S.",
      "author_ids": "13006187800;55521641400;6602505719",
      "authorAffiliationIds": null,
      "corresponding": "Altosole M.",
      "keywords": null,
      "abstract": "The paper is mainly focused on the mathematical model of the control pitch mechanism for a marine controllable pitch propeller (CPP), able to perform the propeller blade position change and to give a proper information about the oil pressures, produced inside the CPP hub. In fact, too high pressures can be responsible for the mechanism failure, then they should be always under examination by the ship automation. With regard to the traditional representation of the few spindle torque data reported in literature, in the proposed mathematical model the transportation inertial forces and the Coriolis inertial forces acting on the propeller blade are evaluated taking into account the yaw motion of the ship, the propeller speed (including shaft accelerations and decelerations) and the blade turning during the pitch change. On the basis of the introduced procedure, it is developed the CPP model which is part of an overall propulsion simulator, representing the dynamic behaviour of a twin-screw fast vessel. The aim of the work is to represent the ship propulsion dynamics by time domain simulation, on the ground of which the automation designers can develop and test several propulsion control options. A brief description of the simulation approach adopted for the vessel crash stop is illustrated at the end of this paper. In particular, the propulsion control action is studied taking into account machinery performance and constraints, including also the control pitch mechanism feedback in terms of allowable forces and pressures. © 2012 Taylor & Francis Group, London, UK.",
      "citations": 14,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85017009662",
      "title": "Marine gas turbines pollutant emissions assessment",
      "doi": null,
      "venue": "Nav International Conference on Ship and Shipping Research",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2012,
      "volume": "0",
      "issue_id": null,
      "pages": null,
      "issn": "22828397",
      "eIssn": null,
      "source_id": "21100875435",
      "authors": "Altosole Marco; Benvenuto Giovanni; Campora Ugo; Martelli Michele; Bruga Luca",
      "author_ids": "13006187800;57197362695;6508251998;55521641400;57203634805",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Altosole M.",
      "keywords": null,
      "abstract": "Although gas turbines are less frequently used than diesel engines for ship propulsion and present generally lower emissions, the issue of estimating and reducing emissions is becoming topical also for this type of engine, because of the adoption of increasingly stringent regulations in the shipping sector. In the paper the authors propose corrections to be applied to some empirical equations, of the few published in literature, in order to improve their ability to calculate the extent of the main pollutants contained in exhaust gas of gas turbines. The improvements of the correlations have been based on the availability of a reliable and detailed database concerning the pollutant emissions, determined in a wide range of working conditions, of a naval, aero-derivative gas turbine. As shown in the paper, the improved correlations have allowed a consistent increase of the accuracy in quantifying the gas turbine emissions in every operating condition. As a first application of the study, the improved emission correlations have been included in a numerical simulator, already developed by the authors, for the CODLAG propulsion system of an Italian frigate. The simulation results relative to the main polluting substances emitted during some frigate maneuvers are presented and discussed in the paper.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-84916910545",
      "title": "Propulsion control optimisation for emergency manoeuvres of naval vessels",
      "doi": null,
      "venue": "Inec 2012 11th International Naval Engineering Conference and Exhibition",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2012,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "21100349575",
      "authors": "Altosole M.; Figari M.; Martelli M.; Orrù G.",
      "author_ids": "13006187800;6507282370;55521641400;56443939500",
      "authorAffiliationIds": "60025153;60025153;60025153;109536273",
      "corresponding": "Altosole M.",
      "keywords": null,
      "abstract": "Nowadays naval vessels are characterised by flexible and complex propulsion systems with powerful prime movers, the most powerful of which is often the gas turbine. The great power available to the propellers entails a careful power management for a safe operation in every propulsive condition, including emergency ship manoeuvres as slam start and crash stop. During these critical situations a very important role is played by the propulsion automation system, which has to manage and control the whole emergency manoeuvre in a safe and efficient way. The paper deals with the description of some proper control logic schemes to manage slam start and crash stop of the new frigates equipped with CODLAG propulsion system. The presented solution is proposed within the cooperation project between Genoa University and Seastema S.p.A., a global ship automation provider, aimed to design and optimise, by numerical simulation techniques, the propulsion control systems. The simulation results are shown and discussed, in order to justify the guidelines followed for the choice of some special control functions, acting during the most critical manoeuvres of the ship.",
      "citations": 12,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85069418751",
      "title": "A mathematical model of the propeller pitch change mechanism for the marine propulsion control design",
      "doi": null,
      "venue": "Sustainable Maritime Transportation and Exploitation of Sea Resources",
      "type": "Book",
      "sub_type": "Book Chapter",
      "year": 2011,
      "volume": null,
      "issue_id": null,
      "pages": "649-656",
      "issn": null,
      "eIssn": null,
      "source_id": "21100919791",
      "authors": "Altosole M.; Martelli M.; Vignolo S.",
      "author_ids": "13006187800;55521641400;6602505719",
      "authorAffiliationIds": null,
      "corresponding": "Altosole M.",
      "keywords": null,
      "abstract": "The paper is mainly focused on the mathematical model of the control pitch mechanism for a marine controllable pitch propeller (CPP), able to perform the propeller blade position change and to give a proper information about the oil pressures, produced inside the CPP hub. In fact, too high pressures can be responsible for the mechanism failure, then they should be always under examination by the ship automation. With regard to the traditional representation of the few spindle torque data reported in literature, in the proposed mathematical model the transportation inertial forces and the Coriolis inertial forces acting on the propeller blade are evaluated taking into account the yaw motion of the ship, the propeller speed (including shaft accelerations and decelerations) and the blade turning during the pitch change. On the basis of the introduced procedure, it is developed the CPP model which is part of an overall propulsion simulator, representing the dynamic behaviour of a twin-screw fast vessel. The aim of the work is to represent the ship propulsion dynamics by time domain simulation, on the ground of which the automation designers can develop and test several propulsion control options. A brief description of the simulation approach adopted for the vessel crash stop is illustrated at the end of this paper. In particular, the propulsion control action is studied taking into account machinery performance and constraints, including also the control pitch mechanism feedback in terms of allowable forces and pressures.",
      "citations": 1,
      "quartile": null
    }
  ],
  "iris_products": [
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1245616",
      "authors": "Ponzini, F.; Zaccone, R.; Martelli, M.",
      "legacy_id": 636446,
      "year": 2025,
      "miur_type": "262",
      "title": "LiDAR target detection and classification for ship situational awareness: A hybrid learning approach",
      "scopus_id": "2-s2.0-105002009151",
      "doi": "10.1016/j.apor.2025.104552",
      "isi_id": "WOS:001467076500001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "5",
      "citations_scopus": "6"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1263341",
      "authors": "Hinostroza, Miguel; Fruzzetti, Camilla; Gudahl Tufte, Andreas; Lexau, Simon J. N.; Gusev, Alexey; Eide, Egil; Brekke, Edmund F.; Lekkas, Anastasios M.; Skjetne, Roger; Martelli, Michele; Breivik, Morten",
      "legacy_id": 659086,
      "year": 2025,
      "miur_type": "262",
      "title": "Model Identification, Dynamic Positioning, and Thrust Allocation System for the milliAmpere1 Autonomous Ferry Prototype: Field Trial Results",
      "scopus_id": "2-s2.0-105012467146",
      "doi": "10.1109/ACCESS.2025.3593251",
      "isi_id": "WOS:001542442900020",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "0",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1262338",
      "authors": "Ponzini, Filippo; Van Hamme, David; Martelli, Michele",
      "legacy_id": 657796,
      "year": 2025,
      "miur_type": "262",
      "title": "Human detection in marine disaster search and rescue scenario: a multi-modal early fusion approach",
      "scopus_id": "2-s2.0-105012265713",
      "doi": "10.1016/j.oceaneng.2025.122341",
      "isi_id": "WOS:001545038700002",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "0",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1175575",
      "authors": "Longo, G.; Martelli, M.; Russo, E.; Merlo, A.; Zaccone, R.",
      "legacy_id": 548446,
      "year": 2024,
      "miur_type": "262",
      "title": "Adversarial waypoint injection attacks on Maritime Autonomous Surface Ships (MASS) collision avoidance systems",
      "scopus_id": "2-s2.0-85180840642",
      "doi": "10.1080/20464177.2023.2298521",
      "isi_id": "WOS:001132187300001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "14",
      "citations_scopus": "15"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1222715",
      "authors": "Fruzzetti, Camilla; Buzzurro, Cristiana; Donnarumma, Silvia; Martelli, Michele",
      "legacy_id": 601826,
      "year": 2024,
      "miur_type": "262",
      "title": "Time Domain Design of a Marine Target Tracking System Accounting for Environmental Disturbances",
      "scopus_id": "2-s2.0-85210284265",
      "doi": "10.3390/jmse12112058",
      "isi_id": "WOS:001365472300001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "0",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1213195",
      "authors": "Fruzzetti, C.; Martelli, M.; Lekkas, A.; Skjetne, R.; Breivik, M.",
      "legacy_id": 590346,
      "year": 2024,
      "miur_type": "273",
      "title": "Model-Based Motion Control Design for the Milliampere1 Prototype Ferry",
      "scopus_id": "2-s2.0-85200538613",
      "doi": "10.23919/ECC64448.2024.10591071",
      "isi_id": "WOS:001290216503060",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "1",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1234955",
      "authors": "Zaccone, R.; Donnarumma, S.; Martelli, M.",
      "legacy_id": 621767,
      "year": 2024,
      "miur_type": "273",
      "title": "A structured metric approach to compare marine collision avoidance algorithms",
      "scopus_id": "2-s2.0-85210105149",
      "doi": "10.24868/11143",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1258896",
      "authors": "Martelli, M.; Zuskin, S.; Cellerino, E.; Zaccone, R.",
      "legacy_id": 653355,
      "year": 2024,
      "miur_type": "273",
      "title": "Ship Collision detection and classification employing AIS data",
      "scopus_id": "2-s2.0-85200733361",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1211635",
      "authors": "Zini, Aldo; Figari, Massimo; Martelli, Michele; Tozzi, Davide",
      "legacy_id": 583013,
      "year": 2024,
      "miur_type": "273",
      "title": "FROM VIRTUAL PROTOTYPING TO DIGITAL TWIN",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1156660",
      "authors": "Fruzzetti, Camilla; Donnarumma, Silvia; Maggiani, Francesca; Martelli, Michele",
      "legacy_id": 520883,
      "year": 2024,
      "miur_type": "262",
      "title": "Probabilistic operability and greenhouse gas assessment during dynamic positioning operations",
      "scopus_id": "2-s2.0-85175652778",
      "doi": "10.1177/14750902231203441",
      "isi_id": "WOS:001090820900001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "1",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1213556",
      "authors": "Donnarumma, S.; Martelli, M.; D'Agostino, F.; Kaza, D.; Silvestro, F.",
      "legacy_id": 590811,
      "year": 2024,
      "miur_type": "262",
      "title": "Multiphysics Modeling and Simulation of Integrated Electric Propulsion System for Ship Dynamic Positioning",
      "scopus_id": "2-s2.0-85182953922",
      "doi": "10.1109/TIA.2024.3355869",
      "isi_id": "WOS:001230196400032",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "2",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1179496",
      "authors": "Zaccone, R; Martelli, M",
      "legacy_id": 553547,
      "year": 2023,
      "miur_type": "273",
      "title": "Interaction between COLREG-compliant collision avoidance systems in a multiple MASS scenario",
      "scopus_id": "2-s2.0-85179626443",
      "doi": "10.1088/1742-6596/2618/1/012006",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "6"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1141796",
      "authors": "Fruzzetti, C.; Martelli, M.",
      "legacy_id": 501755,
      "year": 2023,
      "miur_type": "273",
      "title": "Unmanned Surface Vehicle Chase a Moving Target Remotely Controlled",
      "scopus_id": "2-s2.0-85161671157",
      "doi": "10.1007/978-3-031-31268-7_14",
      "isi_id": "WOS:001427115700014",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "1",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1141795",
      "authors": "Martelli, M.; Zuskin, S.; Zaccone, R.; Rudan, I.",
      "legacy_id": 501757,
      "year": 2023,
      "miur_type": "262",
      "title": "A COLREGs-Compliant Decision Support Tool to Prevent Collisions at Sea",
      "scopus_id": "2-s2.0-85163694623",
      "doi": "10.12716/1001.17.02.11",
      "isi_id": "WOS:001021666000011",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "4",
      "citations_scopus": "9"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1142595",
      "authors": "Piaggio, Benedetto; Garofano, Vittorio; Donnarumma, Silvia; Alessandri, Angelo; Negenborn, Rudy; Martelli, Michele",
      "legacy_id": 502847,
      "year": 2023,
      "miur_type": "262",
      "title": "Follow-the-Leader Guidance, Navigation, and Control of Surface Vessels: Design and Experiments",
      "scopus_id": "2-s2.0-85171563043",
      "doi": "10.1109/JOE.2023.3292422",
      "isi_id": "WOS:001071946500001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "5",
      "citations_scopus": "5"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1156659",
      "authors": "Cassará, Pietro; Di Summa, Maria; Gotta, Alberto; Martelli, Michele",
      "legacy_id": 509349,
      "year": 2023,
      "miur_type": "262",
      "title": "E-Navigation: A Distributed Decision Support System With Extended Reality for Bridge and Ashore Seafarers",
      "scopus_id": "2-s2.0-85174824987",
      "doi": "10.1109/TITS.2023.3311817",
      "isi_id": "WOS:001086326600001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "7",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1179495",
      "authors": "Ponzini, Filippo; Zaccone, Raphael; Martelli, Michele",
      "legacy_id": 553546,
      "year": 2023,
      "miur_type": "273",
      "title": "A multi-sensor indoor tracking system for autonomous marine model-scale vehicles",
      "scopus_id": "2-s2.0-85179621934",
      "doi": "10.1088/1742-6596/2618/1/012008",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102448",
      "authors": "Martelli, M.; Faggioni, N.; Ponzini, F.",
      "legacy_id": 445788,
      "year": 2022,
      "miur_type": "273",
      "title": "Detecting and Tracking Multi-Object in Real Marine Environment",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1101855",
      "authors": "DeMarco Muscat-Fenech, Claire; Sant, Tonio; Zheku, VITO VASIL; Villa, Diego; Martelli, Michele",
      "legacy_id": 445161,
      "year": 2022,
      "miur_type": "262",
      "title": "A Review of Ship-to-Ship Interactions in Calm Waters",
      "scopus_id": "2-s2.0-85144952640",
      "doi": "10.3390/jmse10121856",
      "isi_id": "WOS:000902680600001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "10",
      "citations_scopus": "10"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1074229",
      "authors": "Fruzzetti, C.; Donnarumma, S.; Martelli, M.",
      "legacy_id": 410829,
      "year": 2022,
      "miur_type": "262",
      "title": "Dynamic target chasing: parameters and performance indicators assessment",
      "scopus_id": "2-s2.0-85123502826",
      "doi": "10.1007/s00773-021-00865-3",
      "isi_id": "WOS:000745579100001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "8",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1093177",
      "authors": "Piaggio, B.; Viviani, M.; Martelli, M.; Figari, M.",
      "legacy_id": 432195,
      "year": 2022,
      "miur_type": "262",
      "title": "Z-Drive Escort Tug manoeuvrability model and simulation, Part II: A full-scale validation",
      "scopus_id": "2-s2.0-85133540544",
      "doi": "10.1016/j.oceaneng.2022.111881",
      "isi_id": "WOS:000830492000002",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "9",
      "citations_scopus": "12"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1094333",
      "authors": "Zaccone, Raphael; Figari, Massimo; Martelli, Michele",
      "legacy_id": 433595,
      "year": 2022,
      "miur_type": "273",
      "title": "A simulation based tool to assess the propulsion performance of modern conventional submarines",
      "scopus_id": "2-s2.0-85136216304",
      "doi": "10.1109/SPEEDAM53979.2022.9842197",
      "isi_id": "WOS:001429387900104",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "2",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102440",
      "authors": "Fruzzetti, C.; Donnarumma, S.; Martelli, M.; Maggiani, F.",
      "legacy_id": 445779,
      "year": 2022,
      "miur_type": "273",
      "title": "Dynamic positioning operability assessment by using thrust allocation optimization",
      "scopus_id": "2-s2.0-85145613688",
      "doi": "10.1201/9781003358961-5",
      "isi_id": "WOS:001233620100003",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1088074",
      "authors": "Martelli, M.; Figari, M.",
      "legacy_id": 426453,
      "year": 2022,
      "miur_type": "262",
      "title": "A design framework for combined marine propulsion control systems: From conceptualisation to sea trials validation",
      "scopus_id": "2-s2.0-85128997540",
      "doi": "10.1016/j.oceaneng.2022.111282",
      "isi_id": "WOS:000802071100003",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "7",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1120619",
      "authors": "Longo, G; Martelli, M; Russo, E; Zaccone, R",
      "legacy_id": 474493,
      "year": 2022,
      "miur_type": "273",
      "title": "Collision-avoidance Capabilities Reduction After a Cyber-Attack to the Navigation Sensors",
      "scopus_id": "2-s2.0-85187450570",
      "doi": "10.24868/10729",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102630",
      "authors": "Donnarumma, S.; Martelli, M.; D'Agostino, F.; Kaza, D.; Silvestro, F.",
      "legacy_id": 446073,
      "year": 2022,
      "miur_type": "273",
      "title": "Multiphysics Modeling and Simulation of Integrated Electric Propulsion System for Ship Dynamic Positioning",
      "scopus_id": "2-s2.0-85136188410",
      "doi": "10.1109/SPEEDAM53979.2022.9841976",
      "isi_id": "WOS:001429387900107",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1095515",
      "authors": "Donnarumma, Silvia; Fruzzetti, Camilla; Martelli, Michele; Roberto, Chiti; Pecoraro, Andrea; Sebastiani, Luca",
      "legacy_id": 435375,
      "year": 2022,
      "miur_type": "273",
      "title": "Rapid prototyping for enhanced dynamic positioning systems",
      "scopus_id": "2-s2.0-85138206739",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102953",
      "authors": "Taylor, A.; Mizzi, K.; Spijker, S.; Martelli, M.; Gutteridge, K.",
      "legacy_id": 446501,
      "year": 2022,
      "miur_type": "273",
      "title": "The Study of an Innovative Propulsion Plant for a High-Speed Catamaran Ferry for Decarbonisation in the Marine Industry",
      "scopus_id": "2-s2.0-85138134028",
      "doi": "10.3233/PMST220059",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1074203",
      "authors": "Martelli, M.; Faggioni, N.; Donnarumma, S.",
      "legacy_id": 410800,
      "year": 2022,
      "miur_type": "262",
      "title": "A time-domain methodology to assess the dynamic positioning performances",
      "scopus_id": "2-s2.0-85123782693",
      "doi": "10.1016/j.oceaneng.2022.110668",
      "isi_id": "WOS:000783599700002",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "11",
      "citations_scopus": "14"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102442",
      "authors": "Faggioni, N.; Ponzini, F.; Martelli, M.",
      "legacy_id": 445778,
      "year": 2022,
      "miur_type": "262",
      "title": "Multi-obstacle detection and tracking algorithms for the marine environment based on unsupervised learning",
      "scopus_id": "2-s2.0-85141972835",
      "doi": "10.1016/j.oceaneng.2022.113034",
      "isi_id": "WOS:000890665900005",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "12",
      "citations_scopus": "15"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1079719",
      "authors": "Faggioni, Nicolò; Leonardi, Nicola; Ponzini, Filippo; Sebastiani, Luca; Martelli, Michele",
      "legacy_id": 417550,
      "year": 2022,
      "miur_type": "273",
      "title": "Obstacle Detection in Real and Synthetic Harbour Scenarios",
      "scopus_id": "2-s2.0-85128769544",
      "doi": "10.1007/978-3-030-98260-7_2",
      "isi_id": "WOS:000787774900002",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1034002",
      "authors": "Piaggio, Benedetto; Viviani, Michele; Martelli, Michele; Figari, Massimo",
      "legacy_id": 357938,
      "year": 2021,
      "miur_type": "273",
      "title": "Z-drive escort tug manoeuvrability modelling: From model-scale to full-scale validation",
      "scopus_id": "2-s2.0-85145495960",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1047915",
      "authors": "Zaccone, Raphael; Campora, Ugo; Martelli, Michele",
      "legacy_id": 381154,
      "year": 2021,
      "miur_type": "262",
      "title": "Optimisation of a Diesel-Electric Ship Propulsion and Power Generation System Using a Genetic Algorithm",
      "scopus_id": "2-s2.0-85107834293",
      "doi": "10.3390/jmse9060587",
      "isi_id": "WOS:000666081100001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "25",
      "citations_scopus": "32"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1102441",
      "authors": "Martelli, Michele; Virdis, Antonio; Gotta, Alberto; Cassara, Pietro; Di Summa, Maria",
      "legacy_id": 445780,
      "year": 2021,
      "miur_type": "262",
      "title": "An Outlook on the Future Marine Traffic Management System for Autonomous Ships",
      "scopus_id": "2-s2.0-85120571973",
      "doi": "10.1109/ACCESS.2021.3130741",
      "isi_id": "WOS:000725779700001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "43",
      "citations_scopus": "53"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1057746",
      "authors": "Vrijdag, A.; Martelli, M.",
      "legacy_id": 392118,
      "year": 2021,
      "miur_type": "262",
      "title": "Parameter identification of a model scale ship drive train",
      "scopus_id": "2-s2.0-85102491760",
      "doi": "10.3390/jmse9030268",
      "isi_id": "WOS:000633804200001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "5",
      "citations_scopus": "5"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1057748",
      "authors": "Martelli, M.; Faggioni, N.; Donnarumma, S.",
      "legacy_id": 392120,
      "year": 2020,
      "miur_type": "273",
      "title": "A novel model based-design approach for a dynamic positioning system",
      "scopus_id": "2-s2.0-85110557089",
      "doi": "10.24868/issn.2631-8741.2020.002",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1057750",
      "authors": "Haseltalab, A.; Garofano, V.; Afzal, M. R.; Faggioni, N.; Li, S.; Liu, J.; Ma, F.; Martelli, M.; Singh, Y.; Slaets, P.; You, X.; Negenborn, R. R.",
      "legacy_id": 392122,
      "year": 2020,
      "miur_type": "273",
      "title": "The collaborative autonomous shipping experiment (Case): Motivations, theory, infrastructure, and experimental challenges",
      "scopus_id": "2-s2.0-85110427177",
      "doi": "10.24868/issn.2631-8741.2020.014",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1045081",
      "authors": "Piaggio, B; Garofano, V; Donnarumma, S; Alessandri, A; Negenborn, Rr; Martelli, M",
      "legacy_id": 377859,
      "year": 2020,
      "miur_type": "273",
      "title": "Follow-the-Leader Control Strategy for Azimuth Propulsion System on Surface Vessels",
      "scopus_id": "2-s2.0-85110438737",
      "doi": "10.24868/issn.2631-8741.2020.004",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1019856",
      "authors": "D’Agostino, Fabio; Kaza, Daniele; Martelli, Michele; Schiapparelli, Giacomo-Piero; Silvestro, Federico; Soldano, Carlo",
      "legacy_id": 347861,
      "year": 2020,
      "miur_type": "262",
      "title": "Development of a Multiphysics Real-Time Simulator for Model-Based Design of a DC Shipboard Microgrid",
      "scopus_id": "2-s2.0-85090804759",
      "doi": "10.3390/en13143580",
      "isi_id": "WOS:000556896700001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "16",
      "citations_scopus": "19"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1006023",
      "authors": "Donnarumma, Silvia; Figari, Massimo; Martelli, Michele; Zaccone, Raphael",
      "legacy_id": 332508,
      "year": 2020,
      "miur_type": "273",
      "title": "Simulation of the Guidance and Control Systems for Underactuated Vessels",
      "scopus_id": "2-s2.0-85083715563",
      "isi_id": "WOS:000628847000009",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "9",
      "citations_scopus": "16"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/977074",
      "authors": "Martelli, Michele; Faggioni, Nicolo'; Zaccone, Raphael",
      "legacy_id": 299755,
      "year": 2020,
      "miur_type": "273",
      "title": "Development of a navigation support system by means of a synthetic scenario",
      "scopus_id": "2-s2.0-85079226039",
      "isi_id": "WOS:000503462400064",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "2",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/973619",
      "authors": "Martelli, Michele; Zaccone, Raphael; Silvestro, Federico; Campora, Ugo",
      "legacy_id": 295181,
      "year": 2019,
      "miur_type": "273",
      "title": "Optimal Management of a Diesel-Electric Propulsion Plant with Either Constant or Variable Diesel Generators Speed",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/994106",
      "authors": "Zaccone, R.; Martelli, M.",
      "legacy_id": 318812,
      "year": 2019,
      "miur_type": "262",
      "title": "A collision avoidance algorithm for ship guidance applications",
      "scopus_id": "2-s2.0-85075005148",
      "doi": "10.1080/20464177.2019.1685836",
      "isi_id": "WOS:000495383700001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "57",
      "citations_scopus": "73"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/935757",
      "authors": "Martelli, Michele; Faggioni, Nicolo'; Berselli, Giovanni",
      "legacy_id": 252466,
      "year": 2019,
      "miur_type": "262",
      "title": "Fuel saving in a marine propulsion plant by using a continuously variable transmission",
      "scopus_id": "2-s2.0-85059667461",
      "doi": "10.1177/1475090218806977",
      "isi_id": "WOS:000486892600003",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "2",
      "citations_scopus": "6"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1047346",
      "authors": "Figari, Massimo; Zaccone, Raphael; Boeris, Gabriele; Martelli, Michele",
      "legacy_id": 380393,
      "year": 2019,
      "miur_type": "273",
      "title": "SHIP VOYAGE OPTIMISATION: A COMPARISON BETWEEN FORECAST AND REAL ROUTE SELECTION",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/975899",
      "authors": "Zaccone, R.; Martelli, M.; Figari, M.",
      "legacy_id": 298480,
      "year": 2019,
      "miur_type": "273",
      "title": "A COLREG-compliant ship collision avoidance algorithm",
      "scopus_id": "2-s2.0-85071527416",
      "doi": "10.23919/ECC.2019.8796207",
      "isi_id": "WOS:000490488302088",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "40",
      "citations_scopus": "51"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/955567",
      "authors": "Altosole, Marco; Campora, Ugo; Figari, Massimo; Laviola, Michele; Martelli, Michele",
      "legacy_id": 275361,
      "year": 2019,
      "miur_type": "262",
      "title": "A Diesel Engine Modelling Approach for Ship Propulsion Real-Time Simulators",
      "scopus_id": "2-s2.0-85066424140",
      "doi": "10.3390/jmse7050138",
      "isi_id": "WOS:000470965000018",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "29",
      "citations_scopus": "37"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/991770",
      "authors": "Martelli, M.; Villa, D.; Viviani, M.; Donnarumma, S.; Figari, M.",
      "legacy_id": 316167,
      "year": 2019,
      "miur_type": "262",
      "title": "The use of computational fluid dynamic technique in ship control design",
      "scopus_id": "2-s2.0-85074225792",
      "doi": "10.1080/17445302.2019.1706908",
      "isi_id": "WOS:000504368200001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "13",
      "citations_scopus": "22"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/975901",
      "authors": "Piaggio, Benedetto; Viviani, Michele; Martelli, Michele; Figari, Massimo",
      "legacy_id": 298482,
      "year": 2019,
      "miur_type": "262",
      "title": "Z-Drive Escort Tug manoeuvrability model and simulation",
      "scopus_id": "2-s2.0-85073011172",
      "doi": "10.1016/j.oceaneng.2019.106461",
      "isi_id": "WOS:000502888100013",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "26",
      "citations_scopus": "32"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/975905",
      "authors": "Martelli, Michele; Zaccone, Raphael",
      "legacy_id": 298486,
      "year": 2019,
      "miur_type": "273",
      "title": "Ship Propulsion Plant Performance Assessment Using An Artificial Neural Network",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/953409",
      "authors": "Alessandri, Angelo; Donnarumma, Silvia; Martelli, Michele; Vignolo, Stefano",
      "legacy_id": 273032,
      "year": 2019,
      "miur_type": "262",
      "title": "Motion Control for Autonomous Navigation in Blue and Narrow Waters Using Switched Controllers",
      "scopus_id": "2-s2.0-85069226288",
      "doi": "10.3390/jmse7060196",
      "isi_id": "WOS:000473807700034",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "19",
      "citations_scopus": "26"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/969407",
      "authors": "Notti, Emilio; Figari, Massimo; Sala, Antonello; Martelli, Michele",
      "legacy_id": 290359,
      "year": 2019,
      "miur_type": "262",
      "title": "Experimental assessment of the fouling control coating effect on the fuel consumption rate",
      "scopus_id": "2-s2.0-85069898764",
      "doi": "10.1016/j.oceaneng.2019.106233",
      "isi_id": "WOS:000490045500005",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "12",
      "citations_scopus": "12"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/929307",
      "authors": "Zaccone, Raphael; Figari, Massimo; Martelli, Michele",
      "legacy_id": 245238,
      "year": 2018,
      "miur_type": "273",
      "title": "An optimization tool for ship route planning in real weather scenarios",
      "scopus_id": "2-s2.0-85053479460",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "16"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/929553",
      "authors": "Zaccone, Raphael; Martelli, Michele",
      "legacy_id": 245519,
      "year": 2018,
      "miur_type": "273",
      "title": "A random sampling based algorithm for ship path planning with obstacles",
      "scopus_id": "2-s2.0-85079251106",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "24"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/929558",
      "authors": "Martelli, Michele; Figari, Massimo; di Summa, Maria; Paolo Viganò, Gian; Sacco, Marco; Cassarà, Pietro; Gotta, Alberto; Sebastiani, Luca; Delucchi, Graziella; Guglia, Paolo",
      "legacy_id": 245525,
      "year": 2018,
      "miur_type": "273",
      "title": "Enhanced Navigation at Sea: an augmented reality-based tool for bridge operators",
      "doi": "10.24868/issn.2515-818X.2018.017",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/929263",
      "authors": "Piaggio, B.; Viviani, M.; Martelli, M",
      "legacy_id": 245180,
      "year": 2018,
      "miur_type": "273",
      "title": "Escort Tug Hydrodynamic Forces Estimation in a Design Framework: From Model Test to Manoeuvrability Simulation",
      "scopus_id": "2-s2.0-85055354752",
      "doi": "10.1115/OMAE2018-78052",
      "isi_id": "WOS:000449890600008",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "13"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/929309",
      "authors": "Figari, Massimo; Martinelli, Luca; Martelli, Michele; Enoizi, Lucia; Piaggio, Benedetto",
      "legacy_id": 245241,
      "year": 2018,
      "miur_type": "273",
      "title": "A New Escort Tug Family Designed to Anticipate New Safety Requirements and Operational Needs",
      "scopus_id": "2-s2.0-85087607228",
      "doi": "10.3233/978-1-61499-870-9-986",
      "isi_id": "WOS:000567876300115",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/882154",
      "authors": "Donnarumma, S.; Figari, M.; Martelli, M.; Vignolo, S.; Viviani, M.",
      "legacy_id": 193038,
      "year": 2018,
      "miur_type": "262",
      "title": "Design and Validation of Dynamic Positioning for Marine Systems: a Case Study",
      "scopus_id": "2-s2.0-85031816570",
      "doi": "10.1109/JOE.2017.2732298",
      "isi_id": "WOS:000438742000009",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "28",
      "citations_scopus": "40"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/882182",
      "authors": "Piaggio, Benedetto; Martelli, M.; Viviani, M.; Figari, M.",
      "legacy_id": 193076,
      "year": 2017,
      "miur_type": "273",
      "title": "Manoeuvring model and simulation of the non-linear dynamic interaction between tethered ship and tug during escort",
      "scopus_id": "2-s2.0-85055317705",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "10"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/884390",
      "authors": "Martelli, M.; Vernengo, G.; Bruzzone, D.; Notti, E.",
      "legacy_id": 195568,
      "year": 2017,
      "miur_type": "262",
      "title": "Holistic Modeling of the Global Propulsion Energy Index in Waves for Small Craft",
      "scopus_id": "2-s2.0-85041485618",
      "doi": "10.17736/ijope.2017.mk54",
      "isi_id": "WOS:000427086300013",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "6",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/870489",
      "authors": "Martelli, Michele; Figari, Massimo",
      "legacy_id": 180711,
      "year": 2017,
      "miur_type": "262",
      "title": "Real-Time model-based design for CODLAG propulsion control strategies",
      "scopus_id": "2-s2.0-85020982629",
      "doi": "10.1016/j.oceaneng.2017.06.029",
      "isi_id": "WOS:000407535100023",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "29",
      "citations_scopus": "34"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/870294",
      "authors": "Altosole, Marco; Martelli, Michele",
      "legacy_id": 180493,
      "year": 2017,
      "miur_type": "262",
      "title": "Propulsion control strategies for ship emergency manoeuvres",
      "scopus_id": "2-s2.0-85016457628",
      "doi": "10.1016/j.oceaneng.2017.03.053",
      "isi_id": "WOS:000401680100010",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "18",
      "citations_scopus": "25"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/849506",
      "authors": "Martelli, Michele; Vernengo, Giuliano; Bruzzone, Dario; Notti, Emilio",
      "legacy_id": 157534,
      "year": 2016,
      "miur_type": "273",
      "title": "Overall efficiency assessment of a trawler propulsion system based on hydrodynamic performance computations",
      "scopus_id": "2-s2.0-84987917208",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/870295",
      "authors": "Capasso, C.; Veneri, O; Notti, E.; Sala, A.; Figari, Massimo; Martelli, Michele",
      "legacy_id": 180494,
      "year": 2016,
      "miur_type": "273",
      "title": "Preliminary design of the hybrid propulsion architecture for the research vessel \"G. Dallaporta\"",
      "scopus_id": "2-s2.0-85015378566",
      "doi": "10.1109/ESARS-ITEC.2016.7841342",
      "isi_id": "WOS:000399133700021",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "16",
      "citations_scopus": "31"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/849519",
      "authors": "Ircani, Alessio; Martelli, Michele; Viviani, Michele; Altosole, Marco; PODENZANA BONVINO, Carlo; Grassi, D.",
      "legacy_id": 157548,
      "year": 2016,
      "miur_type": "262",
      "title": "A Simulation Approach for Planing Boats Propulsion and Manoeuvrability",
      "scopus_id": "2-s2.0-84994741708",
      "doi": "10.3940/rina.ijsct.2016.b1.180",
      "type": "01.01 - Articolo su rivista",
      "citations_scopus": "14"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/882167",
      "authors": "Martelli, M.; Figari, M.",
      "legacy_id": 192900,
      "year": 2016,
      "miur_type": "273",
      "title": "Numerical and experimental investigation for the performance assessment of full electric marine propulsion plant",
      "scopus_id": "2-s2.0-85053838368",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/814686",
      "authors": "Martelli, Michele",
      "legacy_id": 115606,
      "year": 2015,
      "miur_type": "276",
      "title": "Marine Propulsion Simulation: Methods and Results",
      "scopus_id": "2-s2.0-84957713108",
      "type": "03.01 - Monografia o trattato scientifico",
      "citations_scopus": "38"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/812028",
      "authors": "Martelli, Michele; Tassetti, Nora; Buglioni, Gabiele",
      "legacy_id": 115634,
      "year": 2015,
      "miur_type": "273",
      "title": "Reverse engineering techniques for trawler hull 3D modelling and energy efficiency evaluation",
      "scopus_id": "2-s2.0-85012870906",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/809342",
      "authors": "Donnarumma, Silvia; Martelli, Michele; Vignolo, Stefano",
      "legacy_id": 111797,
      "year": 2015,
      "miur_type": "273",
      "title": "Numerical Models for Ship Dynamic Positioning",
      "scopus_id": "2-s2.0-84938865811",
      "isi_id": "WOS:000380489300088",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/944225",
      "authors": "Alessandri, A.; Donnarumma, S.; Vignolo, S.; Figari, M.; Martelli, M.; Chiti, R.; Sebastiani, L.",
      "legacy_id": 262951,
      "year": 2015,
      "miur_type": "268",
      "title": "System control design of autopilot and speed pilot for a patrol vessel by using LMIs",
      "scopus_id": "2-s2.0-85054409086",
      "doi": "10.1201/b18855",
      "isi_id": "WOS:000505749600066",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "21",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/815033",
      "authors": "Alessandri, Angelo; Donnarumma, Silvia; Vignolo, Stefano; Figari, Massimo; Martelli, Michele; Chiti, R.; Sebastiani, L.",
      "legacy_id": 119434,
      "year": 2015,
      "miur_type": "273",
      "title": "System control design of autopilot and speed pilot for a patrol vessel by using LMIs",
      "scopus_id": "2-s2.0-85054409086",
      "isi_id": "WOS:000505749600066",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "21",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/827307",
      "authors": "Dubbioso, G.; Mauro, S.; Ortolani, F.; Martelli, Michele; Nataletti, Marco; Villa, Diego; Viviani, Michele",
      "legacy_id": 132648,
      "year": 2015,
      "miur_type": "273",
      "title": "Experimental and Numerical Investigation of Asymmetrical Behaviour of Rudder / Propeller for Twin Screw Ships",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/790830",
      "authors": "A., Ircani; Martelli, Michele; Viviani, Michele; Altosole, Marco; PODENZANA BONVINO, Carlo; D., Grassi",
      "legacy_id": 109229,
      "year": 2014,
      "miur_type": "273",
      "title": "Propulsion and steering effects on dynamics of high speed craft",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/731382",
      "authors": "Altosole, Marco; Campora, Ugo; Martelli, Michele; Figari, Massimo",
      "legacy_id": 103827,
      "year": 2014,
      "miur_type": "262",
      "title": "Performance decay analysis of a marine gas turbine propulsion system",
      "scopus_id": "2-s2.0-84906279798",
      "doi": "10.5957/JOSR.58.3.130037",
      "isi_id": "WOS:000342604700001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "31",
      "citations_scopus": "36"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/736373",
      "authors": "Martelli, M; Figari, M; Altosole, M; Viviani, M; Vignolo, S",
      "legacy_id": 103975,
      "year": 2014,
      "miur_type": "262",
      "title": "Numerical modelling of propulsion, control and ship motions in 6 degrees of freedom",
      "scopus_id": "2-s2.0-84927770471",
      "doi": "10.1177/1475090214544181",
      "isi_id": "WOS:000343902400005",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "46",
      "citations_scopus": "55"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/576721",
      "authors": "Martelli, Michele; Figari, Massimo; Altosole, Marco; Vignolo, Stefano",
      "legacy_id": 97354,
      "year": 2014,
      "miur_type": "262",
      "title": "Controllable pitch propeller actuating mechanism, modelling and simulation",
      "scopus_id": "2-s2.0-84900871276",
      "doi": "10.1177/1475090212468254",
      "isi_id": "WOS:000331197400003",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "38",
      "citations_scopus": "51"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/703567",
      "authors": "Altosole, Marco; Figari, Massimo; Martelli, Michele; M., Rocca",
      "legacy_id": 102428,
      "year": 2014,
      "miur_type": "262",
      "title": "Simulation techniques for the propulsion retrofitting of the tall ship “Amerigo Vespucci”",
      "type": "01.01 - Articolo su rivista"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/750402",
      "authors": "Alessandri, Angelo; Donnarumma, Silvia; Luria, Gianvittorio; Martelli, Michele; Vignolo, Stefano; R., Chiti; L., Sebastiani",
      "legacy_id": 104497,
      "year": 2014,
      "miur_type": "273",
      "title": "Dynamic Positioning system of a vessel with conventional propulsion configuration: Modeling and simulation",
      "scopus_id": "2-s2.0-84941730047",
      "isi_id": "WOS:000380506300075",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "8",
      "citations_scopus": "19"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/629608",
      "authors": "Altosole, Marco; Figari, Massimo; Martelli, Michele; L., Passano; M., Rocca; M., Giuliano; L., Piva",
      "legacy_id": 99090,
      "year": 2014,
      "miur_type": "273",
      "title": "Simulation study on the interaction between sailing and motor propulsion to optimize performance and control of the tall ship “Amerigo Vespucci”",
      "scopus_id": "2-s2.0-84894418698",
      "isi_id": "WOS:000328328400061",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "5"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/811958",
      "authors": "Laviola, Michele; Martelli, Michele",
      "legacy_id": 115616,
      "year": 2014,
      "miur_type": "273",
      "title": "A Thermodynamic four stroke diesel engine model for pleasure craft application",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/585157",
      "authors": "Altosole, Marco; Figari, Massimo; Martelli, Michele; Nataletti, Marco; Vignolo, Stefano; Viviani, Michele",
      "legacy_id": 97652,
      "year": 2013,
      "miur_type": "273",
      "title": "Numerical Analysis of the Ship Propulsion Control System Effect on Manoeuvring Characteristics in Model and Full scale",
      "scopus_id": "2-s2.0-84891362895",
      "isi_id": "WOS:000346074700034",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1029856",
      "authors": "Altosole, M.; Figari, M.; Martelli, M.; Passano, L.; Rocca, M.; Giuliano, M.; Piva, L.",
      "legacy_id": 360439,
      "year": 2013,
      "miur_type": "268",
      "title": "Simulation study on the interaction between sailing and motor propulsion to optimize performance and control of the tall ship “Amerigo Vespucci”",
      "scopus_id": "2-s2.0-85054949955",
      "isi_id": "WOS:000328328400061",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "3",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/521536",
      "authors": "Altosole, Marco; Benvenuto, GIOVANNI BATTISTA; Campora, Ugo; Martelli, Michele; Bruga, L.",
      "legacy_id": 93586,
      "year": 2012,
      "miur_type": "273",
      "title": "Marine gas turbines pollutant emissions assessment",
      "scopus_id": "2-s2.0-85017009662",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/377886",
      "authors": "Altosole, Marco; Figari, Massimo; Martelli, Michele; Viviani, Michele",
      "legacy_id": 75869,
      "year": 2012,
      "miur_type": "273",
      "title": "Investigation on the Interaction between Ship Propulsion Control System and Manoeuvrability by Time Domain Simulation",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/300382",
      "authors": "Altosole, Marco; Martelli, Michele; Vignolo, Stefano",
      "legacy_id": 63836,
      "year": 2012,
      "miur_type": "273",
      "title": "A mathematical model of the propeller pitch change mechanism for the marine propulsion control design",
      "scopus_id": "2-s2.0-84896845373",
      "isi_id": "WOS:000392426100009",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "14"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/539344",
      "authors": "Altosole, Marco; Figari, Massimo; Martelli, Michele",
      "legacy_id": 95397,
      "year": 2012,
      "miur_type": "273",
      "title": "Time-domain simulation for marine propulsion applications",
      "scopus_id": "2-s2.0-84871028646",
      "isi_id": "WOS:000340464400006",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "8",
      "citations_scopus": "25"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/377098",
      "authors": "Altosole, Marco; Figari, Massimo; Martelli, Michele; G., Orrù",
      "legacy_id": 75429,
      "year": 2012,
      "miur_type": "273",
      "title": "Propulsion control optimisation for emergency manoeuvres of naval vessels",
      "scopus_id": "2-s2.0-84916910545",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "12"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/276449",
      "authors": "Campora, Ugo; Figari, Massimo; Martelli, Michele; Vignolo, Stefano; Viviani, Michele",
      "legacy_id": 55635,
      "year": 2011,
      "miur_type": "273",
      "title": "Propulsion Plant Simulation for Fast Military Vessels",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1029854",
      "authors": "Altosole, M.; Martelli, M.; Vignolo, S.",
      "legacy_id": 360437,
      "year": 2011,
      "miur_type": "268",
      "title": "A mathematical model of the propeller pitch change mechanism for the marine propulsion control design",
      "scopus_id": "2-s2.0-85069418751",
      "isi_id": "WOS:000392426100009",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_isi": "6",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/277361",
      "authors": "Altosole, Marco; Benvenuto, GIOVANNI BATTISTA; Martelli, Michele; Galli, M.",
      "legacy_id": 56299,
      "year": 2011,
      "miur_type": "273",
      "title": "Advances in automation design for fast vessels propulsion",
      "type": "04.01 - Contributo in atti di convegno"
    }
  ],
  "retrieved_at": "2025-11-14T15:14:08.949546"
}