{
  "surname": "Patrone",
  "name": "Fabio",
  "unit": "ICT",
  "email": "fabio.patrone01@unige.it",
  "phone": "+39 010 33 52042",
  "page": "https://rubrica.unige.it/personale/UkNEU1pp",
  "website": "",
  "unige_id": "703800",
  "scopus_id": "56536292600",
  "role": "Ricercatore",
  "grade": "Ricercatore t.d. art. 24 c. 3 lett. B Legge 240/10 (t.pieno) + 20%",
  "ssd": "IINF-03/A (Telecomunicazioni)",
  "location": [
    {
      "building": "Opera Pia - padiglione C (Ex CNR) (ED_161450501)",
      "floor": "3° piano",
      "room": "US_161450501.III.011"
    }
  ],
  "career": [
    {
      "role": "AR",
      "from": "2013-10-01 00:00:00.0000000",
      "to": "2021-02-28 00:00:00.0000000"
    },
    {
      "role": "RD",
      "from": "2021-03-01 00:00:00.0000000",
      "to": "2026-10-31 00:00:00.0000000"
    }
  ],
  "responsibilities": [
    {
      "title": "Componente della Commissione paritetica docenti-studenti di scuola",
      "from": "2025-11-01 00:00:00.0000000",
      "to": "2027-10-31 00:00:00.0000000",
      "unit": "Scuola politecnica"
    }
  ],
  "teaching": {
    "2025": [
      {
        "course": "ELEMENTI DI TELECOMUNICAZIONI (107829)",
        "degree": "L-P03 - TECNOLOGIE INDUSTRIALI"
      },
      {
        "course": "TECNOLOGIE ICT PER L'INDUSTRIA 4.0 (113231)",
        "degree": "STSI PL - INDIRIZZO SCIENZE E TECNOLOGIE PER LA SOCIETA' DELL'INFORMAZIONE"
      },
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY AND SECURITY"
      },
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY AND SECURITY"
      }
    ],
    "2024": [
      {
        "course": "DIGITAL COMMUNICATIONS 2 (114552)",
        "degree": "LM-27 - INTERNET AND MULTIMEDIA ENGINEERING"
      },
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY (AND SECURITY)"
      },
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY (AND SECURITY)"
      },
      {
        "course": "ELEMENTI DI TELECOMUNICAZIONI (107829)",
        "degree": "L-P03 - TECNOLOGIE INDUSTRIALI"
      }
    ],
    "2023": [
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY (AND SECURITY)"
      },
      {
        "course": "ELEMENTI DI TELECOMUNICAZIONI (107829)",
        "degree": "L-P03 - TECNOLOGIE INDUSTRIALI"
      },
      {
        "course": "TECNOLOGIE ICT PER L'INDUSTRIA 4.0 (113231)",
        "degree": "STSI PL - INDIRIZZO SCIENZE E TECNOLOGIE PER LA SOCIETA' DELL'INFORMAZIONE"
      }
    ],
    "2022": [
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY (AND SECURITY)"
      },
      {
        "course": "ELEMENTI DI TELECOMUNICAZIONI (107829)",
        "degree": "L-P03 - TECNOLOGIE INDUSTRIALI"
      }
    ],
    "2021": [
      {
        "course": "TECNOLOGIE DELL'INFORMAZIONE E DELLA COMUNICAZIONE PER L'INDUSTRIA 4.0 (103479)",
        "degree": "STSI PL-IN2 - INDIRIZZO SCIENZE E TECNOLOGIE PER LA SOCIETA' DELL'INFORMAZIONE"
      },
      {
        "course": "STRATEGIES FOR TELECOMMUNICATIONS (98228)",
        "degree": "LM/DS - ENGINEERING TECHNOLOGY FOR STRATEGY (AND SECURITY)"
      }
    ]
  },
  "scopus_metrics": [
    {
      "period": "absolute",
      "hindex": 17,
      "total_products": 61,
      "journals": 23,
      "conferences": 31,
      "citations": 1041,
      "start": 1900,
      "end": 2025
    },
    {
      "period": "15 years (2010-2025)",
      "hindex": 17,
      "total_products": 61,
      "journals": 23,
      "conferences": 31,
      "citations": 1041,
      "start": 2010,
      "end": 2025
    },
    {
      "period": "10 years (2015-2025)",
      "hindex": 17,
      "total_products": 60,
      "journals": 23,
      "conferences": 30,
      "citations": 1036,
      "start": 2015,
      "end": 2025
    },
    {
      "period": "05 years (2020-2025)",
      "hindex": 11,
      "total_products": 43,
      "journals": 16,
      "conferences": 23,
      "citations": 399,
      "start": 2020,
      "end": 2025
    }
  ],
  "scopus_products": [
    {
      "scopus_id": "2-s2.0-105019060964",
      "title": "Performance Analysis and Security Preservation of DSRC in V2X Networks",
      "doi": "10.3390/electronics14193786",
      "venue": "Electronics Switzerland",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": "14",
      "issue_id": "19",
      "pages": null,
      "issn": null,
      "eIssn": "20799292",
      "source_id": "21100829272",
      "authors": "Sohail Muhammad Saad; Portomauro Giancarlo; Gaggero Giovanni Battista; Patrone Fabio; Marchese Mario",
      "author_ids": "59364633700;15128054100;57216708944;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Sohail M.S.",
      "keywords": "Denial of Service | DSRC | jamming attacks | Software-Defined Radio | V2X communications",
      "abstract": "Protecting communications within vehicular networks is of paramount importance, particularly when data are transmitted using wireless ad-hoc technologies such as Dedicated Short-Range Communications (DSRC). Vulnerabilities in Vehicle-to-Everything (V2X) communications, especially along highways, pose significant risks, such as unauthorized interception or alteration of vehicle data. This study proposes a Software-Defined Radio (SDR)-based tool designed to assess the protection level of V2X communication systems against cyber attacks. The proposed tool can emulate both reception and transmission of IEEE 802.11p packets while testing DSRC implementation and robustness. The results of this investigation offer valuable contributions toward shaping cybersecurity strategies and frameworks designed to protect the integrity of Vehicle-to-Vehicle (V2V) and Vehicle-to-Infrastructure (V2I) communications.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Signal Processing",
              "percentile": 81,
              "rank": 36,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 78,
              "rank": 220,
              "quartile": "Q1"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 76,
              "rank": 91,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 76,
              "rank": 131,
              "quartile": "Q1"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 73,
              "rank": 62,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105017507470",
      "title": "Rule-Based eXplainable Autoencoder for DNS Tunneling Detection",
      "doi": "10.3390/computers14090375",
      "venue": "Computers",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": "14",
      "issue_id": "9",
      "pages": null,
      "issn": null,
      "eIssn": "2073431X",
      "source_id": "21100886391",
      "authors": "De Bernardi Giacomo; Gaggero Giovanni Battista; Patrone Fabio; Zappatore Sandro; Marchese Mario; Mongelli Maurizio",
      "author_ids": "58146713400;57216708944;56536292600;6602811400;7004398165;7005882346",
      "authorAffiliationIds": "60021199;60025153;60025153;60025153;60025153;60021199",
      "corresponding": "De Bernardi G.",
      "keywords": "DNS tunnelling | eXplainable AI | intrusion detection system | statistical traffic analysis",
      "abstract": "Artificial Intelligence (AI) and Machine Learning (ML) are employed in numerous fields and applications. Even if most of these approaches offer a very good performance, they are affected by the “black-box” problem. The way they operate and make decisions is complex and difficult for human users to interpret, making the systems impossible to manually adjust in case they make trivial (from a human viewpoint) errors. In this paper, we show how a “white-box” approach based on eXplainable AI (XAI) can be applied to the Domain Name System (DNS) tunneling detection problem, a cybersecurity problem already successfully addressed by “black-box” approaches, in order to make the detection explainable. The obtained results show that the proposed solution can achieve a performance comparable to the one offered by an autoencoder-based solution while offering a clear view of how the system makes its choices and the possibility of manual analysis and adjustments.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Science (miscellaneous)",
              "percentile": 85,
              "rank": 26,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 83,
              "rank": 90,
              "quartile": "Q1"
            },
            {
              "subject": "Human-Computer Interaction",
              "percentile": 71,
              "rank": 55,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105018050217",
      "title": "Network Simulations for Non-Terrestrial Networks: Overcoming Deployment Challenges and Advancing System Optimization",
      "doi": "10.1109/ICCWorkshops67674.2025.11162227",
      "venue": "2025 IEEE International Conference on Communications Workshops Icc Workshops 2025",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": null,
      "issue_id": null,
      "pages": "2051-2056",
      "issn": null,
      "eIssn": null,
      "source_id": "21101337382",
      "authors": "Badini Nour; Patrone Fabio; Zanon Arianna Miraval; Marchese Mario",
      "author_ids": "57854682900;56536292600;57200721477;7004398165",
      "authorAffiliationIds": "60025153;60025153;60031612;60025153",
      "corresponding": "Badini N.",
      "keywords": "Network Optimization | Non-Terrestrial Networks | Satellite Communications | Satellite Simulator",
      "abstract": "Non-Terrestrial Networks (NTNs) including satellites, Unmanned Aerial Vehicles (UAVs), and High Altitude Platforms (HAPS), are increasingly seen as essential for extending coverage and enhancing reliability in modern communication systems, particularly in the context of the growing demand driven by IoT and V2X applications. However, their deployment faces significant technical challenges, such as path loss, atmospheric conditions, and Doppler effects. To address these issues, standardization bodies and academic researchers are actively investigating novel architectures to optimize NTN communications. However, the high costs associated with satellite launches, infrastructure deployment, and large-scale testing make physical experimentation infeasible in most cases. Moreover, real-world tests lack the flexibility to assess a wide range of configurations under controlled conditions. To address these limitations, network simulations have become an essential tool for evaluating NTN performance, testing new protocols, and optimizing system parameters before deployment. This paper presents a novel NS3-based simulation tool that integrates advanced energy and channel models from 3GPP TR 38.811, accounting for diverse environmental settings (dense urban, suburban, rural) and atmospheric effects to ensure accurate SNR computations. The simulator also features a sophisticated mobility model for representing satellite constellations and ground user mobility, including pedestrians, vehicles, and airplanes. A case study is presented, demonstrating the simulator's application in the development and performance evaluation of an energy-aware satellite handover strategy. This work highlights the critical role of simulation tools in advancing NTN technologies and supporting the development of next-generation communication standards.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-105016108611",
      "title": "CyberVehiCare: A Testbed for Cybersecurity of Vehicle to Everything (V2X) Automotive Systems",
      "doi": "10.1109/CSR64739.2025.11130024",
      "venue": "Proceedings of the 2025 IEEE International Conference on Cyber Security and Resilience Csr 2025",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": null,
      "issue_id": null,
      "pages": "818-823",
      "issn": null,
      "eIssn": null,
      "source_id": "21101331270",
      "authors": "Rahman Md Arafatur; Tan Sze Wei; Sohail Mohammed Saad; Gaggero Giovanni Battista; Patrone Fabio; Marchese Mario; Pillai Prashant",
      "author_ids": "55457938100;59173456600;60102416500;57216708944;56536292600;7004398165;7102162572",
      "authorAffiliationIds": "60007173;60007173;60025153;60025153;60025153;60025153;60007173",
      "corresponding": "Rahman M.A.",
      "keywords": "Automotive Cybersecurity | CAN Bus Security | Connected Vehicles | CyberVehiCare | Software-Defined Radio | Testbed | V2X Communication | Vehicle Health Monitoring",
      "abstract": "The increasing integration of connectivity features in modern vehicles has expanded the attack surface for cyber threats, underscoring the need for robust cybersecurity research tools. This paper introduces CyberVehiCare, an innovative and realistic testbed designed to support the analysis and validation of cybersecurity mechanisms for Vehicle-to-Everything (V2X) automotive systems. By combining real components from a commercial vehicle with emulated V2X modules, CyberVehiCare enables comprehensive testing of in-vehicle and external communication vulnerabilities. The platform supports experimentation with cyberattacks, vulnerability assessments, and the development of security countermeasures, contributing to safer and more resilient automotive networks. The testbed's design, implementation, and validation are discussed, highlighting its potential to advance research.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-105015449486",
      "title": "Power-Domain Non-Orthogonal Multiple Access for Distributed Non-Terrestrial Networks: A Semi-Analytical Throughput Estimation",
      "doi": "10.1109/MetroAeroSpace64938.2025.11114494",
      "venue": "2025 IEEE International Workshop on Metrology for Aerospace Metroaerospace 2025 Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": null,
      "issue_id": null,
      "pages": "233-238",
      "issn": null,
      "eIssn": null,
      "source_id": "21101329124",
      "authors": "Comisso Massimiliano; Babich Fulvio; Buttazzoni Giulia; Carini Alberto; Carrato Sergio; Marsi Stefano; Patrone Fabio; Sacchi Claudio; Vatta Francesca",
      "author_ids": "13908144400;7003613315;35241920800;7005389788;7004596594;6602130428;56536292600;56206655300;7004425898",
      "authorAffiliationIds": "60018363;60018363;60018363;60018363;60018363;60018363;60025153;60015986;60018363",
      "corresponding": "Comisso M.",
      "keywords": "distributed UAV/satellite networks | power statistic | Power-domain NOMA | throughput evaluation",
      "abstract": "This paper analyzes the application of power-domain non-orthogonal multiple access (PD-NOMA) techniques in contention-based aerial and spatial contexts, by specifically focusing on the many-to-one scenario. The proposed work moves from the derivation of closed-form expressions for the statistic of the power received by a common destination from a single source, subsequently extending the investigation to the performance evaluation of the whole network. More precisely, Nakagami fading in drone swarms characterized by random waypoint mobility and scintillation effects in space subnets with uniformly located satellites are addressed by analytically calculating the power distribution and then numerically determining the achievable throughput. Moreover, the success probability for the single packet reception attempt is calculated by considering, beside the usually adopted Shannon bound, also a more realistic code-modulation scheme relying on a combination of fixed quadrature phase-shift keying modulation and efficient coding. The presented semi-analytical model is then exploited to examine the influence of these latter elements and of the propagation parameters on the behavior of distributed non-terrestrial PD-NOMA networks.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-105012585767",
      "title": "Scalable Satellite Handover Management in Non-Terrestrial Networks: A Distributed MADQL Approach",
      "doi": "10.1109/TAES.2025.3594697",
      "venue": "IEEE Transactions on Aerospace and Electronic Systems",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2025,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "00189251",
      "eIssn": "15579603",
      "source_id": "17336",
      "authors": "Badini Nour; Jaber Mona; Marchese Mario; Patrone Fabio",
      "author_ids": "57854682900;56970872000;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Badini N.",
      "keywords": "Deep Reinforcement Learning | LEO Satellite Handover | Non-Terrestrial Networks | Resource Management | Satellite Communications and Networking",
      "abstract": "Satellite communications provide means for extending next-generation communication technology to areas beyond terrestrial network coverage. Multiple Low Earth Orbit (LEO) satellites have been deployed in constellations to offer ground users direct Internet connection at any time, place, and condition. However, integrating Non-Terrestrial Networks (NTNs) into terrestrial communication systems presents several challenges, including the management of handover strategies due to the rapid satellite movement. Even if previous studies have explored various approaches to optimize handovers in NTNs, they have often overlooked critical factors, such as user-specific data throughput requirements, limited satellite energy, and the need for dynamic adaptation to real-time network conditions. To address these gaps, this paper proposes a Scalable Multi-Agent Satellite Handover (SMASH) framework based on Distributed Multi-Agent Deep Q-Learning for optimized handover decisions and dynamic satellite selection. SMASH aims to ensure seamless connectivity while effectively managing satellite resources to meet diverse demands. It features an adaptive resource allocation strategy driven by user demands and network conditions, thereby ensuring application-specific Quality of Service requirements. We validate and evaluate SMASH using a satellite network simulator, conducting a comprehensive sensitivity analysis and benchmarking its performance against existing approaches in the literature. The proposed handover technique significantly enhances NTN communication performance by reducing the average number of handovers and optimizing satellite resource allocation, thereby preventing user blocking. The SMASH framework ensures continuous service delivery by dynamically adapting to fluctuations in both user demand and satellite resource availability.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 93,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 89,
              "rank": 109,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105012214121",
      "title": "Evaluating Performance in Satellite Communication Networks: An NS3-Based Simulation Study",
      "doi": "10.1109/AERO63441.2025.11068597",
      "venue": "IEEE Aerospace Conference Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "1095323X",
      "eIssn": null,
      "source_id": "75113",
      "authors": "Badini Nour; Patrone Fabio; Zanon Arianna Miraval; Marchese Mario",
      "author_ids": "57854682900;56536292600;57200721477;7004398165",
      "authorAffiliationIds": "60025153;60025153;60031612;60025153",
      "corresponding": "Badini N.",
      "keywords": null,
      "abstract": "Next-generation communication technologies aim to meet the evolving demands of users, emphasizing seamless access to high-quality services regardless of location or time constraints. However, conventional ground-based networks face limitations in providing Internet connectivity to users on several moving platforms, such as airplanes, ships, and trains, as well as in remote areas where building an extensive terrestrial infrastructure is economically unfeasible. To address these challenges, researchers and standardization organizations, such as the ITU, ETSI, ESA, and 3GPP, are exploring the integration of satellites into communication systems. Satellites are appealing thanks to their unique capabilities in delivering reliable connectivity across diverse geographical regions, independent of environmental factors and events, such as climate or natural disasters. However, a thorough investigation and verification is essential to deal with several aspects and allow testing the developed solutions in controlled environment before integrating them into operational systems. Accurate simulation tools play a crucial role in modeling propagation environments and network dynamics to ensure effective deployment and optimization of satellite communication networks. This paper presents a Network Simulator 3 (NS3)-based simulation tool that encompasses several key functionalities to ensure an accurate modeling of communications in Satellite-Terrestrial Integrated Networks (STIN). Among the offered functionalities, the simulator includes a mobility model based on the NORAD Simplified General Perturbations 4 (SGP4) mathematical model to simulate Low Earth Orbit (LEO) satellite movements, mobility models tailored for ground users (pedestrian, vehicles, train, and airplanes), and channel models, based on the 3GPP's Technical Report (TR) 38.811, representing different environments (dense urban, urban, suburban, and rural) including atmospheric absorption and clutter effects to provide accurate estimations of signal propagation and Signal-to-Noise Ratio (SNR) calculations. This paper also presents a comprehensive study evaluating the performance in different network settings with a focus on satellite-to-ground SNR and maximum link capacity calculations across Ka- and S-bands, showcasing the effectiveness of using NS3 as a simulation platform to assess performance in LEO satellite networks. By integrating factors such as node positioning, channel modeling, and environmental influences, we offer valuable insights into the design and optimization of satellite communication systems for diverse deployment scenarios, aiming to narrow the gap between simulation and real-world deployment and paving the path for more efficient and resilient satellite communication networks in the future.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 45,
              "rank": 88,
              "quartile": "Q3"
            },
            {
              "subject": "Space and Planetary Science",
              "percentile": 35,
              "rank": 67,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-105002903093",
      "title": "On the Latency Trade-off Between Space and Terrestrial Clouds in Non-Terrestrial Networks",
      "doi": "10.1109/ASMS/SPSC64465.2025.10946050",
      "venue": "2025 12th Advanced Satellite Multimedia Systems Conference and the 18th Signal Processing for Space Communications Workshop Asms Spsc 2025",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2025,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "21101289793",
      "authors": "Rojas Camilo; Fraire Juan A.; Patrone Fabio; Marchese Mario",
      "author_ids": "57202198493;55667636500;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60013373-60000658;60025153;60025153",
      "corresponding": "Rojas C.",
      "keywords": "Multi-access Edge Computing",
      "abstract": "Non-Terrestrial Networks (NTN) are poised to revolutionize 5G and 6G networks by integrating terrestrial and space-based cloud systems, enabling dynamic task allocation for optimal performance. Despite their promise, understanding the trade-offs between terrestrial and non-terrestrial edge computing architectures remains an area for improvement. This paper presents a comprehensive latency-focused trade-off analysis using a novel real-time emulation platform that accurately models terrestrial and space cloud environments. By evaluating network latency across geodesic distances from a fixed ground gateway, we delineate scenarios where terrestrial clouds excel and identify conditions under which Space Cloud architectures surpass their terrestrial counterparts. Additionally, we analyze how server placement strategies in satellite constellations impact performance, revealing the critical interplay between server distribution and latency outcomes. These findings offer actionable insights for designing and operating hybrid cloud systems, emphasizing the need for tailored architectures to maximize the potential of NTN-based edge computing.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85213818194",
      "title": "Federated Learning for Rule-Based Systems: Preliminary Studies",
      "doi": "10.1109/RTSI61910.2024.10761552",
      "venue": "8th IEEE International Forum on Research and Technologies for Society and Industry Innovation Rtsi 2024 Proceeding",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "143-148",
      "issn": null,
      "eIssn": null,
      "source_id": "21101267110",
      "authors": "Samandari Ahmad; Marchese Mario; Paglialonga Alessia; Patrone Fabio; Rampa Vittorio; Mongelli Maurizio",
      "author_ids": "59496319300;7004398165;23668671800;56536292600;6603275866;7005882346",
      "authorAffiliationIds": "60025153-60021199;60025153;60021199;60025153;60021199;60021199",
      "corresponding": "Samandari A.",
      "keywords": "Decision Tree | eXplainable AI | Federated Learning | non-IID Data | Rule-Based Systems",
      "abstract": "This study proposes the novel Federated Learning for Interpretable Rule Trees (FL-IRT) method that is introduced here to address the challenges posed by non-Independent and Identically Distributed (non-IID) data distributions and model explainability for the Federated Learning (FL) framework. By exploiting Decision Tree (DT) methods at the client side for interpretability and simplicity, our method is able to accommo-date data with varying distributions across disseminated clients. Through evaluations conducted on a synthetic dataset, our approach exhibits remarkable good accuracy results and very fast convergence w.r.t. the plain Federated Averaging (FedAvg) and Federated Proximal optimization (FedProx) algorithms as well. Notably, a key advantage of our proposed algorithm, especially in IoT applications, lies in its substantially reduced computational time compared to FedAvg and FedProx, while achieving improving interpretability and explainability as well. According to our simulations, FL-IRT was 37.7% faster than FedAvg and 126% faster than FedProx. This efficiency enhancement highlights the practical viability and speed of our algorithm in the context of FL scenarios with devices with limited processing capabilities.",
      "citations": 0,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85211958375",
      "title": "Trusted SMEs for Sustainable Growth of Europeans Economical Backbone to Strengthen the Digital Sovereignty: The KDT Resilient Trust Project",
      "doi": "10.1109/DSD64264.2024.00088",
      "venue": "Proceedings 2024 27th Euromicro Conference on Digital System Design Dsd 2024",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "620-627",
      "issn": null,
      "eIssn": null,
      "source_id": "21101263921",
      "authors": "Aboushady Hassan; Beringuier-Boher Noemie; Burke Kelly; Dallemagne Philippe; De Biase Mario; Di Frangia Manuel; Deniau Virginie; Ferrari Enrico; Gaquiere Christophe; Morche Dominique; Patrone Fabio; Pesci Stefano; Pomante Luigi; Stam Andries; Stornelli Vincenzo; Stratigopoulos Haralampos G.; Taouil Mottaqiallah; Vaumorin Emmanuel; Villain Jonathan; Steeghs Sander",
      "author_ids": "6602629520;55779244900;59471005800;7003345064;57892795300;59470875700;24466454100;26637957600;7003970918;6603016362;56536292600;59470494400;55905317800;12751767400;9640252200;6506132589;35771648500;36571069100;57209748921;57196223990",
      "authorAffiliationIds": "132036112;132036246;117768780;60003767;129774334;60010192;60138422;132036603;131229694;60104653;60025153;132036249;60018783;106742251;60018783;60001422;60006288;132036492;60138422;106742251",
      "corresponding": "Aboushady H.",
      "keywords": "IoT | Resilience | Security | Trust",
      "abstract": "The Internet of Things is promising as it drives the datafication of our everyday life and thus, leverages synergies between originally considered 'dead' things and enables them to proactively serve humans. IoT5.0, an Artificial Intelligence assisted Internet of Things, could even more benefit society, as the devices could even learn how to provide more value. But the ubiquitous connectivity comes at a cost. Security levels have to rise tremendously to ensure a network stays secure and safe for humans. This additional effort often is a burden for small and medium sized enterprises as the complexity and security demands of such systems rise faster than available resources. Consequently., RESILIENT TRUST focuses on end-to-end security of IoT processing chains with a focus on strong exploitation for SMEs. Moreover, RESILIENT TRUST will address and significantly mitigate the major risks to enable IoT 5.0. That way., this project will be a driver for sustainable development and the generation of convenience and wealth. A solution is proposed to ensure end-to-end security by boosting RESILIENCE and TRUST along different key supply chains of IoT device.",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85206183642",
      "title": "An SDR-Based Framework for Cybersecurity Assessment of Vehicle-to-Everything (V2X) Systems",
      "doi": "10.1109/CSR61664.2024.10679384",
      "venue": "Proceedings of the 2024 IEEE International Conference on Cyber Security and Resilience Csr 2024",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "537-544",
      "issn": null,
      "eIssn": null,
      "source_id": "21101253086",
      "authors": "Sohail Muhammad Saad; Portamauro Giancarlo; Patrone Fabio; Marchese Mario",
      "author_ids": "59364633700;59364527700;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Sohail M.S.",
      "keywords": "Cellular | Decentralized Environmental Notification Message (DENM) | Dedicated Short-Range Communications (DSRC) | In-Vehicle Information (IVI) | Intelligent Transportation Service | On Board Unit (OBU) | Road Side Unit (RSU) | Vehicle to everything",
      "abstract": "In the realm of Vehicle-to-Everything systems and vehicular ad-hoc networks, unique characteristics such as high data speeds and bandwidth requirements distinguish them from conventional wireless technologies. Effective transmission and reception of critical Cooperative Awareness Messages and safety data necessitate advanced hardware and software capable of handling substantial message volumes efficiently. This makes it difficult to assess the vulnerabilities of the system, in particular for non-proprietary parties. For this purpose, with a particular focus on wireless communication channels, a framework based on Software Defined Radio technology is presented to assess vulnerabilities and evaluate the profound security of Vehicle-to-Everything network communications between On Board Unit and Road Side Unit for implications of unauthorized interception and manipulation of vital vehicle data by individuals situated near highways. The paper raises pertinent questions about the security level of Vehicle-to-Everything communications and focuses on the importance of robust cybersecurity measures in safeguarding Vehicle-to-Everything systems against potential threats and ensuring the integrity and safety of vehicular communication channels.",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85202450056",
      "title": "Fuzzy Logic-Based Orchestration of Multi-Access Edge Computing in LEO Satellite Constellations",
      "doi": "10.1109/ICCWorkshops59551.2024.10615305",
      "venue": "2024 IEEE International Conference on Communications Workshops Icc Workshops 2024",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "1685-1690",
      "issn": null,
      "eIssn": null,
      "source_id": "21101245169",
      "authors": "Rojas Camilo; Fraire Juan A.; Patrone Fabio; Marchese Mario",
      "author_ids": "57202198493;55667636500;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60013373-60000658;60025153;60025153",
      "corresponding": "Rojas C.",
      "keywords": "Multi-access Edge Computing | Satellite Constellation",
      "abstract": "In the fast-evolving domain of satellite communications, massive constellations of LEO satellites are increasingly gaining notice in both academic and industrial sectors. Operating these growing constellations has become a complex challenge, and new obstacles have emerged with integrating cellular networks in the space sector. Some techniques like Multi-access Edge Computing (MEC) were initially designed for static terrestrial networks and should be adapted to the dynamic nature of Non-Terrestrial Networks (NTN). This study introduces an innovative Fuzzy Logic-based controller tailored explicitly for determining the operational status of satellite MEC servers based on historical task loads and task processing failures. Our approach is grounded in a distributed control framework, where each satellite node operates autonomously relying on its own data and limited information from neighboring nodes. We evaluated our fuzzy controller against a baseline strategy, demonstrating significant improvements in reducing the overall active time of MEC nodes. The orchestration effectiveness of these strategies was tested by using our custom-built continuous time emulation framework for satellite constellations. This framework integrates 1) the Simplified General Perturbations Model 4 (SGP4) for orbit propagation, 2) Mininet for network virtualization, 3) Docker for operating system virtualization, and 4) MEC task offloading and orchestration.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85202354976",
      "title": "Advanced Constellation Emulation and Synthetic Datasets Generation for Non-Terrestrial Networks",
      "doi": "10.1109/MeditCom61057.2024.10621248",
      "venue": "2024 IEEE International Mediterranean Conference on Communications and Networking Meditcom 2024",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "37-43",
      "issn": null,
      "eIssn": null,
      "source_id": "21101244717",
      "authors": "Rojas Camilo; Fraire Juan A.; Patrone Fabio; Marchese Mario",
      "author_ids": "57202198493;55667636500;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60013373-60000658;60025153;60025153",
      "corresponding": "Rojas C.",
      "keywords": "Machine Learning | Multi-access Edge Computing | Satellite Constellation | Software-Defined Networks | Synthetic Datasets",
      "abstract": "Mega satellite constellations, now realized entities, encompass thousands of nodes. However, efficient orchestration of multi-hop paths and distributed processing tasks in Non-Terrestrial Networks (NTN) remains a considerable challenge. The integration of NTN systems into 5G cellular networks necessitates innovative adaptations of Software-Defined Networking (SDN) and Multi-access Edge Computing (MEC) to suit the dynamic environments of NTN. In this context, we present MeteorNet, a state-of-the-art emulation tool conceived for satellite constellations. MeteorNet accurately replicates the behavior of NTNs by implementing space orbits, Earth rotation calculations, and Linux network interfaces across diverse network layers. Coupled with a continuous measurement system founded on sFlow, MeteorNet compiles critical switch variables in a centralized database, thus providing a distinctive methodology for creating realistic synthetic datasets. The pertinence of synthetic datasets is paramount in NTN, given the scarcity of operative systems and the inaccessibility of accurate data from the few existing systems due to proprietary constraints. These datasets are instrumental for formulating and training intelligent control algorithms and Machine Learning (ML) models for SDN and MEC advancements in NTN. To illustrate the efficacy of this approach, we explore a realistic networking case study with a ring topology, demonstrating how data models describe intricate routing and edge computing protocols for NTN.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85200261460",
      "title": "User-Centric Satellite Handover for Multiple Traffic Profiles Using Deep Q-Learning",
      "doi": "10.1109/TAES.2024.3434771",
      "venue": "IEEE Transactions on Aerospace and Electronic Systems",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2024,
      "volume": "60",
      "issue_id": "6",
      "pages": "8591-8604",
      "issn": "00189251",
      "eIssn": "15579603",
      "source_id": "17336",
      "authors": "Badini Nour; Jaber Mona; Marchese Mario; Patrone Fabio",
      "author_ids": "57854682900;56970872000;7004398165;56536292600",
      "authorAffiliationIds": "60025153-60022109;60025153-60022109;60025153-60022109;60025153-60022109",
      "corresponding": "Badini N.",
      "keywords": "Deep neural network (DNN) | deep Q-learning (DQL) | distributed satellite handover (HO) | multiagent reinforcement learning (MARL) | satellite-terrestrial integrated network (STIN) simulator",
      "abstract": "Multiple low Earth orbit (LEO) satellites have recently been launched in constellations to ensure direct Internet access to users anywhere and at any time. Due to the high-speed mobility of LEO satellites, users undergo multiple handovers (HOs) during their service time, which has a negative impact on users' quality of service (QoS) if occurred in high frequency. Moreover, next-generation communication technologies are designed to support a wide spectrum of applications, including artificial intelligence, virtual reality, and Internet of Things. Thus, differentiating user equipments (UEs) with different and varying traffic profiles (TP) has become necessary due to each application's unique performance requirements. However, LEO satellites have limited onboard resources and the launched constellations ensure that each UE will be covered by more than one LEO satellite at any given moment, making it challenging to select the optimal satellite at any given time to assure the optimum QoS. Therefore, a satellite HO strategy has to effectively use the few available satellite resources and prevent network congestion while respecting the various resource requirements per TP. To address all the above requirements, we propose a user-centric multiagent deep Q-network satellite HO strategy, which is the first in the state of the art to address the variety and diversity of UEs' performance requirements and generated traffic statistics. Our method showcases a significant achievement of approximately 60% reduction in HO rate and around 91% reduction in blocking rate compared to conventional single-criterion approaches.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 93,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 89,
              "rank": 109,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 91,
              "rank": 14,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 87,
              "rank": 126,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85199538329",
      "title": "OpenSatRange: An Open Cyber Range for Operators and Users of Satellite Communication Networks",
      "doi": null,
      "venue": "Ceur Workshop Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2024,
      "volume": "3731",
      "issue_id": null,
      "pages": null,
      "issn": "16130073",
      "eIssn": null,
      "source_id": "21100218356",
      "authors": "Patrone Fabio; Loreti Pierpaolo; Fiscariello Luca; Bracciale Lorenzo; Amici Alessandro; Detti Andrea; Roseti Cesare; Zampognaro Francesco; Luglio Michele; Bianchi Giuseppe; Marchese Mario",
      "author_ids": "56536292600;7003459349;59233438400;24722537100;57697346500;6602789368;15127967700;24484308800;7003570928;7203066398;7004398165",
      "authorAffiliationIds": "60025153;60103966;60331872;60103966;60103966;60103966;60331872;60331872;60331872;60103966;60025153",
      "corresponding": "Patrone F.",
      "keywords": "Cyber range | OpenStack | Satellite communication networks",
      "abstract": "In today's rapidly evolving technological landscape and increasing impact of cybersecurity threats and attacks, the development and utilization of cyber ranges have become paramount in enhancing people' s knowledge of cybersecurity. Even if multiple of these tools simulating terrestrial communication networks are already in use, a cyber range focused on satellite communication networks is still missing. This paper describes the ongoing work about the design and development of OpenSatRange (OSR), a cyber range able to simulate/emulate satellite communication networks. Details are provided about the similarities and differences between this tool and the main other cyber ranges, the considered reference scenarios, the defined training exercises, the designed OSR framework and its components, and the planned roadmap to conclude this research project' s funded work.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 11,
              "rank": 214,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2024,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 10,
              "rank": 215,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85194761973",
      "title": "Vulnerability Assessment of Industrial and Agricultural Control Systems within the IoT Framework",
      "doi": "10.1201/9781003326236-19",
      "venue": "Intelligent Computing on Iot 2 0 Big Data Analytics and Block Chain Technology",
      "type": "Book",
      "sub_type": "Book Chapter",
      "year": 2024,
      "volume": null,
      "issue_id": null,
      "pages": "350-371",
      "issn": null,
      "eIssn": null,
      "source_id": "21101225740",
      "authors": "Caviglia Roberto; Davoli Franco; Fausto Alessandro; Gaggero Giovanni; Marchese Mario; Moheddine Aya; Patrone Fabio; Portomauro Giancarlo",
      "author_ids": "57700266100;57220364548;57216708248;57216708944;7004398165;57210886858;56536292600;15128054100",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Caviglia R.",
      "keywords": null,
      "abstract": "Industrial Control System (ICS) is a general term that encompasses different types of control systems, including Supervisory Control and Data Acquisition (SCADA) and Distributed Control Systems (DCS), but also different cyber-physical environments, such as, among others, transportation, dams, emergency services, healthcare, energy, and agricultural systems. An ICS consists of combinations of monitoring and control components that act together to achieve an industrial control objective. ICSs are increasingly relying on Information and Communication Technologies (ICTs). ICSs have evolved including ICT capabilities into existing physical systems, often replacing or supplementing physical control mechanisms. Internet of Things (IoT) communication technologies are part of this action.",
      "citations": 2,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85144832641",
      "title": "UAV-based LoRaWAN flying gateway for the internet of flying things",
      "doi": "10.1002/dac.5421",
      "venue": "International Journal of Communication Systems",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2023,
      "volume": "36",
      "issue_id": "5",
      "pages": null,
      "issn": "10745351",
      "eIssn": "10991131",
      "source_id": "17964",
      "authors": "Moheddine Aya; Patrone Fabio; Marchese Mario",
      "author_ids": "57210886858;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Moheddine A.",
      "keywords": "data mule | flying gateway | internet of flying things | LoRaWAN | low power wide area network | unmanned aerial vehicle",
      "abstract": "The Internet of Things (IoT) is one of the paradigms related to the evolution of telecommunication networks which is contributing to the evolution of numerous use cases, such as smart city and smart agriculture. However, the current communication infrastructure and wireless communication technologies are not always able to guarantee a proper service for these IoT scenarios. Smart solutions are needed to overcome current terrestrial network limitations offering a cost-effective way to extend the current terrestrial network coverage. For example, temporary extensions “on-request” of the terrestrial infrastructure may be a viable solution to allow collecting data generated by nodes outside the current network coverage. Flying objects can help achieve this goal. Various studies supported the use of unmanned aerial vehicles (UAVs) as intermediate nodes between IoT devices and the network. However, such solutions have not been exhaustively tested yet in real-case scenarios. This paper proposes an efficient solution to collect data from multiple IoT sensors in rural and remote areas based on UAVs. It describes the implementation of the proposed UAV-based Long RangeWide Area Network (LoRaWAN) flying gateway able to collect data directly from LoRaWAN sensors during its flight, keep them stored in an onboard memory, and forward them at the end of its flying path to a platform where the authorized users can access them. A prototype of the gateway has been developed to assess the proposed solution through both indoor and outdoor tests aiming to test its feasibility both in terms of communication performance and UAV-required hardware resources.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 69,
              "rank": 309,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 68,
              "rank": 171,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 72,
              "rank": 218,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 68,
              "rank": 123,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85200537490",
      "title": "Routing in Scalable Delay-Tolerant Space Networks with Graph Neural Networks",
      "doi": null,
      "venue": "International Conference on Embedded Wireless Systems and Networks",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": "25622331",
      "source_id": "21101067699",
      "authors": "Olmedo Matías; Fraire Juan A.; Cherini Renato; Patrone Fabio; Marchese Mario",
      "author_ids": "57544437200;55667636500;35247776600;56536292600;7004398165",
      "authorAffiliationIds": "60020507;60016253-60004518;60000658;60025153;60025153",
      "corresponding": "Olmedo M.",
      "keywords": null,
      "abstract": "Space networks are challenged by long propagation delays and prolonged link disruptions, which require Delay-Tolerant Networking (DTN) mechanisms. Contact Graph Routing (CGR) exploits the a priori available topology knowledge derived from the predictable trajectories to compute optimal end-to-end routes. However, state-of-the-art CGR is limited in the scalability and stability of the computation effort, which is critical in resource-constrained spacecraft. To overcome this issue, this paper presents GAUSS: a graph neural network-based routing for scalable delay-tolerant space networks. By harvesting recent advances in Graph Neural Networks (GNNs), we can improve the scalability of CGR by a factor of two while narrowing the variability down to one-third in realistic cislunar and near-Earth systems.",
      "citations": 0,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 17,
              "rank": 451,
              "quartile": "Q4"
            },
            {
              "subject": "Information Systems",
              "percentile": 16,
              "rank": 414,
              "quartile": "Q4"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 16,
              "rank": 831,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 35,
              "rank": 515,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 30,
              "rank": 276,
              "quartile": "Q3"
            },
            {
              "subject": "Information Systems",
              "percentile": 28,
              "rank": 281,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85191259429",
      "title": "Continuous Time Emulation for Software-Defined Non-Terrestrial Edge Computing Networks",
      "doi": null,
      "venue": "28th European Wireless Conference Ew 2023",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": "223-228",
      "issn": null,
      "eIssn": null,
      "source_id": "21101216404",
      "authors": "Rojas Camilo; Fraire Juan A.; Patrone Fabio; Gotta Alberto; Marchese Mario",
      "author_ids": "57202198493;55667636500;56536292600;9846429300;7004398165",
      "authorAffiliationIds": "60025153;60016253-60000658;60025153;60008218;60025153",
      "corresponding": "Rojas C.",
      "keywords": "Multi-access Edge Computing | Satellite Constellation | Software-Defined Networks",
      "abstract": "As satellite constellations for communications rise in importance in both academic and industrial circles, we face the challenge of adapting Software-Defined Networks (SDN) and Multi-access Edge Computing (MEC), initially designed for static terrestrial networks, for the dynamic nature of Non-Terrestrial Networks (NTN). This paper presents MeteorNet, a continuous time emulation framework grounded in realistic orbital propagators, Mininet, and Docker virtualization, designed to develop and test space mission software. Our solution adapts link characteristics according to constellation orbits and Earth dynamics using Linux network interfaces. We provide the results of a tested networking scenario detailing how network usage measurements and output data analysis can be used to examine the behavior of routing protocols within the framework. This work underscores the necessity for appropriate network management and transport protocol adaptations for effective communication in emerging satellite constellations.",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85190246987",
      "title": "Energy-Aware Satellite Handover Based on Deep Reinforcement Learning",
      "doi": "10.1109/GCWkshps58843.2023.10464394",
      "venue": "2023 IEEE Globecom Workshops GC Wkshps 2023",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": null,
      "issue_id": null,
      "pages": "437-442",
      "issn": null,
      "eIssn": null,
      "source_id": "21101214471",
      "authors": "Badini Nour; Jaber Mona; Marchese Mario; Patrone Fabio",
      "author_ids": "57854682900;56970872000;7004398165;56536292600",
      "authorAffiliationIds": "60025153-60022109;60022109;60025153;60025153",
      "corresponding": "Badini N.",
      "keywords": "Deep Neural Network | Deep Q-Learning | Energy Efficiency | Multi-Agent Reinforcement Learning | Satellite Handover | Satellite-Terrestrial Integrated Network Simulator",
      "abstract": "Multiple Low Earth Orbit (LEO) satellites have been deployed in constellations to provide User Equipments (UE)s with direct Internet connection at all times and from any location. UEs experience several handovers (H O)s during their service period due to the high speed of LEO satellites, which has a bad influence on UEs' Quality of Service (QoS) if occurred extensively. Furthermore, next-generation communication technologies are intended to serve a broad range of applications each with unique performance needs, thus distinguishing UEs with diverse and varied Traffic-Profiles (TP) has become necessary. Moreover, LEO satellites have limited onboard resources (e.g., energy and channel resources), and the deployed constellations ensure that each UE is covered by more than one LEO satellite at any time, making it difficult to pick the best satellite at each time to provide the best QoS. Therefore, a satellite HO strategy has to effectively use the limited available satellite resources and prevent network congestion while respecting the various TPs per UE. To address the aforementioned challenges, we propose a Load Balancing Energy Aware Satellite Handover (LBEASH) strategy, that is the first in the state of the art to address the limited energy resource of LEO satellites and the variety of UEs' performance requirements. The proposed LBEASH showcases significant achievements by avoiding unnecessary HOs and achieving a zero blocking rate while balancing the load among the satellites.",
      "citations": 1,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85178287743",
      "title": "Reinforcement Learning-Based Load Balancing Satellite Handover Using NS-3",
      "doi": "10.1109/ICC45041.2023.10279521",
      "venue": "IEEE International Conference on Communications",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2023,
      "volume": "2023-May",
      "issue_id": null,
      "pages": "2595-2600",
      "issn": "15503607",
      "eIssn": null,
      "source_id": "33201",
      "authors": "Badini Nour; Jaber Mona; Marchese Mario; Patrone Fabio",
      "author_ids": "57854682900;56970872000;7004398165;56536292600",
      "authorAffiliationIds": "60025153-60022109;60022109;60025153;60025153",
      "corresponding": "Badini N.",
      "keywords": "5G Satellite-Terrestrial Integrated Networks | NS-3 | Reinforcement Learning | Satellite Handover",
      "abstract": "The Fifth-Generation of Mobile Communications (5G) is intended to meet users' growing needs for high-quality services at any time and from any location. The unique features of Low Earth Orbit (LEO) satellites in terms of higher coverage, reliability, and availability, can help expand the reach of 5G and beyond technologies to support those needs. However, because of their high speeds, a single LEO satellite is unable to provide continuous service to multiple User Equipments (UEs) spread over a large (potentially worldwide) area, resulting in the need for LEO satellite constellations with a high number of satellites and a consequent high amount of satellite handovers (HOs). Moreover, UEs can only acquire partial information about the satellite system and compete for the limited available communication resources of the satellites, requiring the implementation of a decentralized satellite HO strategy to avoid network congestion. In this paper, we propose a decentralized Load Balancing Satellite HO (LBSH) strategy based on multi-agent reinforcement Q-learning, implemented within the software Network Simulator 3 (NS-3). LBSH aims to reduce the total number of HOs and the blocking rate while balancing the load distribution among satellites. Our results show that the proposed LBSH method outperforms the state-of-the-art methods in terms of a 95% drop in the average number of HOs per user and an 84% reduction in blocking rate.",
      "citations": 11,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85166118794",
      "title": "Intelligent Space Communication Networks",
      "doi": "10.1007/978-3-031-30762-1_7",
      "venue": "Signals and Communication Technology",
      "type": "Book Series",
      "sub_type": "Book Chapter",
      "year": 2023,
      "volume": "Part F1069",
      "issue_id": null,
      "pages": "171-183",
      "issn": "18604862",
      "eIssn": "18604870",
      "source_id": "21100901476",
      "authors": "Marchese Mario; Morosi Simone; Patrone Fabio",
      "author_ids": "7004398165;6701609673;56536292600",
      "authorAffiliationIds": "60025153;60021859;60025153",
      "corresponding": "Marchese M.",
      "keywords": "Artificial intelligence | Edge computing | Remote sensing | Resource allocation | Security | Space communications",
      "abstract": "Nowadays more than ever, we are witnessing an astonishing design and development of Artificial Intelligence (AI)-based solutions applied to a very wide set of problems and systems. Even if some of these techniques were already known, the world technological level was not high enough to guarantee their useful development in a wide set of applications and services. This recently changed. AI-based solutions are currently under study and development in communication networks to make them more “aware” of their situation, help them improve some of their functionalities (such as resource allocation), and allow them to offer an improved and more “smart” service to the final users. This applies also to satellite communication networks. This chapter offers an overview of the improvements due to the introduction of AI-based solutions in satellite communication networks, the aspects that distinguish the different solutions, the functionalities offered thanks to this integration, and the status of the main research activities and projects in this research field.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 23,
              "rank": 420,
              "quartile": "Q4"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 23,
              "rank": 766,
              "quartile": "Q4"
            },
            {
              "subject": "Signal Processing",
              "percentile": 22,
              "rank": 151,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 17,
              "rank": 316,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 19,
              "rank": 643,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 16,
              "rank": 268,
              "quartile": "Q4"
            },
            {
              "subject": "Signal Processing",
              "percentile": 15,
              "rank": 111,
              "quartile": "Q4"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 12,
              "rank": 347,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85166110138",
      "title": "The Role of Satellite in 5G and Beyond",
      "doi": "10.1007/978-3-031-30762-1_2",
      "venue": "Signals and Communication Technology",
      "type": "Book Series",
      "sub_type": "Book Chapter",
      "year": 2023,
      "volume": "Part F1069",
      "issue_id": null,
      "pages": "41-66",
      "issn": "18604862",
      "eIssn": "18604870",
      "source_id": "21100901476",
      "authors": "Marchese Mario; Patrone Fabio; Guidotti Alessandro",
      "author_ids": "7004398165;56536292600;56948758400",
      "authorAffiliationIds": "60025153;60025153;60103966",
      "corresponding": "Marchese M.",
      "keywords": "5G | 6G | Beyond 5G | Non-terrestrial networks | Radio access network",
      "abstract": "The first global standard for Satellite Communications (SatCom) was published in April 2022 within 3GPP Release 17. It specifies the features enabling 4G/5G systems to support a satellite component. More than technical specifications, it also enables the integration of the satellite industry in the 3GPP ecosystem, involving organizations at a worldwide level to ensure a global market. Already the decision has been made to define, as part of 3GPP Release 18, some enhancing features to improve the performances and/or to provide new capabilities. Discussions on the contents of Release 19 for the satellite enabling features have started in the service requirement working group of 3GPP. In this framework, it is timely to undertake a study on the technologies for SatCom as part of Beyond 5G (B5G), i.e., 5G-Advanced and 6G. In fact, while Release 17 Non-Terrestrial Network (NTN) provides a solid ground for future satellite networks integrated into the 5G system, a significant innovation breakthrough in technologies, techniques, and architectures is needed to prepare for the next generation. In this chapter, we: (1) detail the 3GPP NTN ecosystem in terms of architectures and challenges; (2) discuss the services and applications; and (3) identify the research challenges to be addressed towards B5G.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 23,
              "rank": 420,
              "quartile": "Q4"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 23,
              "rank": 766,
              "quartile": "Q4"
            },
            {
              "subject": "Signal Processing",
              "percentile": 22,
              "rank": 151,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 17,
              "rank": 316,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 19,
              "rank": 643,
              "quartile": "Q4"
            },
            {
              "subject": "Control and Systems Engineering",
              "percentile": 16,
              "rank": 268,
              "quartile": "Q4"
            },
            {
              "subject": "Signal Processing",
              "percentile": 15,
              "rank": 111,
              "quartile": "Q4"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 12,
              "rank": 347,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85161519280",
      "title": "An SDR-Based Cybersecurity Verification Framework for Smart Agricultural Machines",
      "doi": "10.1109/ACCESS.2023.3282169",
      "venue": "IEEE Access",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2023,
      "volume": "11",
      "issue_id": null,
      "pages": "54210-54220",
      "issn": null,
      "eIssn": "21693536",
      "source_id": "21100374601",
      "authors": "Caviglia Roberto; Gaggero Giovanni; Portomauro Giancarlo; Patrone Fabio; Marchese Mario",
      "author_ids": "57700266100;57216708944;15128054100;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Caviglia R.",
      "keywords": "autonomous machines | cybersecurity | penetration test | Smart agriculture | software defined radio (SDR) | wireless communications",
      "abstract": "The agricultural sector increasingly makes use of automated and/or remotely-controlled machines to improve performance and reduce costs. These machines, called Smart Agricultural Machines (SAMs), integrate different information and communication technologies for monitoring and control purposes and can be remotely controlled by using proprietary protocols. This makes it difficult to assess the vulnerabilities of the system, in particular for non-proprietary-parties. SAMs are cyber-physical systems often employing private protocols and can be objects of attacks. In this context the paper proposes a framework, based on Software Defined Radio (SDR) technology, for cybersecurity verification of SAMs, in order to fill the gap in the state of the art since no technical standard specifically addresses cybersecurity in this environment; the paper describes the testbed developed and exploited to show the effectiveness in detecting vulnerabilities and assessing the SAM security, in particular focusing on the wireless communication channels, and reports the obtained results.",
      "citations": 11,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 88,
              "rank": 42,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 83,
              "rank": 41,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 78,
              "rank": 101,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2023,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 92,
              "rank": 23,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 87,
              "rank": 29,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 83,
              "rank": 77,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85136848513",
      "title": "Performance Evaluation of a Satellite Communication-Based MEC Architecture for IoT Applications",
      "doi": "10.1109/TAES.2022.3199330",
      "venue": "IEEE Transactions on Aerospace and Electronic Systems",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "58",
      "issue_id": "5",
      "pages": "3775-3785",
      "issn": "00189251",
      "eIssn": "15579603",
      "source_id": "17336",
      "authors": "Luglio Michele; Marchese Mario; Patrone Fabio; Roseti Cesare; Zampognaro Francesco",
      "author_ids": "7003570928;7004398165;56536292600;15127967700;24484308800",
      "authorAffiliationIds": "60027509;60025153;60025153;60027509;60027509",
      "corresponding": "Luglio M.",
      "keywords": "Internet of Things (IoT) | Message Queuing Telemetry Transport (MQTT) | multi-Access edge computing (MEC) | satellite communications (SatCom)",
      "abstract": "New scenarios and use cases are raising following the birth of the fifth generation of mobile communications. The Internet of Things (IoT) is one of the main use cases which are growing, leading to a massive amount of data that need to be exchanged throughout the Internet. Satellite communication networks are essential in remote and isolated environments and can support fully connected environments by offloading the terrestrial infrastructure concerning delayatolerant traffic flows. However, satellite network resources are limited and expensive, so they need to be carefully used in order to avoid waste and satisfy the required user performance. The multi-Access edge computing (MEC) concept can be exploited in this context to allow data preprocessing at the edge, i.e., close to the users, so reducing the amount of data that has to traverse the backhaul satellite link and, in some cases, reducing data delivery times. This article analyses the performance of a satellite architecture in the IoT framework highlighting the advantages brought by MEC, also including data aggregation and compression techniques.",
      "citations": 24,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 93,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 89,
              "rank": 109,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 89,
              "rank": 15,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 83,
              "rank": 119,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85132519369",
      "title": "Flow Assignment and Processing on a Distributed Edge Computing Platform",
      "doi": "10.1109/TVT.2022.3172792",
      "venue": "IEEE Transactions on Vehicular Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "71",
      "issue_id": "8",
      "pages": "8783-8795",
      "issn": "00189545",
      "eIssn": "19399359",
      "source_id": "17393",
      "authors": "Davoli Franco; Marchese Mario; Patrone Fabio",
      "author_ids": "57220364548;7004398165;56536292600",
      "authorAffiliationIds": "60025153-60103966;60025153;60025153-60103966",
      "corresponding": "Davoli F.",
      "keywords": "5G | distributed computing | Flow assignment | MEC | resource allocation",
      "abstract": "The evolution of telecommunication networks toward the fifth generation of mobile services (5G), along with the increasing presence of cloud-native applications, and the development of Cloud and Mobile Edge Computing (MEC) paradigms, have opened up new opportunities for the monitoring and management of logistics and transportation. We address the case of distributed streaming platforms with multiple message brokers to develop an optimisation model for the real-time assignment and load balancing of event streaming generated data traffic among Edge Computing facilities. The performance indicator function to be optimised is derived by adopting queuing models with different granularity (packet- and flow-level) that are suitably combined. A specific use case concerning a logistics application is considered and numerical results are provided to show the effectiveness of the optimisation procedure, also in comparison to a 'static' assignment proportional to the processing speed of the brokers.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 97,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 93,
              "rank": 63,
              "quartile": "Q1"
            },
            {
              "subject": "Automotive Engineering",
              "percentile": 93,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 93,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 97,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Automotive Engineering",
              "percentile": 96,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 95,
              "rank": 17,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 94,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85128868852",
      "title": "Orbital Edge Offloading on Mega-LEO Satellite Constellations for Equal Access to Computing",
      "doi": "10.1109/MCOM.001.2100818",
      "venue": "IEEE Communications Magazine",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "60",
      "issue_id": "4",
      "pages": "32-36",
      "issn": "01636804",
      "eIssn": "15581896",
      "source_id": "17249",
      "authors": "Cassara Pietro; Gotta Alberto; Marchese Mario; Patrone Fabio",
      "author_ids": "24767643400;9846429300;7004398165;56536292600",
      "authorAffiliationIds": "60008218-128037071;60008218-60000251;60025153;60025153",
      "corresponding": "Cassara P.",
      "keywords": null,
      "abstract": "Mega-LEO satellite constellations are becoming a concrete reality. Companies such as SpaceX, Virgin Orbit, and OneWeb have already started launching hundreds of LEO satellites and are turning their services on. Even if the aim of such LEO satellite constellations is just, for now, to offer worldwide Internet access equality, their deployment proves their feasibility and suggests usefulness for further purposes. In this article, we shed some light on the possible integration of the in-network computing paradigm in mega-LEO satellite constellations. Terrestrial and/or non-terrestrial nodes can benefit from offloading the computing to an orbital edge (OE) platform reachable through the satellite constellation, exploiting its fast and distributed computational capability. In this context, a preliminary analysis highlights that task offloading strategies can lead to performance improvements that open up novel challenges in the design and setup of OE platforms.",
      "citations": 78,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 96,
              "rank": 21,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 95,
              "rank": 46,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 93,
              "rank": 63,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Computer Science Applications",
              "percentile": 98,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 98,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 97,
              "rank": 16,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85140779316",
      "title": "Reduction of the Delays Within an Intrusion Detection System (IDS) Based on Software Defined Networking (SDN)",
      "doi": "10.1109/ACCESS.2022.3214974",
      "venue": "IEEE Access",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2022,
      "volume": "10",
      "issue_id": null,
      "pages": "109850-109862",
      "issn": null,
      "eIssn": "21693536",
      "source_id": "21100374601",
      "authors": "Fausto Alessandro; Gaggero Giovanni; Patrone Fabio; Marchese Mario",
      "author_ids": "57216708248;57216708944;56536292600;7004398165",
      "authorAffiliationIds": "60025153-128791506;60025153;60025153;60025153",
      "corresponding": "Fausto A.",
      "keywords": "Cybersecurity | intrusion detection system (IDS) | key performance indicators (KPI) | OpenFlow | software defined networking (SDN)",
      "abstract": "Software Defined Networking (SDN) is a very useful tool not only to manage networks but also to increase network security, in particular by implementing Intrusion Detection Systems (IDS) directly into the SDN architecture. The implementation of IDS within the SDN paradigm can simplify the implementation, speed up incident responses, and, in general, allow to promptly react to cyber attacks through proper countermeasures. Nevertheless, embedding IDS within SDN also introduces delays that cannot be tolerated in specific network environments, like industrial control systems. This paper focuses on the implementation of an IDS based on Machine Learning (ML) algorithms into an SDN architecture and proposes a very practical approach to reduce the delay by using the sequential implementation of prototypes of increasing software and hardware complexity so allowing quick tests to highlight the main problems, solve them and pass to the next operative step. A fully validated performance evaluation is then shown by exploiting all the presented solutions and by using further improved hardware features. The overall performance is very good and compliant with most, even if not yet all, industrial control systems constraints. Results show how the proposed solutions provide a significant improvement of the latency so opening the door to a real implementation in the field.",
      "citations": 14,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 88,
              "rank": 42,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 83,
              "rank": 41,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 78,
              "rank": 101,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Engineering (all)",
              "percentile": 92,
              "rank": 22,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 89,
              "rank": 25,
              "quartile": "Q1"
            },
            {
              "subject": "Materials Science (all)",
              "percentile": 82,
              "rank": 78,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85137830247",
      "title": "AI for Zero-Touch Management of Satellite Networks in B5G and 6G Infrastructures",
      "doi": null,
      "venue": "Ceur Workshop Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "3189",
      "issue_id": null,
      "pages": null,
      "issn": "16130073",
      "eIssn": null,
      "source_id": "21100218356",
      "authors": "Galli Antonio; Giardina Pietro; Guta Maria; Lossi Leonardo; Mancina Antonio; Moscato Vincenzo; Patrone Fabio; Roseti Cesare; Romano Simon Pietro; Sperlí Giancarlo; Zampognaro Francesco",
      "author_ids": "57210585022;57194397543;55960922300;57219703644;57886464200;8300789300;56536292600;15127967700;7101644319;55510822500;24484308800",
      "authorAffiliationIds": "118613084;60116408;60031159;60116408;113003886;118613084;60025153;106710821;118613084;118613084;106710821",
      "corresponding": "Galli A.",
      "keywords": "AI/ML resource allocation | data management and orchestration | satellite-terrestrial Integrated networks | smart satellite gateway selection",
      "abstract": "Satellite Communication (SatCom) networks are become more and more integrated with the terrestrial telecommunication infrastructure. In this paper, we shows the current status of the still ongoing European Space Agency (ESA) project”Data-driven Network Controller Orchestration for Real time Network Management-ANChOR”. In particular, we propose a Long Short-Term Memory (LSTM)based methodology to drive the dynamic selection of the optimal satellite gateway station, which will be performed by combining different kinds of information (i.e. traffic profile, network and weather conditions). Some preliminary results on the real world dataset shows the effectiveness of the proposed approach.",
      "citations": 1,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 11,
              "rank": 214,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Computer Science (all)",
              "percentile": 21,
              "rank": 184,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85137585931",
      "title": "Comparison between UAV IoT solutions with and without satellite backhaul link",
      "doi": "10.1109/AERO53065.2022.9843367",
      "venue": "IEEE Aerospace Conference Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": "2022-March",
      "issue_id": null,
      "pages": null,
      "issn": "1095323X",
      "eIssn": null,
      "source_id": "75113",
      "authors": "Moheddine Aya; Patrone Fabio; Marchese Mario",
      "author_ids": "57210886858;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Moheddine A.",
      "keywords": null,
      "abstract": "New applications related to the Internet of Things (IoT) concept are constantly growing and wide-spreading. Some of these applications are typically referring to urban environments, such as the applications within Smart City and Smart Home scenarios, while others are mostly referring to rural environments, such as the applications within Smart Agriculture and Smart Grid scenarios. Focusing on rural environments, the use of Unmanned Aerial Vehicles (UAV) can help collect data from multiple IoT devices, such as sensors, which could be spread in a wide area and difficult to physically reach. However, forward these data to storage centers typically deployed on the Cloud or to the Edge of the network closer to the users may be a challenge due to the lack of any telecommunication infrastructure in rural and remote areas. In this paper, we consider two possible solutions both based on a UAV equipped as an IoT communication gateway. We consider the Long Range Wireless Area Network (LoRaWAN) protocol, belonging to the Low Power Wide Area Network (LPWAN) category, as the communication protocol of IoT devices. The considered scenario involves the use of the UAV to collect data generated by multiple IoT LoRaWAn sensors. The difference between the solutions is how these data reach the storage plat-form we assume is located on the Internet. In the first solution, the UAV is directly connected to a storage platform through a simulated satellite link; while in the second solution the UAV acts as a data mule, temporary storing the information onboard during all the data gathering phase downloading it to the storage platform only when it comes back to the landing spot. A performance analysis has been carried out comparing the two solutions in terms of delivery time, required storage space, and energy consumption.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 45,
              "rank": 88,
              "quartile": "Q3"
            },
            {
              "subject": "Space and Planetary Science",
              "percentile": 35,
              "rank": 67,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2022,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 40,
              "rank": 82,
              "quartile": "Q3"
            },
            {
              "subject": "Space and Planetary Science",
              "percentile": 32,
              "rank": 69,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85136415922",
      "title": "NS-3-based 5G Satellite-Terrestrial Integrated Network Simulator",
      "doi": "10.1109/MELECON53508.2022.9843098",
      "venue": "MELECON 2022 IEEE Mediterranean Electrotechnical Conference Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": null,
      "issue_id": null,
      "pages": "154-159",
      "issn": null,
      "eIssn": null,
      "source_id": "21101102123",
      "authors": "Badini Nour; Marchese Mario; Patrone Fabio",
      "author_ids": "57854682900;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Badini N.",
      "keywords": "5G | NS-3 | Satellite-Terrestrial Integrated Networks | System Level Simulator",
      "abstract": "The Fifth-Generation of Mobile Communications (5G) is intended to satisfy the growing needs of users which can be summarised in the ability to access good quality services anywhere and at any time. Those needs can be supported by the integration of satellites in 5G systems due to the unique characteristics of satellites in terms of higher coverage, reliability, and availability. To minimize blind exploitation of new systems, new technologies should be verified and enhanced before being implemented to reduce the required cost and time. Creating a System Level Simulator (SLS) is an excellent way to evaluate new ideas and test novel systems. In this work, we present an open-source SLS based on the software Network Simulator 3 (NS3). This tool allows simulating 5G Satellite-Terrestrial Integrated Networks (STIN) and overcomes the state-of-the-art solutions by supporting Non-Terrestrial Networks (NTN) handover decisions, dynamic BandWidth Part (BWP) selection, and Component Carrier (CC) configurations based on different defined traffic profiles.",
      "citations": 22,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85135051185",
      "title": "A Framework for Network Security Verification of Automated Vehicles in the Agricultural Domain",
      "doi": "10.1109/IEEECONF55059.2022.9810440",
      "venue": "Proceedings of the 2022 26th International Conference Electronics Electronics 2022",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2022,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "21101098734",
      "authors": "Gaggero Giovanni Battista; Fausto Alessandro; Patrone Fabio; Marchese Mario",
      "author_ids": "57216708944;57216708248;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Gaggero G.B.",
      "keywords": "Agriculture | Automation | CANbus | Cybersecurity | Verification",
      "abstract": "The agricultural sector increasingly relies on automated vehicles. These machines are often based on a CANbus control network and equipped with different wireless interfaces to implement different functionalities, such as remote control through radio links, GPS-based localization, and Wi-Fi-based data exchange. Nevertheless, CANbus presents severe vulnerabilities that expose these vehicles to cyberattacks. In this context, it is crucial to develop efficient procedures for network security verification of automated agricultural vehicles. The present work proposes a framework for evaluating the network security of agricultural vehicles based on four main dimensions: CANbus Security and Network Segmentation, Remote control based on Radio-Links, Wireless Gateways, and GPS security. We presents a testbed we are developing to test the proposed procedures, also discussing the related methods and procedures.",
      "citations": 7,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85117331623",
      "title": "Toward the integration of cyber and physical security monitoring systems for critical infrastructures",
      "doi": "10.3390/s21216970",
      "venue": "Sensors",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "21",
      "issue_id": "21",
      "pages": null,
      "issn": "14248220",
      "eIssn": null,
      "source_id": "130124",
      "authors": "Fausto Alessandro; Gaggero Giovanni Battista; Patrone Fabio; Girdinio Paola; Marchese Mario",
      "author_ids": "57216708248;57216708944;56536292600;7003430835;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Fausto A.",
      "keywords": "Anomaly detection | Critical infrastructure | Cybersecurity | Machine learning | Physical security",
      "abstract": "Critical Infrastructures (CIs) are sensible targets. They could be physically damaged by natural or human actions, causing service disruptions, economic losses, and, in some extreme cases, harm to people. They, therefore, need a high level of protection against possible unintentional and intentional events. In this paper, we show a logical architecture that exploits information from both physical and cybersecurity systems to improve the overall security in a power plant scenario. We propose a Machine Learning (ML)-based anomaly detection approach to detect possible anomaly events by jointly correlating data related to both the physical and cyber domains. The performance evaluation showed encouraging results—obtained by different ML algorithms—which highlights how our proposed approach is able to detect possible abnormal situations that could not have been detected by using only information from either the physical or cyber domain.",
      "citations": 26,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Instrumentation",
              "percentile": 90,
              "rank": 19,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 86,
              "rank": 136,
              "quartile": "Q1"
            },
            {
              "subject": "Atomic and Molecular Physics, and Optics",
              "percentile": 85,
              "rank": 36,
              "quartile": "Q1"
            },
            {
              "subject": "Biochemistry",
              "percentile": 84,
              "rank": 72,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 82,
              "rank": 87,
              "quartile": "Q1"
            },
            {
              "subject": "Analytical Chemistry",
              "percentile": 82,
              "rank": 30,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Instrumentation",
              "percentile": 91,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 81,
              "rank": 134,
              "quartile": "Q1"
            },
            {
              "subject": "Atomic and Molecular Physics, and Optics",
              "percentile": 79,
              "rank": 42,
              "quartile": "Q1"
            },
            {
              "subject": "Analytical Chemistry",
              "percentile": 79,
              "rank": 27,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 78,
              "rank": 77,
              "quartile": "Q1"
            },
            {
              "subject": "Biochemistry",
              "percentile": 66,
              "rank": 145,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85101391601",
      "title": "A possible smart metering system evolution for rural and remote areas employing unmanned aerial vehicles and internet of things in smart grids",
      "doi": "10.3390/s21051627",
      "venue": "Sensors",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2021,
      "volume": "21",
      "issue_id": "5",
      "pages": "1-23",
      "issn": "14248220",
      "eIssn": null,
      "source_id": "130124",
      "authors": "Gaggero Giovanni Battista; Marchese Mario; Moheddine Aya; Patrone Fabio",
      "author_ids": "57216708944;7004398165;57210886858;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153",
      "corresponding": "Gaggero G.B.",
      "keywords": "Internet of Things | Low Power Wide Area Network | Smart Grid | Smart Metering | UAV",
      "abstract": "The way of generating and distributing energy throughout the electrical grid to all users is evolving. The concept of Smart Grid (SG) took place to enhance the management of the electrical grid infrastructure and its functionalities from the traditional system to an improved one. To measure the energy consumption of the users is one of these functionalities that, in some countries, has already evolved from a periodical manual consumption reading to a more frequent and automatic one, leading to the concept of Smart Metering (SM). Technology improvement could be applied to the SM systems to allow, on one hand, a more efficient way to collect the energy consumption data of each user, and, on the other hand, a better distribution of the available energy through the infrastructure. Widespread communication solutions based on existing telecommunication infrastructures instead of using ad-hoc ones can be exploited for this purpose. In this paper, we recall the basic elements and the evolution of the SM network architecture focusing on how it could further improve in the near future. We report the main technologies and protocols which can be exploited for the data exchange throughout the infrastructure and the pros and cons of each solution. Finally, we propose an innovative solution as a possible evolution of the SM system. This solution is based on a set of Internet of Things (IoT) communication technologies called Low Power Wide Area Network (LPWAN) which could be employed to improve the performance of the currently used technologies and provide additional functionalities. We also propose the employment of Unmanned Aerial Vehicles (UAVs) to periodically collect energy consumption data, with evident advantages especially if employed in rural and remote areas. We show some preliminary performance results which allow assessing the feasibility of the proposed approach.",
      "citations": 33,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Instrumentation",
              "percentile": 90,
              "rank": 19,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 86,
              "rank": 136,
              "quartile": "Q1"
            },
            {
              "subject": "Atomic and Molecular Physics, and Optics",
              "percentile": 85,
              "rank": 36,
              "quartile": "Q1"
            },
            {
              "subject": "Biochemistry",
              "percentile": 84,
              "rank": 72,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 82,
              "rank": 87,
              "quartile": "Q1"
            },
            {
              "subject": "Analytical Chemistry",
              "percentile": 82,
              "rank": 30,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Instrumentation",
              "percentile": 91,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 81,
              "rank": 134,
              "quartile": "Q1"
            },
            {
              "subject": "Atomic and Molecular Physics, and Optics",
              "percentile": 79,
              "rank": 42,
              "quartile": "Q1"
            },
            {
              "subject": "Analytical Chemistry",
              "percentile": 79,
              "rank": 27,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 78,
              "rank": 77,
              "quartile": "Q1"
            },
            {
              "subject": "Biochemistry",
              "percentile": 66,
              "rank": 145,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85184374513",
      "title": "Data-driven Network Orchestrator for 5G Satellite-Terrestrial Integrated Networks: The ANChOR Project",
      "doi": "10.1109/GLOBECOM46510.2021.9685584",
      "venue": "Proceedings IEEE Global Communications Conference Globecom",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2021,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "23340983",
      "eIssn": "25766813",
      "source_id": "21101199922",
      "authors": "Patrone Fabio; Bacci Giacomo; Galli Antonio; Giardina Pietro; Landi Giada; Luglio Michele; Marchese Mario; Quadrini Mattia; Roseti Cesare; Sperli Giancarlo; Vaccaro Attilio; Zampognaro Francesco",
      "author_ids": "56536292600;22833244700;57210585022;57194397543;24828948800;7003570928;7004398165;57193276812;15127967700;55510822500;25929694800;24484308800",
      "authorAffiliationIds": "60025153;113003886;101576099;60116408;60116408;120521552;60025153;120521552;120521552;101576099;113003886;120521552",
      "corresponding": "Patrone F.",
      "keywords": null,
      "abstract": "Satellite communications (SatCom) have a role of advanced service enablers in the new virtual networks, following 3GPP specifications. Specifically, the satellite peculiar characteristics are of paramount importance to dynamically activate capabilities, such as multicast and broadcast channels, sudden traffic offloading, capacity bonding, and cost-efficient coverage of uncovered areas. A key aspect to achieve a seamless and efficient integration between satellite and terrestrial infrastructures is to make satellite resource management dynamic and with a centralised control of a single orchestrator that has visibility of the end-to-end network. Considering the adoption of Software Defined Networking (SDN) and Network Function Virtualization (NFV) paradigms and the upcoming 5th generation of mobile communications (5G), this paper presents the ongoing work within the European Space Agency (ESA) ANChOR project, whose main output will be a data-driven Network Controller and Orchestrator for SatCom networks. This tool will be based on Artificial Intelligence (AI) / Machine Learning (ML)-based techniques to properly allocate resources exploiting some feedback knowledge of the network and it aims to support different services over 5G integrated satellite-terrestrial networks.",
      "citations": 9,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Signal Processing",
              "percentile": 54,
              "rank": 90,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 52,
              "rank": 260,
              "quartile": "Q2"
            },
            {
              "subject": "Artificial Intelligence",
              "percentile": 47,
              "rank": 262,
              "quartile": "Q3"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 45,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85115267442",
      "title": "A Proposal for the Classification of Methods for Verification and Validation of Safety, Cybersecurity, and Privacy of Automated Systems",
      "doi": "10.1007/978-3-030-85347-1_24",
      "venue": "Communications in Computer and Information Science",
      "type": "Book Series",
      "sub_type": "Conference Paper",
      "year": 2021,
      "volume": "1439 CCIS",
      "issue_id": null,
      "pages": "325-340",
      "issn": "18650929",
      "eIssn": "18650937",
      "source_id": "17700155007",
      "authors": "de la Vara Jose Luis; Bauer Thomas; Fischer Bernhard; Karaca Mustafa; Madeira Henrique; Matschnig Martin; Mazzini Silvia; Nandi Giann Spilere; Patrone Fabio; Pereira David; Proença José; Schlick Rupert; Tonetta Stefano; Yayan Ugur; Sangchoolie Behrooz",
      "author_ids": "24400984100;57197314231;57196706214;57221247822;7004929011;56732951400;55948354000;57208552674;56536292600;56185089900;24067286500;15063379300;18038942400;46061619200;55413889900",
      "authorAffiliationIds": "60000823;60007411;60098241;126919881;60020985;60098241;101259438;60001350;60025153;60001350;60001350;126798598;60083112;126919881;60107281",
      "corresponding": "de la Vara J.L.",
      "keywords": "Automated system | Classification | Cybersecurity | Method | Privacy | Safety | V&V | Verification and validation",
      "abstract": "As our dependence on automated systems grows, so does the need for guaranteeing their safety, cybersecurity, and privacy (SCP). Dedicated methods for verification and validation (V&V) must be used to this end and it is necessary that the methods and their characteristics can be clearly differentiated. This can be achieved via method classifications. However, we have experienced that existing classifications are not suitable to categorise V&V methods for SCP of automated systems. They do not pay enough attention to the distinguishing characteristics of this system type and of these quality concerns. As a solution, we present a new classification developed in the scope of a large-scale industry-academia project. The classification considers both the method type, e.g., testing, and the concern addressed, e.g., safety. Over 70 people have successfully used the classification on 53 methods. We argue that the classification is a more suitable means to categorise V&V methods for SCP of automated systems and that it can help other researchers and practitioners.",
      "citations": 6,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Mathematics (all)",
              "percentile": 30,
              "rank": 287,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 13,
              "rank": 211,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2021,
          "subjects": [
            {
              "subject": "Mathematics (all)",
              "percentile": 32,
              "rank": 263,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Science (all)",
              "percentile": 16,
              "rank": 194,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85095710975",
      "title": "A Unified Optimisation Framework for QoS Management and Congestion Control in VHTS Systems",
      "doi": "10.1109/TVT.2020.3015252",
      "venue": "IEEE Transactions on Vehicular Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "69",
      "issue_id": "10",
      "pages": "11619-11631",
      "issn": "00189545",
      "eIssn": "19399359",
      "source_id": "17393",
      "authors": "De Cola Tomaso; Marchese Mario; Mongelli Maurizio; Patrone Fabio",
      "author_ids": "10739364500;7004398165;7005882346;56536292600",
      "authorAffiliationIds": "60007798;60025153;60021199;60025153",
      "corresponding": "De Cola T.",
      "keywords": "Congestion control | feeder link outage | QoS management | satellite communications",
      "abstract": "The design of Very High Throughput Satellite (VHTS) systems will be an important milestone for future telecommunications systems in the light of the ongoing integration between satellite and 5G technologies as well as with the upcoming 6 G evolution. To this end, satellite systems will be operating at EHF frequency bands, hence requiring a special attention to the overall network design in terms of ground and space segment optimisation. In particular, the mitigation of feeder link outage events through advanced prediction techniques and the exploitation of smart gateway diversity concepts will be combined with an overarching network resources' orchestration, jointly conceived to meet the QoS requirements of the end users. In this respect, this paper proposes a novel optimisation framework able to achieve very high throughput system figures, building on an adaptive QoS management concept. The proposed framework has been compared with other existing solutions from the literature and validated by means of extensive simulation campaigns, whose collected results show significant performance improvements.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 97,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 93,
              "rank": 63,
              "quartile": "Q1"
            },
            {
              "subject": "Automotive Engineering",
              "percentile": 93,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 93,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": null,
              "percentile": 98,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Aerospace Engineering",
              "percentile": 98,
              "rank": 3,
              "quartile": "Q1"
            },
            {
              "subject": "Automotive Engineering",
              "percentile": 94,
              "rank": 6,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 92,
              "rank": 51,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85089595735",
      "title": "E-CGR: Energy-Aware Contact Graph Routing over Nanosatellite Networks",
      "doi": "10.1109/TGCN.2020.2978296",
      "venue": "IEEE Transactions on Green Communications and Networking",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "4",
      "issue_id": "3",
      "pages": "890-902",
      "issn": null,
      "eIssn": "24732400",
      "source_id": "21100906361",
      "authors": "Marchese Mario; Patrone Fabio",
      "author_ids": "7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Marchese M.",
      "keywords": "DTN | nanosatellite communications | remote areas connection | satellite networks",
      "abstract": "Satellite constellations are envisioned as meaningful transport networks to forward data throughout the world, both as a solution for areas where there are no other telecommunication infrastructures or as a backup solution to support the terrestrial network. Low Earth Orbit (LEO) satellites are the most appealing for this purpose due to the achievable performance keeping low design and deployment costs. Mega-constellation made of thousands of small LEO satellites are planned to be employed to cover the entire Earth's surface. However, smaller is the size and weight of satellites, higher are the technological challenges and stricter are the hardware constraints which affect the data forwarding process and have to be taken into account. Energy is one of them. Telecommunication hardware energy consumption is considerable, especially in case of high traffic volumes, while energy storage capacity and battery recharge rate are limited due to the small battery size and solar panel surface area, respectively. In this paper, we propose a novel energy-aware routing algorithm based on the Contact Graph Routing (CGR) called E-CGR. E-CGR exploits static and known a priori information about contacts to compute routing paths from sources to destinations which are then 'validated' and 'confirmed' from the energy viewpoint.",
      "citations": 39,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 96,
              "rank": 22,
              "quartile": "Q1"
            },
            {
              "subject": "Renewable Energy, Sustainability and the Environment",
              "percentile": 84,
              "rank": 48,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 88,
              "rank": 38,
              "quartile": "Q1"
            },
            {
              "subject": "Renewable Energy, Sustainability and the Environment",
              "percentile": 82,
              "rank": 35,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85092709233",
      "title": "Smart Gateway Diversity Strategies for Q/V Feeder Links in SDN-Satellite Networks",
      "doi": "10.1109/MedComNet49392.2020.9191584",
      "venue": "2020 Mediterranean Communication and Computer Networking Conference Medcomnet 2020",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "21101023310",
      "authors": "Davoli Franco; Marchese Mario; Patrone Fabio; Cola Tomaso De; Mongelli Maurizio",
      "author_ids": "57220364548;7004398165;56536292600;10739364500;7005882346",
      "authorAffiliationIds": "60025153;60025153;60025153;60007798;60021199",
      "corresponding": "Davoli F.",
      "keywords": null,
      "abstract": "With the continuous improvements in communication technologies, users are demanding services with even higher and higher performance. High Key Performance Indicators (KPIs) have been set for this purpose in defining the next upcoming generation of mobile communications (5G). New emerging use cases and applications are enriching the already vast plethora of services that users can exploit through the Internet. However, traditional terrestrial networks have some intrinsic limitations that cannot be overcome with technology enhancements. For example, the terrestrial infrastructure will never be able to reach certain areas due to physical constraints, such as oceans, or the lack of a proper economic advantage, such as under-populated rural and remote areas.Satellite networks are foreseen to help the terrestrial infrastructure in several ways, especially in boosting enhanced Mobile Broadband (eMBB) services in converged 5G-satellite systems. New frequency bands have to be considered in order to guarantee the high required data rates. However, additional aspects should also be considered in order to deal with some impairments, such as the severe weather impairments that satellites need to tackle at high frequencies (Q/V bands).This paper proposes a novel smart gateway diversity strategy and validates its design through simulation campaigns, whose preliminary results show important performance gains with respect to other solutions available from the existing state-of- the-art.",
      "citations": 4,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85089430667",
      "title": "QoS-Aware Handover Strategies for Q/V Feeder Links in VHTS Systems",
      "doi": "10.1109/ICC40277.2020.9148805",
      "venue": "IEEE International Conference on Communications",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": "2020-June",
      "issue_id": null,
      "pages": null,
      "issn": "15503607",
      "eIssn": null,
      "source_id": "33201",
      "authors": "Marchese Mario; Moheddine Aya; Patrone Fabio; Cola Tomaso De; Mongelli Maurizio",
      "author_ids": "7004398165;57210886858;56536292600;10739364500;7005882346",
      "authorAffiliationIds": "60025153;60025153;60025153;60007798;60021199",
      "corresponding": "Marchese M.",
      "keywords": null,
      "abstract": "Offering very large data rates is one of the main objectives of Very High Throughput Satellite (VHTS) systems to boost enhanced Mobile Broadband (eMBB) services in converged 5G-satellite systems. To this end, the exploitation of Q/V frequency bands for the satellite feeder link is a key factor for guaranteeing unprecedented data rates provided that efficient handover algorithms are implemented to counteract link outage events caused by severe weather impairments. Moreover, Quality of Service (QoS) of data flows is typically affected when gateway handover is initiated, hence calling for sophisticated ground segment management solutions. In this light, this paper proposes a novel gateway handover strategy and validates its design through simulation campaigns, whose preliminary results show important performance gains with respect to other solutions available from the existing literature.",
      "citations": 7,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85084924836",
      "title": "Collective Awareness for Abnormality Detection in Connected Autonomous Vehicles",
      "doi": "10.1109/JIOT.2020.2974680",
      "venue": "IEEE Internet of Things Journal",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "7",
      "issue_id": "5",
      "pages": "3774-3789",
      "issn": null,
      "eIssn": "23274662",
      "source_id": "21100338350",
      "authors": "Kanapram Divya Thekke; Patrone Fabio; Marin-Plaza Pablo; Marchese Mario; Bodanese Eliane L.; Marcenaro Lucio; Gomez David Martin; Regazzoni Carlo",
      "author_ids": "57195512131;56536292600;57190806708;7004398165;6602283934;6603377664;57204878586;35513672400",
      "authorAffiliationIds": "60025153-60022109;60025153;60001741;60025153;60022109;60025153;60001741;60025153",
      "corresponding": "Kanapram D.T.",
      "keywords": "Abnormality detection | collective awareness (CA) | connected vehicles | dynamic Bayesian network (DBN) | Markov jump particle filter (MJPF) | self-awareness (SA)",
      "abstract": "The advancements in connected and autonomous vehicles in these times demand the availability of tools providing the agents with the capability to be aware and predict their own states and context dynamics. This article presents a novel approach to develop an initial level of collective awareness (CA) in a network of intelligent agents. A specific collective self-awareness functionality is considered, namely, agent-centered detection of abnormal situations present in the environment around any agent in the network. Moreover, the agent should be capable of analyzing how such abnormalities can influence the future actions of each agent. Data-driven dynamic Bayesian network (DBN) models learned from time series of sensory data recorded during the realization of tasks (agent network experiences) are here used for abnormality detection and prediction. A set of DBNs, each related to an agent, is used to allow the agents in the network to reach synchronously aware possible abnormalities occurring when available models are used on a new instance of the task for which DBNs have been learned. A growing neural gas (GNG) algorithm is used to learn the node variables and conditional probabilities linking nodes in the DBN models; a Markov jump particle filter (MJPF) is employed for state estimation and abnormality detection in each agent using learned DBNs as filter parameters. Performance metrics are discussed to asses the algorithm's reliability and accuracy. The impact is also evaluated by the communication channel used by the network to share the data sensed in a distributed way by each agent of the network. The IEEE 802.11p protocol standard has been considered for communication among agents. Performances of the DBN-based abnormality detection models under different channel and source conditions are discussed. The effects of distances among agents and of the delays and packet losses are analyzed in different scenario categories (urban, suburban, and rural). Real data sets are also used acquired by autonomous vehicles performing different tasks in a controlled environment.",
      "citations": 18,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 96,
              "rank": 20,
              "quartile": "Q1"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 96,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Signal Processing",
              "percentile": 94,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 93,
              "rank": 62,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 93,
              "rank": 32,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Hardware and Architecture",
              "percentile": 99,
              "rank": 2,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 98,
              "rank": 7,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 97,
              "rank": 8,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 97,
              "rank": 17,
              "quartile": "Q1"
            },
            {
              "subject": "Signal Processing",
              "percentile": 93,
              "rank": 7,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85092559710",
      "title": "UAV and Satellite Employment for the Internet of Things Use Case",
      "doi": "10.1109/AERO47225.2020.9172701",
      "venue": "IEEE Aerospace Conference Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2020,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "1095323X",
      "eIssn": null,
      "source_id": "75113",
      "authors": "Marchese Mario; Moheddine Ava; Patrone Fabio",
      "author_ids": "7004398165;57210886858;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Marchese M.",
      "keywords": null,
      "abstract": "Since the previous decades, the Internet of Things (IoT) is capturing a major interest and making critical changes in our life. It has been established in different sectors all over the world such as health-care, agricultural, logistics, etc. Long range transmissions and low energy consumption are two main features that IoT communication protocols should accomplish from a communication viewpoint. This led to the definition and deployment of a plethora of commercial or standardized solutions within the Low Power Wide Area (LPWA) category. From an architectural viewpoint, solutions to extend current network coverage are needed to allow IoT employment in all possible use cases. Unmanned Aerial Vehicles (UAVs) have witnessed exceptional growth and high demand in the IoT area. Besides, extending the number of supported devices and link capacity in urban areas and extending the coverage in rural and remote areas through satellite communication networks is envisioned as an improvement of the overall network infrastructure within the fifth generation of mobile communication (5G) framework. This paper presents a study of deploying an IoT communication protocol (LoRaWAN) gateway onboard a UAV communicating with the terrestrial network through a simulated satellite link. The aim of the study is to propose and test UAVs together with satellites as possible means to, on one hand, extend the coverage of LoRa network, and, on the other hand, offer a common solution to allow data exchange with multiple devices implementing different IoT communication protocols.",
      "citations": 11,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 45,
              "rank": 88,
              "quartile": "Q3"
            },
            {
              "subject": "Space and Planetary Science",
              "percentile": 35,
              "rank": 67,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 39,
              "rank": 78,
              "quartile": "Q3"
            },
            {
              "subject": "Space and Planetary Science",
              "percentile": 28,
              "rank": 70,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85078249094",
      "title": "Nanosatellite-5G integration in the millimeter wave domain: A full top-down approach",
      "doi": "10.1109/TMC.2019.2897091",
      "venue": "IEEE Transactions on Mobile Computing",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2020,
      "volume": "19",
      "issue_id": "2",
      "pages": "390-404",
      "issn": "15361233",
      "eIssn": "15580660",
      "source_id": "25038",
      "authors": "Babich Fulvio; Comisso Massimiliano; Cuttin Alessandro; Marchese Mario; Patrone Fabio",
      "author_ids": "7003613315;13908144400;57193646327;7004398165;56536292600",
      "authorAffiliationIds": "60018363;60018363;60018363;60025153;60025153",
      "corresponding": "Babich F.",
      "keywords": "capture probability | contact graph routing | delay/disruption tolerant network | millimeter-wave | Nanosatellite-5G integration | uncoordinated access",
      "abstract": "This paper presents a novel network architecture for an integrated nanosatellite (nSAT)-5G system operating in the millimeter-wave (mmWave) domain. The architecture is realized adopting a delay/disruption tolerant networking (DTN) approach allowing end users to adopt standard devices. A buffer aware contact graph routing algorithm is designed to account for the buffer occupancy of the nSATs and for the connection planning derived from their visibility periods. At the terrestrial uplink, a coded random access is employed to realize a high-capacity interface for the typically irregular traffic of 5G users, while, at the space uplink, the DTN architecture is combined with the contention resolution diversity slotted Aloha protocol to match the recent update of the DVB-RCS2 standard. To achieve a reliable testing of the introduced functionalities, an accurate analysis of the statistic of the signal to interference-plus-noise ratio and of the capture probability at each mmWave link is developed by including interference, shadowing, fading, and noise. The application of the designed architecture to data transfer services in conjunction with possible delay reduction strategies, and an extension to inter-satellite communication, are finally presented by estimating the resulting loss/delay performance through a discrete-time discrete-event platform based on the integration of Matlab with Network Simulator 3.",
      "citations": 43,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 94,
              "rank": 60,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 93,
              "rank": 36,
              "quartile": "Q1"
            },
            {
              "subject": "Software",
              "percentile": 92,
              "rank": 40,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2020,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 95,
              "rank": 15,
              "quartile": "Q1"
            },
            {
              "subject": "Software",
              "percentile": 94,
              "rank": 21,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 94,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85084377455",
      "title": "Towards Increasing the LoRa Network Coverage: A Flying Gateway",
      "doi": "10.1109/ISAECT47714.2019.9069697",
      "venue": "2019 International Symposium on Advanced Electrical and Communication Technologies Isaect 2019",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2019,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": null,
      "eIssn": null,
      "source_id": "21100985351",
      "authors": "Marchese Mario; Moheddine Aya; Patrone Fabio",
      "author_ids": "7004398165;57210886858;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Marchese M.",
      "keywords": "IoT | LoRa | LoRaWAN | satellite | UAV",
      "abstract": "The Internet of Things (IoT) technology has been emerging since the last two decades. It is difficult to ignore its presence as it is almost related to every aspects of our daily life, starting from smart phones to wearable medical devices and smart vehicles. A plethora of communication solutions have been developed to meet the two main features of IoT: low power consumption and long range transmissions. Unmanned Aerial Vehicles (UAVs) also are witnessing an increasing interest in a lot of different scenarios and with different roles, including the integration with IoT. Extending the coverage of IoT to rural and remote areas by using UAVs and satellite communications is envisioned as an improvement of the IoT technology towards the upcoming 5G network. This paper presents an approach integrating the aforementioned technologies to develop a flying LoRa gateway, whose aim is to extend the coverage of LoRa networks on-demand in the required locations and for the required time.",
      "citations": 7,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85079158083",
      "title": "UAV and IoT integration: A flying gateway",
      "doi": "10.1109/ICECS46596.2019.8965135",
      "venue": "2019 26th IEEE International Conference on Electronics Circuits and Systems Icecs 2019",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2019,
      "volume": null,
      "issue_id": null,
      "pages": "121-122",
      "issn": null,
      "eIssn": null,
      "source_id": "21100944554",
      "authors": "Moheddine Aya; Patrone Fabio; Marchese Mario",
      "author_ids": "57210886858;56536292600;7004398165",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Moheddine A.",
      "keywords": "Arduino | Gateway | IoT | Rak2245 | UAV",
      "abstract": "This paper introduces a new approach for Internet of Things. This approach is based on the integration of IoT and Unmanned Aerial Vehicles (UAVs) to establish a flying gateway that allows the extension of coverage of terrestrial IoT gateways. The approach is based on using several hardware devices as Arduino, Raspberry Pi boards and RAK 2445 board offering LoRa connectivity. This LoRa-based gateway is deployed on board of a drone flying over IoT nodes to gather and transmit data to a LoRa server. This system will extend the coverage of the terrestrial LoRa gateways allowing to reach remote and rural areas.",
      "citations": 30,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85076813904",
      "title": "Networking challenges for non-terrestrial networks exploitation in 5G",
      "doi": "10.1109/5GWF.2019.8911669",
      "venue": "IEEE 5g World Forum 5gwf 2019 Conference Proceedings",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2019,
      "volume": null,
      "issue_id": null,
      "pages": "623-628",
      "issn": null,
      "eIssn": null,
      "source_id": "21100962470",
      "authors": "Bacco Manlio; Davoli Franco; Giambene Giovanni; Gotta Alberto; Luglio Michele; Marchese Mario; Patrone Fabio; Roseti Cesare",
      "author_ids": "57189197221;57220364548;7003750533;9846429300;7003570928;7004398165;56536292600;15127967700",
      "authorAffiliationIds": "60085207;60025153;60002838;60085207;60027509;60025153;60025153;60027509",
      "corresponding": "Bacco M.",
      "keywords": "Multi-path | Satellite-based hybrid backhaul | Smart gateway diversity | UAV/satellite 5G integration",
      "abstract": "The standardization process of the fifth generation of mobile communications (5G) is still ongoing and it will end in 2020 as scheduled. A lot of changes have been made from the previous generations involving different technologies, concepts, and paradigms, which will deeply affect the telecommunication infrastructure and its management. Besides, a higher number of use cases and application scenarios are envisioned in the near future. This will contribute to generate higher and higher traffic volumes from a higher number of connected devices/users with different performance requirements. Additional network resources are required to fulfill users' requirements in order to guarantee the expected Quality of Experience (QoE). The integration of Non-Terrestrial Networks (NTNs) within the 5G framework is under standardization and can lead to manifold advantages, such as coverage extension and additional communication link among many others. However, NTN integration is also leading to challenges related to the employment and adaptation to aerospace networks of technologies originally designed for terrestrial networks. This paper provides an overview of the role of NTNs in the 5G ecosystem, of the application scenarios that can benefit from the integration among terrestrial and non-terrestrial networks, and of some identified challenges from the networking viewpoint, which still require further analysis towards possible solutions.",
      "citations": 39,
      "quartile": null
    },
    {
      "scopus_id": "2-s2.0-85071745275",
      "title": "IoT and UAV integration in 5G hybrid terrestrial-satellite networks",
      "doi": "10.3390/s19173704",
      "venue": "Sensors Switzerland",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "19",
      "issue_id": "17",
      "pages": null,
      "issn": "14248220",
      "eIssn": null,
      "source_id": "130124",
      "authors": "Marchese Mario; Moheddine Aya; Patrone Fabio",
      "author_ids": "7004398165;57210886858;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Marchese M.",
      "keywords": "5G | IoT | Satellite communications | UAV",
      "abstract": "The Fifth Generation of Mobile Communications (5G) will lead to the growth of use cases demanding higher capacity and a enhanced data rate, a lower latency, and a more flexible and scalable network able to offer better user Quality of Experience (QoE). The Internet of Things (IoT) is one of these use cases. It has been spreading in the recent past few years, and it covers a wider range of possible application scenarios, such as smart city, smart factory, and smart agriculture, among many others. However, the limitations of the terrestrial network hinder the deployment of IoT devices and services. Besides, the existence of a plethora of different solutions (short vs. long range, commercialized vs. standardized, etc.), each of them based on different communication protocols and, in some cases, on different access infrastructures, makes the integration among them and with the upcoming 5G infrastructure more difficult. This paper discusses the huge set of IoT solutions available or still under standardization that will need to be integrated in the 5G framework. UAVs and satellites will be proposed as possible solutions to ease this integration, overcoming the limitations of the terrestrial infrastructure, such as the limited covered areas and the densification of the number of IoT devices per square kilometer.",
      "citations": 117,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Instrumentation",
              "percentile": 90,
              "rank": 19,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 86,
              "rank": 136,
              "quartile": "Q1"
            },
            {
              "subject": "Atomic and Molecular Physics, and Optics",
              "percentile": 85,
              "rank": 36,
              "quartile": "Q1"
            },
            {
              "subject": "Biochemistry",
              "percentile": 84,
              "rank": 72,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 82,
              "rank": 87,
              "quartile": "Q1"
            },
            {
              "subject": "Analytical Chemistry",
              "percentile": 82,
              "rank": 30,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Instrumentation",
              "percentile": 87,
              "rank": 17,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 78,
              "rank": 147,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 76,
              "rank": 70,
              "quartile": "Q1"
            },
            {
              "subject": "Atomic and Molecular Physics, and Optics",
              "percentile": 75,
              "rank": 46,
              "quartile": "Q1"
            },
            {
              "subject": "Analytical Chemistry",
              "percentile": 71,
              "rank": 35,
              "quartile": "Q2"
            },
            {
              "subject": "Biochemistry",
              "percentile": 61,
              "rank": 156,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85052965154",
      "title": "Small satellites and CubeSats: Survey of structures, architectures, and protocols",
      "doi": "10.1002/sat.1277",
      "venue": "International Journal of Satellite Communications and Networking",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "37",
      "issue_id": "4",
      "pages": "343-359",
      "issn": "15420973",
      "eIssn": "15420981",
      "source_id": "19924",
      "authors": "Davoli Franco; Kourogiorgas Charilaos; Marchese Mario; Panagopoulos Athanasios; Patrone Fabio",
      "author_ids": "57220364548;41761942100;7004398165;7004006343;56536292600",
      "authorAffiliationIds": "60025153-60103966;60002947;60025153;60002947;60025153",
      "corresponding": "Davoli F.",
      "keywords": "CubeSat | CubeSat architecture | CubeSat channel model | CubeSat communication protocols | CubeSat hardware components | CubeSat network",
      "abstract": "The space environment is still challenging but is becoming more and more attractive for an increasing number of entities. In the second half of the 20th century, a huge amount of funds was required to build satellites and gain access to space. Nowadays, it is no longer so. The advancement of technologies allows producing very small hardware components able to survive the strict conditions of the outer space. Consequently, small satellites can be designed for a wide set of missions keeping low design times, production costs, and deployment costs. One widely used type of small satellite is the CubeSat, whose different aspects are surveyed in the following: mission goals, hardware subsystems and components, possible network topologies, channel models, and suitable communication protocols. We also show some future challenges related to the employment of CubeSat networks.",
      "citations": 84,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Media Technology",
              "percentile": 72,
              "rank": 21,
              "quartile": "Q2"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 62,
              "rank": 374,
              "quartile": "Q2"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Media Technology",
              "percentile": 85,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 70,
              "rank": 201,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85065041414",
      "title": "IoT applications and services in space information networks",
      "doi": "10.1109/MWC.2019.1800297",
      "venue": "IEEE Wireless Communications",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2019,
      "volume": "26",
      "issue_id": "2",
      "pages": "31-37",
      "issn": "15361284",
      "eIssn": "15580687",
      "source_id": "18935",
      "authors": "Bacco Manlio; Boero Luca; Cassara Pietro; Colucci Marco; Gotta Alberto; Marchese Mario; Patrone Fabio",
      "author_ids": "57189197221;57053089400;24767643400;57195469786;9846429300;7004398165;56536292600",
      "authorAffiliationIds": "108104493;108104493;108104493;108104493;108104493;60025153;60025153",
      "corresponding": "Bacco M.",
      "keywords": null,
      "abstract": "The rate of traffic generated by MTC is growing at a very fast pace, putting strong pressure on existing network infrastructures. One of the most challenging tasks today is being able to support M2M/IoT data exchanges by providing connectivity between any pair of M2M devices all over the world. For this reason, we analyze the role of SINs in supporting MTC in this work. Horizontal solutions are analyzed herein in order to allow interworking by acting as relay entities among different protocol stacks and services, vertically implemented over different network segments. We analyze the still pending challenges hampering interworking, and propose a possible protocol stack for M2M/IoT communications based on the oneM2M standard. Eventually, this article compares the performance achievable by using two of the most diffused application protocols, CoAP and MQTT, shedding light on their efficiency and differences.",
      "citations": 94,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 97,
              "rank": 24,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 97,
              "rank": 29,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2019,
          "subjects": [
            {
              "subject": "Computer Science Applications",
              "percentile": 99,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 98,
              "rank": 8,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85107048873",
      "title": "Flow Assignment in Multi-Core Network Processors",
      "doi": "10.1007/978-3-030-34960-8_43",
      "venue": "Airo Springer Series",
      "type": "Book Series",
      "sub_type": "Book Chapter",
      "year": 2019,
      "volume": "3",
      "issue_id": null,
      "pages": "493-503",
      "issn": "25237047",
      "eIssn": "25237055",
      "source_id": "21101047139",
      "authors": "Davoli Franco; Marchese Mario; Patrone Fabio",
      "author_ids": "57220364548;7004398165;56536292600",
      "authorAffiliationIds": "60025153-60103966;60025153-60103966;60025153-60103966",
      "corresponding": "Davoli F.",
      "keywords": "Load balancing | Network flow optimization | Virtual network functions",
      "abstract": "In modern telecommunication networks, the trend toward “softwarization” is shifting the execution of switching and protocol functionalities from specialized devices to general purpose hardware located in datacenters or at the network edge. Incoming flows generated by User Equipment are processed by different functional modules executed in Virtual Machines (VMs) or containers. The paper considers a modeling and control architecture in this environment, for the assignment of flows to the first functional blocks in a chain of Virtual Network Functions (VNFs) and the balancing of the load among the VMs where they are executed.",
      "citations": 2,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Control and Optimization",
              "percentile": 31,
              "rank": 121,
              "quartile": "Q3"
            },
            {
              "subject": "Computational Mathematics",
              "percentile": 18,
              "rank": 169,
              "quartile": "Q4"
            },
            {
              "subject": "Computer Science Applications",
              "percentile": 16,
              "rank": 820,
              "quartile": "Q4"
            },
            {
              "subject": "Management Science and Operations Research",
              "percentile": 12,
              "rank": 194,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85054382434",
      "title": "Satellite Networking Integration in the 5G Ecosystem: Research Trends and Open Challenges",
      "doi": "10.1109/MNET.2018.1800052",
      "venue": "IEEE Network",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2018,
      "volume": "32",
      "issue_id": "5",
      "pages": "9-15",
      "issn": "08908044",
      "eIssn": "1558156X",
      "source_id": "27239",
      "authors": "Boero Luca; Bruschi Roberto; Davoli Franco; Marchese Mario; Patrone Fabio",
      "author_ids": "57053089400;8555973600;57220364548;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153;60025153;60025153",
      "corresponding": "Boero L.",
      "keywords": null,
      "abstract": "The envisioned 5G ecosystem will be composed of heterogeneous networks based on different technologies and communication means, including satellite communication networks. The latter can help increase the capabilities of terrestrial networks, especially in terms of higher coverage, reliability, and availability, contributing to the achievement of some of the 5G KPIs. However, technological changes are not immediate. Many current satellite communication networks are based on proprietary hardware, which hinders the integration with future 5G terrestrial networks as well as the adoption of new protocols and algorithms. On the other hand, the two main paradigms that are emerging in the networking scenario - software defined networking (SDN) and network functions virtualization - can change this perspective. In this respect, this article presents first an overview of the main research works in the field of SDN satellite networks in order to understand the already proposed solutions. Then some open challenges are described in light of the network slicing concept by 5G virtualization, along with a possible roadmap including different network virtualization levels. The remaining unsolved problems are related to the development and deployment of a complete integration of satellite components in the 5G ecosystem.",
      "citations": 130,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Hardware and Architecture",
              "percentile": 95,
              "rank": 11,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 94,
              "rank": 31,
              "quartile": "Q1"
            },
            {
              "subject": "Software",
              "percentile": 92,
              "rank": 37,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 91,
              "rank": 42,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Hardware and Architecture",
              "percentile": 99,
              "rank": 2,
              "quartile": "Q1"
            },
            {
              "subject": "Information Systems",
              "percentile": 98,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 98,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Software",
              "percentile": 97,
              "rank": 10,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85051869483",
      "title": "The impact of delay in software-defined integrated terrestrial-satellite networks",
      "doi": "10.1109/CC.2018.8438270",
      "venue": "China Communications",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2018,
      "volume": "15",
      "issue_id": "8",
      "pages": "11-21",
      "issn": "16735447",
      "eIssn": null,
      "source_id": "19700177325",
      "authors": "Boero Luca; Marchese Mario; Patrone Fabio",
      "author_ids": "57053089400;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Boero L.",
      "keywords": "delay estimation | Integrated terrestrial-satellite networks | software defined networking | software defined satellite networks",
      "abstract": "Satellite communication networks have been evolving from standalone networks with ad-hoc infrastructures to possibly interconnected portions of a wider Future Internet architecture. Experts belonging to the fifth-generation (5G) standardization committees are considering satellites as a technology to integrate in the 5G environment. Software Defined Networking (SDN) is one of the paradigms of the next generation of mobile and fixed communications. It can be employed to perform different control functionalities, such as routing, because it allows traffic flow identification based on different parameters and traffic flow management in a centralized way. A centralized set of controllers makes the decisions and sends the corresponding forwarding rules for each traffic flow to the involved intermediate nodes that practically forward data up to the destination. The time to perform this process in integrated terrestrial-satellite networks could be not negligible due to satellite link delays. The aim of this paper is to introduce an SDN-based terrestrial satellite network architecture and to estimate the mean time to deliver the data of a new traffic flow from the source to the destination including the time required to transfer SDN control actions. The practical effect is to identify the maximum performance than can be expected.",
      "citations": 29,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 78,
              "rank": 217,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 76,
              "rank": 127,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 70,
              "rank": 88,
              "quartile": "Q2"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 69,
              "rank": 203,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85063532504",
      "title": "Energy-aware Routing Algorithm for DTN-Nanosatellite Networks",
      "doi": "10.1109/GLOCOM.2018.8647491",
      "venue": "Proceedings IEEE Global Communications Conference Globecom",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "23340983",
      "eIssn": "25766813",
      "source_id": "21101199922",
      "authors": "Marchese Mario; Patrone Fabio",
      "author_ids": "7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Marchese M.",
      "keywords": null,
      "abstract": "Satellite constellations are envisioned as meaningful transport networks to forward data throughout the world. Low Earth Orbit (LEO) satellites are the most appealing for this purpose due to their low altitude which allows guaranteeing certain performance, especially in terms of delivery time. Mega-constellation of small LEO satellites (micro- and nano-satellites) are planned to be employed to cover the entire Earth's surface. However, these satellites have several constraints which affect the data forwarding process and have to be taken into account. Energy is one of these constrained resources. Energy storage and recharge are limited by the reduced battery capacity and solar panel surface area, while telecommunication hardware energy consumption is considerable especially in case of high traffic volumes. In this paper, we propose a novel energy-aware routing algorithm based on the Contact Graph Routing (CGR) called E-CGR. E-CGR exploits static and known a priori information about contacts (begin times, end times, and overall contact volumes) to compute complete routing paths from source to destination which are then validated and confirmed from the energy viewpoint.",
      "citations": 8,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Signal Processing",
              "percentile": 54,
              "rank": 90,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 52,
              "rank": 260,
              "quartile": "Q2"
            },
            {
              "subject": "Artificial Intelligence",
              "percentile": 47,
              "rank": 262,
              "quartile": "Q3"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 45,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85043976241",
      "title": "A Survey on Network Architectures and Applications for Nanosat and UAV Swarms",
      "doi": "10.1007/978-3-319-76571-6_8",
      "venue": "Lecture Notes of the Institute for Computer Sciences Social Informatics and Telecommunications Engineering Lnicst",
      "type": "Book Series",
      "sub_type": "Conference Paper",
      "year": 2018,
      "volume": "231",
      "issue_id": null,
      "pages": "75-85",
      "issn": "18678211",
      "eIssn": null,
      "source_id": "21100220348",
      "authors": "Bacco Manlio; Cassarà Pietro; Colucci Marco; Gotta Alberto; Marchese Mario; Patrone Fabio",
      "author_ids": "57189197221;24767643400;57195469786;9846429300;7004398165;56536292600",
      "authorAffiliationIds": "60021199;60021199;60021199;60021199;60025153;60025153",
      "corresponding": "Bacco M.",
      "keywords": "FANET | Nanosatellite | Network architecture and application | UAV",
      "abstract": "Nanosatellites and unmanned aerial vehicles are attracting more and more the interest of both industrial and research fields. They are low-cost and easy deployable items, therefore their use is expected to quickly grow in the next few years. This work proposes a survey on the network architectures and the applications for nanosatellite swarms and constellations, as well as for flying ad hoc networks, by characterizing distinctive features and issues yet to be resolved in order to take advantage from both technologies in a joint fashion.",
      "citations": 23,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 19,
              "rank": 439,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 18,
              "rank": 241,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85028453407",
      "title": "DTN-based nanosatellite architecture and hot spot selection algorithm for remote areas connection",
      "doi": "10.1109/TVT.2017.2739298",
      "venue": "IEEE Transactions on Vehicular Technology",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2018,
      "volume": "67",
      "issue_id": "1",
      "pages": "689-702",
      "issn": "00189545",
      "eIssn": null,
      "source_id": "17393",
      "authors": "Marchese Mario; Patrone Fabio; Cello Marco",
      "author_ids": "7004398165;56536292600;36025044100",
      "authorAffiliationIds": "60025153;60025153;60021378",
      "corresponding": "Marchese M.",
      "keywords": "Dtn | Nanosatellite communications | Remote areas connection | Satellite networks | TCP/IP",
      "abstract": "To extend the network coverage to rural and remote areas, there are different solutionswith their advantages and disadvantages. We propose to use a nanosatellite network and to exploit the ability to cope with large delays and disruptions provided by the delay-And disruption-Tolerant networking (DTN) paradigm. The connection from remote areas is managed through ground stations called cold spots that collect data from rural nodes and address them to the nanosatellites. Nanosatellites carry and download data to hot spots that address them to the Internet destinations. On the reverse direction, Internet data are addressed to hot spots, uploaded on nanosatellites and delivered to the rural destinations through cold spots. The problem of choosing the \"optimal\" hot spot to address data from the Internet source is important because a wrong choice could lead to large delivery delays. In this paper, we propose \"gRANteD\": A Nanosatellite-DTN Network for rural and remote areas. gRANteD includes \"HotSel,\" a hot spot selection algorithm to minimize the delivery time of all data destined to rural users. The performance evaluation is carried out through a DTN module which implements gRANteD and HotSel, within the framework of Network Simulator 3.",
      "citations": 30,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 97,
              "rank": 5,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 93,
              "rank": 63,
              "quartile": "Q1"
            },
            {
              "subject": "Automotive Engineering",
              "percentile": 93,
              "rank": 9,
              "quartile": "Q1"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 93,
              "rank": 38,
              "quartile": "Q1"
            }
          ]
        },
        {
          "year": 2018,
          "subjects": [
            {
              "subject": "Aerospace Engineering",
              "percentile": 97,
              "rank": 3,
              "quartile": "Q1"
            },
            {
              "subject": null,
              "percentile": 97,
              "rank": 12,
              "quartile": "Q1"
            },
            {
              "subject": "Automotive Engineering",
              "percentile": 96,
              "rank": 4,
              "quartile": "Q1"
            },
            {
              "subject": "Electrical and Electronic Engineering",
              "percentile": 91,
              "rank": 56,
              "quartile": "Q1"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85028807758",
      "title": "A theoretical analysis of buffer occupancy for Intermittently-Connected Networks",
      "doi": "10.1016/j.peva.2017.08.001",
      "venue": "Performance Evaluation",
      "type": "Journal",
      "sub_type": "Article",
      "year": 2017,
      "volume": "115",
      "issue_id": null,
      "pages": "108-131",
      "issn": "01665316",
      "eIssn": null,
      "source_id": "22313",
      "authors": "Boero L.; Cello M.; Gnecco G.; Marchese M.; Patrone F.; Sanguineti M.",
      "author_ids": "57053089400;36025044100;22953696000;7004398165;56536292600;7003404992",
      "authorAffiliationIds": "60025153;60021378;60102060;60025153;60025153;60025153",
      "corresponding": "Boero L.",
      "keywords": "Ad-hoc networks | Congestion control | Epidemic routing | Intermittently-Connected Networks | Markov chains",
      "abstract": "Network congestion is a well-known problem that may heavily affect the overall network performance. Congestion control approaches in Intermittently-Connected Networks (ICNs) differ from those used in classical networks, since the assumptions of “universal connectivity” of the nodes and “global information” about the network do not hold. In this paper, an analytical framework is proposed to investigate node buffer occupancy in ICNs through bulk-arrivals/bulk-services queuing models. A relation in the z-domain between the discrete probability densities of the buffer state occupancies and of the sizes of the arriving bulks is exploited to analyze two classes of forwarding strategies for ICNs. The infinite- and finite-buffer cases are investigated, simulated, and compared in terms of the concept of stochastic order, which is also used to compare models obtained for different parameter choices. The results can be exploited for buffer dimensioning and for deriving estimates of performance metrics such as average buffer occupancy, average delivery delay, and buffer overflow probability. The theoretical analysis is complemented by numerical outcomes from a network simulator and from real mobility traces.",
      "citations": 10,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Modeling and Simulation",
              "percentile": 48,
              "rank": 196,
              "quartile": "Q3"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 46,
              "rank": 293,
              "quartile": "Q3"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 39,
              "rank": 143,
              "quartile": "Q3"
            },
            {
              "subject": "Software",
              "percentile": 37,
              "rank": 311,
              "quartile": "Q3"
            }
          ]
        },
        {
          "year": 2017,
          "subjects": [
            {
              "subject": "Modeling and Simulation",
              "percentile": 71,
              "rank": 74,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 66,
              "rank": 95,
              "quartile": "Q2"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 60,
              "rank": 61,
              "quartile": "Q2"
            },
            {
              "subject": "Software",
              "percentile": 55,
              "rank": 166,
              "quartile": "Q2"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85046404054",
      "title": "A Source Routing Algorithm Based on CGR for DTN-Nanosatellite Networks",
      "doi": "10.1109/GLOCOM.2017.8255092",
      "venue": "Proceedings IEEE Global Communications Conference Globecom",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2017,
      "volume": "2018-January",
      "issue_id": null,
      "pages": "1-6",
      "issn": "23340983",
      "eIssn": "25766813",
      "source_id": "21101199922",
      "authors": "Marchese Mario; Patrone Fabio",
      "author_ids": "7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153",
      "corresponding": "Marchese M.",
      "keywords": null,
      "abstract": "The number of nanosatellites orbiting around the Earth is increasing year after year. Nanosatellite constellations can be deployed to cover even larger areas. However, data exchange among nanosatellites is not trivial, especially due to the required hardware components related to the limited size and weight. Moreover, in some cases, contacts between nanosatellites and ground stations cannot always be guaranteed. The Delay and Disruption Tolerant Networking (DTN) paradigm allows storing data in nanosatellite and ground station buffers until the contact with the next hop is available. Routing in this kind of network is a crucial aspect. Delivery times are larger compared to a \"classical\" network due to the time that data have to wait inside intermediate node buffers and to the limitation of available resources, especially on- board nanosatellites. The adoption of a smart routing strategy can contribute relieving this gap. In this paper, we propose S-CGR, a Source routing algorithm based on the Contact Graph Routing (CGR). It computes a routing path from source to destination nodes for each bundle, which is the data unit in DTN networks. S-CGR considers static and known a priori information about contacts (begin times, end times, and overall contact volumes) and dynamic information about nanosatellite buffer occupancies and available contact volumes. The complete source/destination paths are stored in the bundles. Intermediate nodes read the routing instructions from the bundles without any computational effort.",
      "citations": 13,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Signal Processing",
              "percentile": 54,
              "rank": 90,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 52,
              "rank": 260,
              "quartile": "Q2"
            },
            {
              "subject": "Artificial Intelligence",
              "percentile": 47,
              "rank": 262,
              "quartile": "Q3"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 45,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-85015393984",
      "title": "ColdSel: A selection algorithm to mitigate congestion situations over nanosatellite networks",
      "doi": "10.1109/GLOCOM.2016.7841670",
      "venue": "Proceedings IEEE Global Communications Conference Globecom",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "23340983",
      "eIssn": "25766813",
      "source_id": "21101199922",
      "authors": "Cello Marco; Marchese Mario; Patrone Fabio",
      "author_ids": "36025044100;7004398165;56536292600",
      "authorAffiliationIds": "60021378-60025153;60025153;60025153",
      "corresponding": "Cello M.",
      "keywords": null,
      "abstract": "Nanosatellites offer a solution to provide Internet access in areas where there is no ICT infrastructure, such as rural and remote areas, keeping low construction and maintenance costs. A nanosatellite constellation is composed of a certain number of nanosatellites distributed in one or more orbital planes. In most cases, this network cannot ensure an end-to-end connection between sources and destinations, because not all satellite links are up at the same time. The Delay and Disruption Tolerant Networking (DTN) paradigm is so necessary to deal with predictable disruptions and large delays, allowing nanosatellites, Internet gateways (also called hot spots), and rural gateways (also called cold spots) to keep data stored in their buffers also for tens of minutes waiting to be forwarded. We focused our attention on a possible selection strategy which indicates to all nanosatellites how many bundles (PDUs of the DTN protocol) they can upload from rural gateways during each contact. The decision is made by considering the maximum amount of data that nanosatellites and cold spots can exchange during each contact (quantity related to contact durations) and the possible presence of congestion situations in rural and remote areas or in nanosatellites. The proposed strategy is called ColdSel: it calculates the amount of bundles that each cold spot has to upload on the nanosatellite in contact with in order to mitigate congestion situations in rural areas and nanosatellites and to reduce the nanosatellite buffer occupancies so improving the performance in terms of data delivery time.",
      "citations": 7,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Signal Processing",
              "percentile": 54,
              "rank": 90,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 52,
              "rank": 260,
              "quartile": "Q2"
            },
            {
              "subject": "Artificial Intelligence",
              "percentile": 47,
              "rank": 262,
              "quartile": "Q3"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 45,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84996559034",
      "title": "Research challenges in nanosatellite-DTN networks",
      "doi": "10.1007/978-3-319-47081-8_8",
      "venue": "Lecture Notes of the Institute for Computer Sciences Social Informatics and Telecommunications Engineering Lnicst",
      "type": "Book Series",
      "sub_type": "Conference Paper",
      "year": 2016,
      "volume": "148",
      "issue_id": null,
      "pages": "89-93",
      "issn": "18678211",
      "eIssn": null,
      "source_id": "21100220348",
      "authors": "Cello Marco; Marchese Mario; Patrone Fabio",
      "author_ids": "36025044100;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Cello M.",
      "keywords": "Congestion control | Delay tolerant network architecture | Nanosatellite network | Next-hop selection",
      "abstract": "Current approaches based on classical satellite communications, aimed at bringing Internet connectivity to remote and underdeveloped areas, are too expensive and impractical. Nanosatellites architectures with DTN protocol have been proposed as a cost-effective solution to extend the network access in rural and remote areas. In order to guarantee a good service and a large coverage in rural areas, it is necessary to deploy a good number of nanosatellites; consequentially, for reliability and load balancing purposes, is also needed a large number of ground stations (or hot spots) connected on the Internet. During a data connection, a server on the Internet that wants to reply to the user on rural area, has many hot spot alternatives to whom it can deliver data. Different hot spots can send data to final destination with different delivery delay depending on the number, position and buffer occupancy of satellites with which it comes into contact. The problem of choosing the optimal hot spot becomes important because a wrong choice could lead a high delivery delay.",
      "citations": 3,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 19,
              "rank": 439,
              "quartile": "Q4"
            }
          ]
        },
        {
          "year": 2016,
          "subjects": [
            {
              "subject": "Computer Networks and Communications",
              "percentile": 17,
              "rank": 204,
              "quartile": "Q4"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84964853741",
      "title": "HotSel: A hot spot selection algorithm for internet access in rural areas through nanosatellite networks",
      "doi": "10.1109/GLOCOM.2014.7417202",
      "venue": "Proceedings IEEE Global Communications Conference Globecom",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2015,
      "volume": null,
      "issue_id": null,
      "pages": null,
      "issn": "23340983",
      "eIssn": "25766813",
      "source_id": "21101199922",
      "authors": "Cello Marco; Marchese Mario; Patrone Fabio",
      "author_ids": "36025044100;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Cello M.",
      "keywords": null,
      "abstract": "Nowadays, to benefit from Internet access is so easy in some areas of the world as difficult in others. There are some different projects whose purpose is to extend Internet access to areas which do not have it yet. Each of these projects has unique characteristics that distinguish it from others (different transmission channels, different devices used, \\dots). One possible solution provides the use of a particular type of satellites called nanosatellites. Using these devices, we can have a solution to extend the network access in rural and remote areas which offers a good balance among performances, security and costs. In a network of this type ground stations (called hot spots) are deployed, which upload data destined to rural areas on nanosatellites and download data destined to Internet servers from nanosatellites. During a data connection, an Internet server that wants to reply to a request coming from a rural area has many hot spot alternatives to whom it can deliver data. The problem of choosing the ''optimal'' hot spot becomes important because a wrong choice could lead to a high delivery delay. We propose ''HotSel'': a hot spot selection algorithm able to minimize data delivery time. HotSel is simple and practical, and outperforms two other selection mechanisms used as comparison. All results have been collected by using Network Simulator 3 (NS3) and developing a module able to simulate a nanosatellite network.",
      "citations": 11,
      "quartile": [
        {
          "year": 2025,
          "subjects": [
            {
              "subject": "Signal Processing",
              "percentile": 54,
              "rank": 90,
              "quartile": "Q2"
            },
            {
              "subject": "Computer Networks and Communications",
              "percentile": 52,
              "rank": 260,
              "quartile": "Q2"
            },
            {
              "subject": "Artificial Intelligence",
              "percentile": 47,
              "rank": 262,
              "quartile": "Q3"
            },
            {
              "subject": "Hardware and Architecture",
              "percentile": 45,
              "rank": 129,
              "quartile": "Q3"
            }
          ]
        }
      ]
    },
    {
      "scopus_id": "2-s2.0-84924054728",
      "title": "Hot spot selection in rural access nanosatellite networks",
      "doi": "10.1145/2645672.2645687",
      "venue": "Chants 2014 Proceedings of the 9th ACM Mobicom Workshop on Challenged Networks",
      "type": "Conference Proceeding",
      "sub_type": "Conference Paper",
      "year": 2014,
      "volume": null,
      "issue_id": null,
      "pages": "69-72",
      "issn": null,
      "eIssn": null,
      "source_id": "21100376811",
      "authors": "Cello Marco; Marchese Mario; Patrone Fabio",
      "author_ids": "36025044100;7004398165;56536292600",
      "authorAffiliationIds": "60025153;60025153;60025153",
      "corresponding": "Cello M.",
      "keywords": "Congestion control | Delay tolerant networking | Nanosatellite | Next-hop selection",
      "abstract": "Nanosatellites architectures have been proposed as a costeffective solution to extend the network access in rural and remote areas. To guarantee a reliable service and a large coverage, a good number of nanosatellites and ground stations (or hot spot) must be deployed. During a data connection, a server on the Internet that wants to reply to the user on rural area, has many hot spot alternatives to whom it can deliver data. The problem of choosing the \"optimal\" hot spot becomes important because a wrong choice could lead a high delivery delay. In this paper, we propose \"HotSel\": an hot spot selection mechanism able to minimize the delivery time. HotSel is simple and practical, and outperforms two other selection mechanisms used as comparison.",
      "citations": 5,
      "quartile": null
    }
  ],
  "iris_products": [
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1267078",
      "authors": "Badini, Nour; Patrone, Fabio; Jaber, Mona",
      "legacy_id": 663727,
      "year": 2026,
      "miur_type": "268",
      "title": "Handover in satellite-terrestrial networks",
      "doi": "10.1016/b978-0-443-26526-6.00013-x",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1267077",
      "authors": "Badini, Nour; Patrone, Fabio; Zanon, Arianna Miraval; Marchese, Mario",
      "legacy_id": 663726,
      "year": 2025,
      "miur_type": "273",
      "title": "Network Simulations for Non-Terrestrial Networks: Overcoming Deployment Challenges and Advancing System Optimization",
      "scopus_id": "2-s2.0-105018050217",
      "doi": "10.1109/iccworkshops67674.2025.11162227",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1257958",
      "authors": "Badini, Nour; Patrone, Fabio; Zanon, Arianna Miraval; Marchese, Mario",
      "legacy_id": 652153,
      "year": 2025,
      "miur_type": "273",
      "title": "Evaluating Performance in Satellite Communication Networks: An NS3-Based Simulation Study",
      "scopus_id": "2-s2.0-105012214121",
      "doi": "10.1109/aero63441.2025.11068597",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1264636",
      "authors": "De Bernardi, Giacomo; Gaggero, Giovanni Battista; Patrone, Fabio; Zappatore, Sandro; Marchese, Mario; Mongelli, Maurizio",
      "legacy_id": 660623,
      "year": 2025,
      "miur_type": "262",
      "title": "Rule-Based eXplainable Autoencoder for DNS Tunneling Detection",
      "doi": "10.3390/computers14090375",
      "type": "01.01 - Articolo su rivista"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1267076",
      "authors": "Sohail, Muhammad Saad; Portomauro, Giancarlo; Gaggero, Giovanni Battista; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 663724,
      "year": 2025,
      "miur_type": "262",
      "title": "Performance Analysis and Security Preservation of DSRC in V2X Networks",
      "doi": "10.3390/electronics14193786",
      "type": "01.01 - Articolo su rivista"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1261316",
      "authors": "Rahman, Md Arafatur; Tan, Sze Wei; Sohail, Mohammed Saad; Gaggero, Giovanni Battista; Patrone, Fabio; Marchese, Mario; Pillai, Prashant",
      "legacy_id": 656438,
      "year": 2025,
      "miur_type": "273",
      "title": "CyberVehiCare: A Testbed for Cybersecurity of Vehicle to Everything (V2X) Automotive Systems",
      "doi": "10.1109/csr64739.2025.11130024",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1262899",
      "authors": "Comisso, Massimiliano; Babich, Fulvio; Buttazzoni, Giulia; Carini, Alberto; Carrato, Sergio; Marsi, Stefano; Patrone, Fabio; Sacchi, Claudio; Vatta, Francesca",
      "legacy_id": 658461,
      "year": 2025,
      "miur_type": "273",
      "title": "Power-Domain Non-Orthogonal Multiple Access for Distributed Non-Terrestrial Networks: A Semi-Analytical Throughput Estimation",
      "doi": "10.1109/metroaerospace64938.2025.11114494",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1262898",
      "authors": "Badini, N.; Jaber, M.; Marchese, M.; Patrone, F.",
      "legacy_id": 658457,
      "year": 2025,
      "miur_type": "262",
      "title": "Scalable Satellite Handover Management in Non-Terrestrial Networks: A Distributed MADQL Approach",
      "scopus_id": "2-s2.0-105012585767",
      "doi": "10.1109/TAES.2025.3594697",
      "type": "01.01 - Articolo su rivista",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1246417",
      "authors": "Rojas, Camilo; Fraire, Juan A.; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 638006,
      "year": 2025,
      "miur_type": "273",
      "title": "On the Latency Trade-off Between Space and Terrestrial Clouds in Non-Terrestrial Networks",
      "scopus_id": "2-s2.0-105002903093",
      "doi": "10.1109/asms/spsc64465.2025.10946050",
      "isi_id": "WOS:001479663300008",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1230655",
      "authors": "Aboushady, H.; Beringuier-Boher, N.; Burke, K.; Dallemagne, P.; De Biase, M.; Di Frangia, M.; Deniau, V.; Ferrari, E.; Gaquiere, C.; Morche, D.; Patrone, F.; Pesci, S.; Pomante, L.; Stam, A.; Stornelli, V.; Stratigopoulos, H. G.; Taouil, M.; Vaumorin, E.; Villain, J.; Steeghs, S.",
      "legacy_id": 614568,
      "year": 2024,
      "miur_type": "273",
      "title": "Trusted SMEs for Sustainable Growth of Europeans Economical Backbone to Strengthen the Digital Sovereignty: The KDT Resilient Trust Project",
      "scopus_id": "2-s2.0-85211958375",
      "doi": "10.1109/DSD64264.2024.00088",
      "isi_id": "WOS:001414927800079",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "1",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1203257",
      "authors": "Rojas, Camilo; Fraire, Juan A.; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 577807,
      "year": 2024,
      "miur_type": "273",
      "title": "Fuzzy Logic-Based Orchestration of Multi-Access Edge Computing in LEO Satellite Constellations",
      "scopus_id": "2-s2.0-85202450056",
      "doi": "10.1109/iccworkshops59551.2024.10615305",
      "isi_id": "WOS:001296276700279",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1203256",
      "authors": "Rojas, Camilo; Fraire, Juan A.; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 577806,
      "year": 2024,
      "miur_type": "273",
      "title": "Advanced Constellation Emulation and Synthetic Datasets Generation for Non-Terrestrial Networks",
      "scopus_id": "2-s2.0-85202354976",
      "doi": "10.1109/meditcom61057.2024.10621248",
      "isi_id": "WOS:001367960100007",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1219724",
      "authors": "Sohail, Muhammad Saad; Portamauro, Giancarlo; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 597817,
      "year": 2024,
      "miur_type": "273",
      "title": "An SDR-Based Framework for Cybersecurity Assessment of Vehicle-to-Everything (V2X) Systems",
      "scopus_id": "2-s2.0-85206183642",
      "doi": "10.1109/csr61664.2024.10679384",
      "isi_id": "WOS:001327167900081",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1230656",
      "authors": "Samandari, A.; Marchese, M.; Paglialonga, A.; Patrone, F.; Rampa, V.; Mongelli, M.",
      "legacy_id": 614569,
      "year": 2024,
      "miur_type": "273",
      "title": "Federated Learning for Rule-Based Systems: Preliminary Studies",
      "scopus_id": "2-s2.0-85213818194",
      "doi": "10.1109/RTSI61910.2024.10761552",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1203215",
      "authors": "Patrone, F.; Loreti, P.; Fiscariello, L.; Bracciale, L.; Amici, A.; Detti, A.; Roseti, C.; Zampognaro, F.; Luglio, M.; Bianchi, G.; Marchese, M.",
      "legacy_id": 577766,
      "year": 2024,
      "miur_type": "273",
      "title": "OpenSatRange: An Open Cyber Range for Operators and Users of Satellite Communication Networks",
      "scopus_id": "2-s2.0-85199538329",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1174296",
      "authors": "Caviglia, Roberto; Davoli, Franco; Fausto, Alessandro; Gaggero, Giovanni; Marchese, Mario; Moheddine, Aya; Patrone, Fabio; Portomauro, Giancarlo",
      "legacy_id": 546820,
      "year": 2024,
      "miur_type": "268",
      "title": "Vulnerability Assessment of Industrial and Agricultural Control Systems within the IoT Framework",
      "scopus_id": "2-s2.0-85194761973",
      "doi": "10.1201/9781003326236-19",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1203275",
      "authors": "Repetto, Matteo; Cambiaso, Enrico; Patrone, Fabio; Zappatore, Sandro",
      "legacy_id": 577814,
      "year": 2024,
      "miur_type": "273",
      "title": "Flying Drones to Locate Cyber-Attackers in LoRaWAN Metropolitan Networks",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1203255",
      "authors": "Badini, Nour; Jaber, Mona; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 577787,
      "year": 2024,
      "miur_type": "262",
      "title": "User Centric Satellite Handover for Multiple Traffic Profiles Using Deep Q-Learning",
      "scopus_id": "2-s2.0-85200261460",
      "doi": "10.1109/taes.2024.3434771",
      "isi_id": "WOS:001373830300023",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "1",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1152175",
      "authors": "Badini, Nour; Jaber, Mona; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 515465,
      "year": 2023,
      "miur_type": "273",
      "title": "Reinforcement Learning-Based Load Balancing Satellite Handover Using NS-3",
      "scopus_id": "2-s2.0-85178287743",
      "doi": "10.1109/ICC45041.2023.10279521",
      "isi_id": "WOS:001094862602116",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1171975",
      "authors": "Badini, Nour; Jaber, Mona; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 543545,
      "year": 2023,
      "miur_type": "273",
      "title": "Energy-Aware Satellite Handover Based on Deep Reinforcement Learning",
      "scopus_id": "2-s2.0-85190246987",
      "doi": "10.1109/gcwkshps58843.2023.10464394",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1148477",
      "authors": "Rojas, Camilo; Fraire, Juan A.; Patrone, Fabio; Gotta, Alberto; Marchese, Mario",
      "legacy_id": 510707,
      "year": 2023,
      "miur_type": "273",
      "title": "Continuous Time Emulation for Software-Defined Non-Terrestrial Edge Computing Networks",
      "scopus_id": "2-s2.0-85191259429",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1133956",
      "authors": "Marchese, Mario; Morosi, Simone; Patrone, Fabio",
      "legacy_id": 492646,
      "year": 2023,
      "miur_type": "268",
      "title": "Intelligent Space Communication Networks",
      "scopus_id": "2-s2.0-85166118794",
      "doi": "10.1007/978-3-031-30762-1_7",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1133955",
      "authors": "Marchese, Mario; Patrone, Fabio; Guidotti, Alessandro",
      "legacy_id": 492645,
      "year": 2023,
      "miur_type": "268",
      "title": "The Role of Satellite in 5G and Beyond",
      "scopus_id": "2-s2.0-85166110138",
      "doi": "10.1007/978-3-031-30762-1_2",
      "type": "02.01 - Contributo in volume (Capitolo o saggio)",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1104494",
      "authors": "Moheddine, Aya; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 448782,
      "year": 2023,
      "miur_type": "262",
      "title": "UAV‐based LoRaWAN flying gateway for the internet of flying things",
      "scopus_id": "2-s2.0-85144832641",
      "doi": "10.1002/dac.5421",
      "isi_id": "WOS:000901555000001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "3",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1124015",
      "authors": "Caviglia, Roberto; Gaggero, Giovanni; Portomauro, Giancarlo; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 478545,
      "year": 2023,
      "miur_type": "262",
      "title": "An SDR-Based Cybersecurity Verification Framework for Smart Agricultural Machines",
      "scopus_id": "2-s2.0-85161519280",
      "doi": "10.1109/ACCESS.2023.3282169",
      "isi_id": "WOS:001005769100001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "8",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1148476",
      "authors": "Olmedo, Matias; Andres Fraire, Juan; Cherini, Renato; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 510706,
      "year": 2023,
      "miur_type": "273",
      "title": "Routing in Scalable Delay-Tolerant Space Networks with Graph Neural Networks",
      "scopus_id": "2-s2.0-85200537490",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "0"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1094286",
      "authors": "Luglio, M.; Marchese, M.; Patrone, F.; Roseti, C.; Zampognaro, F.",
      "legacy_id": 433535,
      "year": 2022,
      "miur_type": "262",
      "title": "Performance Evaluation of a Satellite Communication-based MEC architecture for IoT applications",
      "scopus_id": "2-s2.0-85136848513",
      "doi": "10.1109/TAES.2022.3199330",
      "isi_id": "WOS:000866503000006",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "17",
      "citations_scopus": "24"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1094313",
      "authors": "Badini, Nour; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 433571,
      "year": 2022,
      "miur_type": "273",
      "title": "NS-3-based 5G Satellite-Terrestrial Integrated Network Simulator",
      "scopus_id": "2-s2.0-85136415922",
      "doi": "10.1109/MELECON53508.2022.9843098",
      "isi_id": "WOS:000854091100028",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "9",
      "citations_scopus": "22"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1091435",
      "authors": "Gaggero, Giovanni Battista; Fausto, Alessandro; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 430156,
      "year": 2022,
      "miur_type": "273",
      "title": "A Framework for Network Security Verification of Automated Vehicles in the Agricultural Domain",
      "scopus_id": "2-s2.0-85135051185",
      "doi": "10.1109/IEEECONF55059.2022.9810440",
      "isi_id": "WOS:000853483400014",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1082760",
      "authors": "Cassara, P.; Gotta, A.; Marchese, M.; Patrone, F.",
      "legacy_id": 420814,
      "year": 2022,
      "miur_type": "262",
      "title": "Orbital Edge Offloading on Mega-LEO Satellite Constellations for Equal Access to Computing",
      "scopus_id": "2-s2.0-85128868852",
      "doi": "10.1109/MCOM.001.2100818",
      "isi_id": "WOS:000792915900015",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "52",
      "citations_scopus": "77"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1096241",
      "authors": "Galli, A.; Giardina, P.; Guta, M.; Lossi, L.; Mancina, A.; Moscato, V.; Patrone, F.; Roseti, C.; Romano, S. P.; Sperli, G.; Zampognaro, F.",
      "legacy_id": 436303,
      "year": 2022,
      "miur_type": "273",
      "title": "AI for Zero-Touch Management of Satellite Networks in B5G and 6G Infrastructures",
      "scopus_id": "2-s2.0-85137830247",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1098261",
      "authors": "Fausto, A.; Gaggero, G. B.; Patrone, F.; Marchese, M.",
      "legacy_id": 439573,
      "year": 2022,
      "miur_type": "262",
      "title": "Reduction of the Delays within an Intrusion Detection System (IDS) based on Software Defined Networking (SDN)",
      "scopus_id": "2-s2.0-85140779316",
      "doi": "10.1109/ACCESS.2022.3214974",
      "isi_id": "WOS:000871012300001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "8",
      "citations_scopus": "14"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1094285",
      "authors": "Moheddine, Aya; Patrone, Fabio; Marchese, Mario",
      "legacy_id": 433533,
      "year": 2022,
      "miur_type": "273",
      "title": "Comparison between UAV IoT solutions with and without satellite backhaul link",
      "scopus_id": "2-s2.0-85137585931",
      "doi": "10.1109/AERO53065.2022.9843367",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1091434",
      "authors": "Davoli, F.; Marchese, M.; Patrone, F.",
      "legacy_id": 430153,
      "year": 2022,
      "miur_type": "262",
      "title": "Flow Assignment and Processing on a Distributed Edge Computing Platform",
      "scopus_id": "2-s2.0-85132519369",
      "doi": "10.1109/TVT.2022.3172792",
      "isi_id": "WOS:000846892800061",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "1",
      "citations_scopus": "1"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1080140",
      "authors": "Patrone, F.; Bacci, G.; Galli, A.; Giardina, P.; Landi, G.; Luglio, M.; Marchese, M.; Quadrini, M.; Roseti, C.; Sperli, G.; Vaccaro, A.; Zampognaro, F.",
      "legacy_id": 417976,
      "year": 2021,
      "miur_type": "273",
      "title": "Data-driven Network Orchestrator for 5G Satellite-Terrestrial Integrated Networks: The ANChOR Project",
      "scopus_id": "2-s2.0-85184374513",
      "doi": "10.1109/GLOBECOM46510.2021.9685584",
      "isi_id": "WOS:000790747203006",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "8",
      "citations_scopus": "9"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1049344",
      "authors": "Patrone, Fabio; Marchese, Mario; Ciulli, Nicola; Landi, Giada; Carrozzo, Gino; Vaccaro, Attilio; Bacci, Giacomo; Sperlì, Giancarlo; Gallo, Antonio; Roseti, Cesare; Zampognaro, Francesco; Quadrini, Mattia",
      "legacy_id": 382801,
      "year": 2021,
      "miur_type": "273",
      "title": "Data-driven, real-time automation of network slice management in 5G infrastructures integrating satellite networks",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1040998",
      "authors": "Gaggero, Giovanni Battista; Marchese, Mario; Moheddine, Aya; Patrone, Fabio",
      "legacy_id": 373341,
      "year": 2021,
      "miur_type": "262",
      "title": "A Possible Smart Metering System Evolution for Rural and Remote Areas Employing Unmanned Aerial Vehicles and Internet of Things in Smart Grids",
      "scopus_id": "2-s2.0-85101391601",
      "doi": "10.3390/s21051627",
      "isi_id": "WOS:000628638400001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "22",
      "citations_scopus": "33"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1091436",
      "authors": "Di Pinto, Alessandro; Carullo, Moreno; Carcano, Andrea; Marchese, Mario; Patrone, Fabio; Fausto, Alessandro; Gaggero, GIOVANNI BATTISTA",
      "legacy_id": 430158,
      "year": 2021,
      "miur_type": "285",
      "title": "METHOD AND APPARATUS FOR DETECTING ANOMALIES OF A DNS TRAFFIC",
      "type": "05.01 - Brevetto"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1054777",
      "authors": "de la Vara, Jose Luis; Bauer, Thomas; Fischer, Bernhard; Karaca, Mustafa; Madeira, Henrique; Matschnig, Martin; Mazzini, Silvia; Nandi, Giann Spilere; Patrone, Fabio; Pereira, David; Proença, José; Schlick, Rupert; Tonetta, Stefano; Yayan, Ugur; Sangchoolie, Behrooz",
      "legacy_id": 388959,
      "year": 2021,
      "miur_type": "273",
      "title": "A Proposal for the Classification of Methods for Verification and Validation of Safety, Cybersecurity, and Privacy of Automated Systems",
      "scopus_id": "2-s2.0-85115267442",
      "doi": "10.1007/978-3-030-85347-1_24",
      "isi_id": "WOS:001359449900024",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "6"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1060276",
      "authors": "Fausto, Alessandro; Gaggero, Giovanni Battista; Patrone, Fabio; Girdinio, Paola; Marchese, Mario",
      "legacy_id": 394828,
      "year": 2021,
      "miur_type": "262",
      "title": "Toward the Integration of Cyber and Physical Security Monitoring Systems for Critical Infrastructures",
      "scopus_id": "2-s2.0-85117331623",
      "doi": "10.3390/s21216970",
      "isi_id": "WOS:000719071500001",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "22",
      "citations_scopus": "26"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1019951",
      "authors": "Marchese, Mario; Moheddine, Aya; Patrone, Fabio",
      "legacy_id": 347966,
      "year": 2020,
      "miur_type": "273",
      "title": "UAV and Satellite Employment for the Internet of Things Use Case",
      "scopus_id": "2-s2.0-85092559710",
      "doi": "10.1109/AERO47225.2020.9172701",
      "isi_id": "WOS:000681699104027",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/954391",
      "authors": "Babich, Fulvio; Comisso, Massimiliano; Cuttin, Alessandro; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 274073,
      "year": 2020,
      "miur_type": "262",
      "title": "Nanosatellite-5G Integration in the Millimeter Wave Domain: A Full Top-Down Approach",
      "scopus_id": "2-s2.0-85078249094",
      "doi": "10.1109/TMC.2019.2897091",
      "isi_id": "WOS:000508372700011",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "28",
      "citations_scopus": "43"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1003819",
      "authors": "Marchese, Mario; Patrone, Fabio",
      "legacy_id": 329935,
      "year": 2020,
      "miur_type": "262",
      "title": "E-CGR: Energy-aware Contact Graph Routing over Nanosatellite Networks",
      "scopus_id": "2-s2.0-85089595735",
      "doi": "10.1109/TGCN.2020.2978296",
      "isi_id": "WOS:000722245300022",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "25",
      "citations_scopus": "39"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1020113",
      "authors": "Decola, Tomaso; Marchese, Mario; Mongelli, Maurizio; Patrone, Fabio",
      "legacy_id": 348148,
      "year": 2020,
      "miur_type": "262",
      "title": "A Unified Optimisation Framework for QoS Management and Congestion Control in VHTS Systems",
      "scopus_id": "2-s2.0-85095710975",
      "doi": "10.1109/TVT.2020.3015252",
      "isi_id": "WOS:000584250300018",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "5",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1020170",
      "authors": "Davoli, Franco; Marchese, Mario; Patrone, Fabio; de Cola, Tomaso; Mongelli, Maurizio",
      "legacy_id": 348207,
      "year": 2020,
      "miur_type": "273",
      "title": "Smart Gateway Diversity Strategies for Q/V Feeder Links in SDN-Satellite Networks",
      "scopus_id": "2-s2.0-85092709233",
      "doi": "10.1109/MedComNet49392.2020.9191584",
      "isi_id": "WOS:000853831000020",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "1",
      "citations_scopus": "4"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1019186",
      "authors": "Marchese, Mario; Moheddine, Aya; Patrone, Fabio; Cola, Tomaso de; Mongelli, Maurizio",
      "legacy_id": 347100,
      "year": 2020,
      "miur_type": "273",
      "title": "QoS-Aware Handover Strategies for Q/V Feeder Links in VHTS Systems",
      "scopus_id": "2-s2.0-85089430667",
      "doi": "10.1109/ICC40277.2020.9148805",
      "isi_id": "WOS:000606970301044",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/999943",
      "authors": "Kanapram, Divya Thekke; Patrone, Fabio; Marin-Plaza, Pablo; Marchese, Mario; Bodanese, Eliane L; Marcenaro, Lucio; Gomez, David Martin; Regazzoni, Carlo",
      "legacy_id": 325510,
      "year": 2020,
      "miur_type": "262",
      "title": "Collective awareness for abnormality detection in connected autonomous vehicles",
      "scopus_id": "2-s2.0-85084924836",
      "doi": "10.1109/JIOT.2020.2974680",
      "isi_id": "WOS:000536066300009",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "13",
      "citations_scopus": "18"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/999001",
      "authors": "Moheddine, A.; Patrone, F.; Marchese, M.",
      "legacy_id": 324435,
      "year": 2019,
      "miur_type": "273",
      "title": "UAV and IoT integration: A flying gateway",
      "scopus_id": "2-s2.0-85079158083",
      "doi": "10.1109/ICECS46596.2019.8965135",
      "isi_id": "WOS:000534573400037",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "25",
      "citations_scopus": "30"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/1003829",
      "authors": "Moheddine, Aya; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 329940,
      "year": 2019,
      "miur_type": "273",
      "title": "Towards Increasing the LoRa Network Coverage: A Flying Gateway",
      "scopus_id": "2-s2.0-85084377455",
      "doi": "10.1109/ISAECT47714.2019.9069697",
      "isi_id": "WOS:000569987700026",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "2",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/979230",
      "authors": "Davoli, F.; Marchese, M.; Patrone, F.",
      "legacy_id": 302183,
      "year": 2019,
      "miur_type": "273",
      "title": "Flow assignment in multi-core network processors",
      "scopus_id": "2-s2.0-85107048873",
      "doi": "10.1007/978-3-030-34960-8_43",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "2"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/920039",
      "authors": "Davoli, F.; Kourogiorgas, C.; Marchese, M.; Panagopoulos, A.; Patrone, F",
      "legacy_id": 235019,
      "year": 2019,
      "miur_type": "262",
      "title": "Small satellites and CubeSats: survey of structures, architectures, and protocols",
      "scopus_id": "2-s2.0-85052965154",
      "doi": "10.1002/sat.1277",
      "isi_id": "WOS:000473608100004",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "56",
      "citations_scopus": "84"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/975605",
      "dc.identifier.pmid": "31454994",
      "authors": "Marchese, M.; Moheddine, Aya; Patrone, F.",
      "legacy_id": 298127,
      "year": 2019,
      "miur_type": "262",
      "title": "IoT and UAV Integration in 5G Hybrid Terrestrial-Satellite Networks",
      "scopus_id": "2-s2.0-85071745275",
      "doi": "10.3390/s19173704",
      "isi_id": "WOS:000486861900074",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "84",
      "citations_scopus": "117"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/979232",
      "authors": "Bacco, M.; Davoli, F.; Giambene, G.; Gotta, A.; Luglio, M.; Marchese, M.; Patrone, F.; Roseti, C.",
      "legacy_id": 302188,
      "year": 2019,
      "miur_type": "273",
      "title": "Networking Challenges for Non-Terrestrial Networks Exploitation in 5G",
      "scopus_id": "2-s2.0-85076813904",
      "doi": "10.1109/5GWF.2019.8911669",
      "isi_id": "WOS:000534560500114",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "23",
      "citations_scopus": "39"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/954399",
      "authors": "Bacco, M.; Boero, L.; Cassara, P.; Colucci, M.; Gotta, A.; Marchese, M.; Patrone, F.",
      "legacy_id": 274100,
      "year": 2019,
      "miur_type": "262",
      "title": "IoT applications and services in space information networks",
      "scopus_id": "2-s2.0-85065041414",
      "doi": "10.1109/MWC.2019.1800297",
      "isi_id": "WOS:000466553300007",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "78",
      "citations_scopus": "94"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/920009",
      "authors": "Boero, L.; Bruschi, R.; Davoli, F.; Marchese, M.; Patrone, F.",
      "legacy_id": 235005,
      "year": 2018,
      "miur_type": "262",
      "title": "Satellite networking integration in the 5G ecosystem: Research trends and open challenges",
      "scopus_id": "2-s2.0-85054382434",
      "doi": "10.1109/MNET.2018.1800052",
      "isi_id": "WOS:000446529900003",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "96",
      "citations_scopus": "130"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/920283",
      "authors": "Bacco, Manlio; Cassarà, Pietro; Colucci, Marco; Gotta, Alberto; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 235292,
      "year": 2018,
      "miur_type": "273",
      "title": "A Survey on Network Architectures and Applications for Nanosat and UAV Swarms",
      "scopus_id": "2-s2.0-85043976241",
      "doi": "10.1007/978-3-319-76571-6_8",
      "isi_id": "WOS:000451340600008",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "8",
      "citations_scopus": "23"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/920299",
      "authors": "Boero, Luca; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 235314,
      "year": 2018,
      "miur_type": "262",
      "title": "The impact of delay in software-defined integrated terrestrial-satellite networks",
      "scopus_id": "2-s2.0-85051869483",
      "doi": "10.1109/CC.2018.8438270",
      "isi_id": "WOS:000441172600003",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "23",
      "citations_scopus": "29"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/954395",
      "authors": "Marchese, M.; Patrone, F.",
      "legacy_id": 274094,
      "year": 2018,
      "miur_type": "273",
      "title": "Energy-aware Routing Algorithm for DTN-Nanosatellite Networks",
      "scopus_id": "2-s2.0-85063532504",
      "doi": "10.1109/GLOCOM.2018.8647491",
      "isi_id": "WOS:000465774302028",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "7",
      "citations_scopus": "8"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/876068",
      "authors": "Boero, Luca; Cello, M; Gnecco, GIORGIO STEFANO; Marchese, Mario; Patrone, Fabio; Sanguineti, Marcello",
      "legacy_id": 186699,
      "year": 2017,
      "miur_type": "262",
      "title": "A theoretical analysis of buffer occupancy for Intermittently-Connected Networks",
      "scopus_id": "2-s2.0-85028807758",
      "doi": "10.1016/j.peva.2017.08.001",
      "isi_id": "WOS:000412620900006",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "8",
      "citations_scopus": "10"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/920294",
      "authors": "Marchese, Mario; Patrone, Fabio",
      "legacy_id": 235304,
      "year": 2017,
      "miur_type": "273",
      "title": "A Source Routing Algorithm Based on CGR for DTN-Nanosatellite Networks",
      "scopus_id": "2-s2.0-85046404054",
      "doi": "10.1109/GLOCOM.2017.8255092",
      "isi_id": "WOS:000428054306040",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "6",
      "citations_scopus": "13"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/876000",
      "authors": "Marchese, Mario; Patrone, Fabio; Cello, Marco",
      "legacy_id": 186613,
      "year": 2017,
      "miur_type": "262",
      "title": "DTN-based Nanosatellite Architecture and Hot Spot Selection Algorithm for Remote Areas Connection",
      "scopus_id": "2-s2.0-85028453407",
      "doi": "10.1109/TVT.2017.2739298",
      "isi_id": "WOS:000422924200056",
      "type": "01.01 - Articolo su rivista",
      "citations_isi": "26",
      "citations_scopus": "30"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/876079",
      "authors": "Marco, Cello; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 186711,
      "year": 2016,
      "miur_type": "273",
      "title": "SatSel: A Satellite Selection Algorithm to reduce delivery time in DTN-Nanosatellite Networks for Internet Access in Rural Areas.",
      "type": "04.01 - Contributo in atti di convegno"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/876075",
      "authors": "Cello, Marco; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 186705,
      "year": 2016,
      "miur_type": "273",
      "title": "ColdSel: A selection algorithm to mitigate congestion situations over nanosatellite networks",
      "scopus_id": "2-s2.0-85015393984",
      "doi": "10.1109/GLOCOM.2016.7841670",
      "isi_id": "WOS:000401963301026",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "4",
      "citations_scopus": "7"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/876072",
      "authors": "Cello, Marco; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 186702,
      "year": 2016,
      "miur_type": "273",
      "title": "Research challenges in nanosatellite-DTN networks",
      "scopus_id": "2-s2.0-84996559034",
      "doi": "10.1007/978-3-319-47081-8_8",
      "isi_id": "WOS:000401100000008",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "0",
      "citations_scopus": "3"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/813610",
      "authors": "Cello, Marco; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 117832,
      "year": 2015,
      "miur_type": "273",
      "title": "HotSel: A Hot Spot Selection Algorithm for Internet Access in Rural Areas through Nanosatellite Networks",
      "scopus_id": "2-s2.0-84964853741",
      "doi": "10.1109/GLOCOM.2015.7417202",
      "isi_id": "WOS:000382389301102",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_isi": "3",
      "citations_scopus": "11"
    },
    {
      "link": "https://unige.iris.cineca.it/handle/11567/809583",
      "authors": "Cello, Marco; Marchese, Mario; Patrone, Fabio",
      "legacy_id": 112217,
      "year": 2014,
      "miur_type": "273",
      "title": "Hot spot selection in rural access nanosatellite networks",
      "scopus_id": "2-s2.0-84924054728",
      "doi": "10.1145/2645672.2645687",
      "type": "04.01 - Contributo in atti di convegno",
      "citations_scopus": "5"
    }
  ],
  "retrieved_at": "2025-11-14T15:17:50.562116"
}